[
  {
    "title": "South Korea Suspects North Korea-Linked Lazarus Behind $36M Upbit Hack",
    "description": "On Thursday, South Korea's largest digital asset exchange, Upbit, suspended deposits and withdrawals after detecting unusual activity in the Solana network tokens.",
    "link": "https://www.coindesk.com/markets/2025/11/28/south-korea-suspects-north-korea-linked-lazarus-behind-usd36m-upbit-hack",
    "thumbnail": "",
    "pubDate": "2025-11-28T05:18:56+00:00"
  },
  {
    "title": "Millennials are driving a sports tourism boom — and spending big to do it. Here's why",
    "description": "The $707 billion sports tourism market is set to nearly triple by 2032, with Asia-Pacific as the fastest growing region.",
    "link": "https://www.cnbc.com/2025/11/28/millennials-are-driving-a-sports-tourism-boom-spending-big-to-do-it.html",
    "thumbnail": "https://image.cnbcfm.com/api/v1/image/108233245-1764308092407-gettyimages-2180133527-141_0824_129356.jpeg?v=1764308126&w=1920&h=1080",
    "pubDate": "2025-11-28T05:18:24+00:00"
  },
  {
    "title": "Solana Traders Hit by Months-Long Browser Malware That Skimmed Every Swap",
    "description": "Wallet interfaces typically summarize instructions as a single swap, and the bundled transaction executes atomically—meaning users unknowingly sign off on both.",
    "link": "https://www.coindesk.com/markets/2025/11/28/solana-traders-hit-by-months-long-browser-malware-that-skimmed-every-swap",
    "thumbnail": "",
    "pubDate": "2025-11-28T05:03:13+00:00"
  },
  {
    "title": "Crypto sentiment recovers to levels when Bitcoin last traded over $100K",
    "description": "Despite Bitcoin remaining below $100,000, crypto sentiment is improving as the cryptocurrency has climbed above $90,000.",
    "link": "https://cointelegraph.com/news/crypto-market-sentiment-levels-bitcoin-price-industry-anticipation?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
    "thumbnail": "https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=1200/https://s3.cointelegraph.com/uploads/2025-07/0197c42d-9e0c-75df-b8a1-e622f1d13c6a",
    "pubDate": "2025-11-28T04:59:56+00:00"
  },
  {
    "title": "Putin says he is ready to guarantee in writing no Russian attack on Europe",
    "description": "Putin also branded fears that Moscow is planning to invade another European nation 'ridiculous' and 'complete nonsense'.",
    "link": "https://www.aljazeera.com/news/2025/11/28/putin-says-he-is-ready-to-guarantee-in-writing-no-russian-attack-on-europe?traffic_source=rss",
    "thumbnail": "https://www.aljazeera.com/wp-content/uploads/2025/11/2025-11-27T145104Z_1263230216_RC225IABCVIC_RTRMADP_3_UKRAINE-CRISIS-RUSSIA-PUTIN-1764293864.jpg?resize=1920%2C1440",
    "pubDate": "2025-11-28T04:37:30+00:00"
  },
  {
    "title": "4K Blu-Ray Editions Of Superman, F1, And Jurassic World Rebirth Are $13 For Black Friday",
    "description": "Superman (4K Blu-ray) $12.49 (was $35) See at Amazon F1: The Movie (4K Blu-ray) $12.49 (was $30) See at Amazon Jurassic World Rebirth: Collector's Edition (4K Blu-ray) $13.49 (was $30) See at Amazon A whole bunch of recently released 4K Blu-ray films are discounted for Black Friday, including three popular movies that are now available for their lowest price ever--Superman, F1: The Movie, and Jurassic World Rebirth. These Black Friday deals won't stick around much longer, so if you're interested in adding them to your collection for cheap, swing by Amazon and check them out soon. Superman (4K Blu-ray) $12.49 (was $35) Superman hit theaters in July, and now you can bring it home for $12.49 (was $35). You'll get a 4K Blu-ray and digital copy of the film, plus over 90 minutes of bonus features. This includes behind-the-scenes featurettes like \"Adventures in the Making of Superman\" and an animated short. Both Dolby Vision and Dolby Atmos are supported, making this the most premium way to enjoy the superhero flick in your home theater. See at Amazon F1: The Movie (4K Blu-ray) $12.49 (was $30) Starring Brad Pitt and directed by Joseph Kosinski, director of Top Gun: Maverick, F1: The Movie earned high praise for its impressive visuals and special effects--if you're a racing fan, it's certainly worth checking out. Beyond 4K Blu-ray and digital copies of the movie, you'll get special features such as the \"Inside the F1: The Movie Table Read\" and a look at sets and locations from around the world. Dolby Vision and Dolby Atmos are once again supported. See at Amazon Jurassic World Rebirth: Collector's Edition (4K Blu-ray) $13.49 (was $30) This Collector's Edition comes with 4K Blu-ray, standard Blu-ray, and digital copies of Jurassic World Rebirth. Dolby Vision and Dolby Atmos are supported, and you'll find over an hour of bonus features packed into the bundle. This includes deleted scenes, an alternate opening, and a making-of documentary, among plenty of other featurettes. Starring Scarlett Johansson and Mahershala Ali, it earned mixed reviews (but no doubt it's a fun summer blockbuster). See at Amazon While the 4K Blu-ray deals are arguably the most enticing, two of the above films are also available for cheap on standard Blu-ray. The Superman Blu-ray is $9.49 (was $30), and it gets you all the same bonus features as its fancier 4K sibling. It also supports Dolby Atmos. F1: The Movie on Blu-ray is also $9.49 (was $25), once again getting you the same bonus features as the 4K edition, plus support for Dolby Atmos. But since the 4K version of both these films is just a few bucks more expensive, most shoppers will probably find them to be the better option than standard Blu-ray. And if you want to add even more movies to your home theater, check out the Criterion Collection Black Friday Sale at Amazon, which is offering 50% discounts on hundreds of iconic films. Continue Reading at GameSpot",
    "link": "https://www.gamespot.com/articles/4k-blu-ray-editions-of-superman-f1-and-jurassic-world-rebirth-are-13-for-black-friday/1100-6536552/?ftag=CAD-01-10abi2f",
    "thumbnail": "https://www.gamespot.com/a/uploads/screen_kubrick/1702/17023653/4612950-gamespot_deals_156-overlay%282%29-overlay.jpg",
    "pubDate": "2025-11-28T04:34:00+00:00"
  },
  {
    "title": "The Avengers Helicarrier Lego Model Is 50% Off At Walmart",
    "description": "Lego Marvel: The Avengers Helicarrier (509 Pieces) $40 (was $80) | Black Friday Deal See at Walmart Walmart is holding a big Black Friday sale on Lego, and for Marvel fans, now is a great time to pick up the Lego Marvel Avengers Helicarrier at 50% off. On sale for $40 (was $80), this 509-piece model is a compact and detailed replica of the aerial base of operations used by Nick Fury and the Avengers in the Marvel movies. Lego Marvel: The Avengers Helicarrier (509 Pieces) $40 (was $80) | Black Friday Deal Measuring over 13 inches long and 8.5 inches wide, the helicarrier is designed as a display piece. It can be mounted on a sturdy base after assembly, and it features numerous screen-accurate details in Lego form. The runway features pieces resembling Quinjets, engines powered by Tony Stark's Arc Reactor technology, a series of propellers to keep the vessel airborne, and a command deck overseeing all operations. This makes for a quick lunchtime build, and like other Lego sets, you'll find the instruction booklet included. You can also use the Lego Builder app for an interactive walkthrough of each step. See at Walmart Another notable Lego Marvel deal at Walmart is the Marvel Logo and Minifigures set. This 931-piece set is priced at $80 (was $100) for Black Friday, and it's a tribute to the Marvel Cinematic Universe. Not only can you build the iconic Marvel logo, but you can also make several minifigures spring out from secret compartments. Amazon is also price-matching this set, in case it sells out at Walmart. Walmart has also discounted several other popular Star Wars Lego vehicles. The 630-piece Executor Super Star Destroyer is on sale for $40 (was $70), Princess Leia's transport vessel Tantive IV has been discounted by 50% to $40, and you can pair that with the diorama piece Boarding the Tantive IV for $38.49 (was $55). The 502-piece set is being retired soon, so this is a nice deal on a set that accurately recreates the opening scene from A New Hope. Continue Reading at GameSpot",
    "link": "https://www.gamespot.com/articles/the-avengers-helicarrier-lego-model-is-50-off-at-walmart/1100-6536546/?ftag=CAD-01-10abi2f",
    "thumbnail": "https://www.gamespot.com/a/uploads/screen_kubrick/1601/16018044/4612921-lego-shield.jpg",
    "pubDate": "2025-11-28T04:29:00+00:00"
  },
  {
    "title": "DOGE Underperforms Majors as Support Failure Confirms Bearish Shift",
    "description": "The $0.150 level is now a critical support point, with further declines likely if it is breached.",
    "link": "https://www.coindesk.com/markets/2025/11/28/doge-underperforms-majors-as-support-failure-confirms-bearish-shift",
    "thumbnail": "",
    "pubDate": "2025-11-28T04:24:52+00:00"
  },
  {
    "title": "Asia-Pacific stocks trade mixed as Tokyo inflation runs hotter than expected",
    "description": "Traders in Asia will assess key economic data, including inflation data from Tokyo and India's GDP for its fiscal second quarter, ending September.",
    "link": "https://www.cnbc.com/2025/11/28/asia-markets-live.html",
    "thumbnail": "https://image.cnbcfm.com/api/v1/image/108115939-1741929513555-gettyimages-1220737608-shibuyacrossrushhour-5.jpeg?v=1742947637&w=1920&h=1080",
    "pubDate": "2025-11-28T04:21:40+00:00"
  },
  {
    "title": "Spider-Man Magic: The Gathering Gift Bundle &amp; Collector Booster Box Get Huge Black Friday Price Cuts",
    "description": "Magic: The Gathering Spider-Man Gift Bundle $68 (was $90) | Black Friday Deal See at Amazon Magic: The Gathering Spider-Man Collector Booster Box (12 Packs) $350 (was $455) | Black Friday Deal See at Amazon Magic: The Gathering's Spider-Man Gift Bundle is on sale for only $68 (was $90) in Amazon's Black Friday sale. Restocked in October after being sold out for months, the Gift Bundle comes with everything found in the regular Spider-Man Bundle (sold out) as well as a Collector Booster Pack, which is selling for $43 on its own. The Gift Bundle also comes with nine standard Boosters (14 cards each), an Alternate-Art Foil Promo Card, and numerous accessories, including a Spider-Man themed card storage box. Speaking of Collector Booster Packs, Amazon has also slashed the price of the MTG Spider-Man Collector Booster Box by over $100 during its sale. The discount brings the price for 12 Collector Booster Packs to roughly $29 each. These are eye-catching deals for Magic: The Gathering products that launched two months ago, but the best MTG deal at Amazon is probably the Final Fantasy Play Booster Box for $130 (was $210), which is by far the best deal yet for the exceedingly popular MTG set. The Spider-Man Play Booster Box, meanwhile, is discounted to $142 (was $210). Continue Reading at GameSpot",
    "link": "https://www.gamespot.com/articles/marvel-spider-man-magic-the-gathering-trading-card-restock-amazon-preorder/1100-6529819/?ftag=CAD-01-10abi2f",
    "thumbnail": "https://www.gamespot.com/a/uploads/screen_kubrick/1595/15950357/4598032-spider-mangiftbundlethumbnail.jpg",
    "pubDate": "2025-11-28T04:18:00+00:00"
  },
  {
    "title": "Trump Uses National Guard Shooting to Cast Suspicion on Refugees",
    "description": "President Trump claimed there were “a lot of problems with Afghans,” without providing evidence, as his administration announced that it was implementing new immigration guidelines.",
    "link": "https://www.nytimes.com/2025/11/27/us/politics/trump-national-guard-shooting.html",
    "thumbnail": "https://static01.nyt.com/images/2025/11/27/multimedia/27dc-trump-sub-bztq/27dc-trump-sub-bztq-facebookJumbo.jpg",
    "pubDate": "2025-11-28T04:16:31+00:00"
  },
  {
    "title": "South Africa’s central bank says no ‘strong immediate need’ for CBDC",
    "description": "The South African Reserve Bank found no short-term need for a retail CBDC, saying wholesale or cross-border uses should be explored instead.",
    "link": "https://cointelegraph.com/news/south-africa-central-bank-no-strong-immediate-need-for-cbdc?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
    "thumbnail": "https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=1200/https://s3.cointelegraph.com/uploads/2025-01/0194bc2a-4985-75c5-af4e-6dde43ddf89c",
    "pubDate": "2025-11-28T04:11:34+00:00"
  },
  {
    "title": "XRP Faces Downside Risk as Historical Patterns Point to $1.50",
    "description": "XRP needs to reclaim $2.20 and break $2.23–$2.24 to regain upward momentum, as technical indicators remain bearish.",
    "link": "https://www.coindesk.com/markets/2025/11/28/xrp-faces-downside-risk-as-historical-patterns-point-to-usd1-50",
    "thumbnail": "",
    "pubDate": "2025-11-28T03:50:41+00:00"
  },
  {
    "title": "Jordan demands Russia stop recruiting citizens after two killed in fighting",
    "description": "Aman says it will take 'all available measures' to stop its citizens from being recruited to fight for Russian forces.",
    "link": "https://www.aljazeera.com/news/2025/11/28/jordan-demands-russia-stop-recruiting-citizens-after-two-killed-in-fighting?traffic_source=rss",
    "thumbnail": "https://www.aljazeera.com/wp-content/uploads/2025/11/2025-10-15T123318Z_979378548_RC2ACHAF5H3E_RTRMADP_3_UKRAINE-CRISIS-RUSSIA-CONSCRIPTS-1764296104.jpg?resize=1920%2C1440",
    "pubDate": "2025-11-28T03:45:01+00:00"
  },
  {
    "title": "MegaETH’s $500M Pre-Deposit Turns Into a Full Rewind After Missteps Pile Up",
    "description": "The issues began immediately at launch, when transactions failed because the contract contained an incorrect SaleUUID, requiring a 4-of-6 multisig update.",
    "link": "https://www.coindesk.com/markets/2025/11/28/megaeth-s-usd500m-pre-deposit-turns-into-a-full-rewind-after-missteps-pile-up",
    "thumbnail": "",
    "pubDate": "2025-11-28T03:30:28+00:00"
  },
  {
    "title": "Labour drops plan to give workers protection from unfair dismissal from first day in a job",
    "description": "Employees will instead get the right after six months - the promise was a key pledge in the party's manifesto ahead of last year's general election.",
    "link": "https://www.bbc.com/news/articles/cx2d7j350q1o?at_medium=RSS&at_campaign=rss",
    "thumbnail": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/3183/live/8c8bb0d0-cbcb-11f0-8e93-71481b645865.jpg",
    "pubDate": "2025-11-28T03:30:10+00:00"
  },
  {
    "title": "Sonic Racing: CrossWorlds Steeply Discounted, Comes With $10 Amazon Credit",
    "description": "Sonic Racing: CrossWorlds - Amazon Exclusive Edition $40 (was $70) | Free $10 Amazon Credit See at Amazon See at Walmart ($30) Amazon's Black Friday deal on Sonic Racing: CrossWorlds is even better now than earlier in the week. The Amazon Exclusive Edition, which includes a free double-sided poster inside the box, is on sale for $40 on Switch, PS5, and Xbox Series X. Amazon's original deal discounted the new Segao arcade racer to $45, but the new offer has an additional bonus: a free $10 Amazon Credit. Just head to this page and add a physical edition to your cart to activate the promotion. Alternatively, you can click the promotion on the game's store page or enter promo code SONIC10 at checkout. Amazon Exclusive Edition + $10 Credit: Continue Reading at GameSpot",
    "link": "https://www.gamespot.com/articles/sonic-racing-crossworlds-steeply-discounted-comes-with-10-amazon-credit/1100-6536095/?ftag=CAD-01-10abi2f",
    "thumbnail": "https://www.gamespot.com/a/uploads/screen_kubrick/1701/17013431/4610862-soniccrossworlds.jpg",
    "pubDate": "2025-11-28T03:26:00+00:00"
  },
  {
    "title": "Switzerland delays crypto tax info sharing until 2027",
    "description": "Switzerland will enshrine a global crypto tax sharing framework into law on Jan. 1, but will delay implementing it until at least 2027.",
    "link": "https://cointelegraph.com/news/switzerland-delays-crypto-tax-info-sharing-until-2027?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
    "thumbnail": "https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=1200/https://s3.cointelegraph.com/uploads/2025-11/019ac7c0-2183-7f9a-99d7-d11276ddaba3",
    "pubDate": "2025-11-28T03:25:35+00:00"
  },
  {
    "title": "For Shooting Suspect, a Long Path of Conflict From Afghanistan to America",
    "description": "Rahmanullah Lakanwal was among the Afghans who came to the United States after the Taliban takeover of Afghanistan. Earlier, he served in a paramilitary unit that worked with U.S. forces.",
    "link": "https://www.nytimes.com/2025/11/27/us/guard-shooting-suspect-profile.html",
    "thumbnail": "https://static01.nyt.com/images/2025/12/27/multimedia/27dc-shooting-suspect-profile-promo-kfbq/27dc-shooting-suspect-profile-promo-kfbq-facebookJumbo.jpg",
    "pubDate": "2025-11-28T03:22:27+00:00"
  },
  {
    "title": "Trump says US will stop Venezuelan drug trafficking ‘by land’ soon",
    "description": "US president claims attacks on vessels in Latin American region have stopped 85 percent of drugs trafficked by sea.",
    "link": "https://www.aljazeera.com/news/2025/11/28/trump-says-us-will-soon-stop-venezuelan-drug-trafficking-by-land?traffic_source=rss",
    "thumbnail": "https://www.aljazeera.com/wp-content/uploads/2025/11/2025-11-23T184811Z_775123458_RC27ZHA1AUN1_RTRMADP_3_USA-TRUMP-VENEZUELA-1764297718.jpg?resize=1920%2C1440",
    "pubDate": "2025-11-28T03:05:25+00:00"
  },
  {
    "title": "Animoca eyes stablecoins, AI, DePIN as it expands focus in 2026: Exec",
    "description": "Animoca Brands’ Keyvan Peymani says the Web3 gaming company is exploring all segments of the crypto industry, including DePIN, DeFi and AI.",
    "link": "https://cointelegraph.com/news/animoca-brands-gaming-stablecoins-ai-depin-investments?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
    "thumbnail": "https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=1200/https://s3.cointelegraph.com/uploads/2025-11/019ac373-0f51-7836-9901-bd1c5b6dcac8",
    "pubDate": "2025-11-28T02:55:14+00:00"
  },
  {
    "title": "Decentralized exchange volumes soar on memecoin trading rush: CoinGecko",
    "description": "In June, the DEX to CEX spot ratio hit an all-time peak of 37.4%, largely due to “a spike in PancakeSwap’s volumes,” says CoinGecko analyst Yuqian Lim.",
    "link": "https://cointelegraph.com/news/dex-trading-volumes-onchain-growth-2025?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
    "thumbnail": "https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=1200/https://s3.cointelegraph.com/uploads/2025-02/0194bf40-4897-7903-b6ed-cc80996bc1a4",
    "pubDate": "2025-11-28T02:35:35+00:00"
  },
  {
    "title": "Castlevania Fans Can Save Big On New Limited Edition Blu-Ray Box Set For Black Friday",
    "description": "Castlevania: Complete Series - Limited Edition (Blu-ray) $93 (was $155) See at Amazon See at Walmart See at Crunchyroll Castlevania fans can pick up the recently released Blu-ray box set of the animated series at a massive discount during Amazon's Black Friday sale. Castlevania: The Complete Series Limited Edition released September 30 with a $155 MSRP and was selling for $150 up until Thanksgiving. But now you can grab this jam-packed box set for only $93. This deal is also available in Black Friday sales at Crunchyroll and Walmart. To complete your Castlevania Blu-ray collection, you can pick up Nocturne Season 1 for $21 (was $40) at Amazon. Castlevania: Complete Series includes all four seasons of Netflix's original Castlevania animated series. The limited-edition box set is packaged in a fancy faux-woodgrain box that houses the Blu-rays and a handful of collectibles, including an art book, Ouija board, Tarot deck, and more. Continue Reading at GameSpot",
    "link": "https://www.gamespot.com/articles/castlevania-fans-can-save-big-on-new-limited-edition-blu-ray-box-set-for-black-friday/1100-6533622/?ftag=CAD-01-10abi2f",
    "thumbnail": "https://www.gamespot.com/a/uploads/screen_kubrick/1595/15950357/4613064-castlevaniacompleteseriesthumbnail.png",
    "pubDate": "2025-11-28T02:28:00+00:00"
  },
  {
    "title": "Asia Morning Briefing: Bitcoin Steadies Near $90,000 Even as ETF Outflows Cap Upside",
    "description": "Flowdesk and QCP see short covering and dip buying supporting BTC around $90,000, while prediction markets assign low odds of a push toward $96,000.",
    "link": "https://www.coindesk.com/markets/2025/11/28/asia-morning-briefing-bitcoin-steadies-near-usd90-000-even-as-etf-outflows-cap-upside",
    "thumbnail": "",
    "pubDate": "2025-11-28T02:24:26+00:00"
  },
  {
    "title": "Hong Kong’s Worst Fire in Decades Fuels Scrutiny of Safety Lapses",
    "description": "The authorities said flammable netting and foam boards may have fueled the city’s deadliest blaze in nearly 80 years, killing more than 90 and prompting arrests.",
    "link": "https://www.nytimes.com/2025/11/27/world/asia/hong-kong-fire-tai-po-apartment-buildings.html",
    "thumbnail": "https://static01.nyt.com/images/2025/11/27/27hong-kong-fire-carousel-zzz-qfmj-cover/27hong-kong-fire-carousel-zzz-qfmj-cover-facebookJumbo.jpg",
    "pubDate": "2025-11-28T01:36:59+00:00"
  },
  {
    "title": "National Guard member dies after shooting in Washington DC",
    "description": "Sarah Beckstrom, 20, succumbed to her injuries, while a second guardsman remains in critical condition, Donald Trump says.",
    "link": "https://www.bbc.com/news/articles/cwyx4y6007lo?at_medium=RSS&at_campaign=rss",
    "thumbnail": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/ca90/live/f4f95890-cc05-11f0-9fb5-5f3a3703a365.jpg",
    "pubDate": "2025-11-28T01:29:45+00:00"
  },
  {
    "title": "ETH whales uneasy as onchain, derivatives data reduce chance for rally to $4K",
    "description": "ETH investor sentiment wavers as onchain activity and bearish derivatives positioning leave whales unconvinced, reducing the odds for a rally to $4,000.",
    "link": "https://cointelegraph.com/news/eth-whales-cautious-as-data-shows-slim-chance-of-rally-to-dollar4k?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
    "thumbnail": "https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=1200/https://s3.cointelegraph.com/uploads/2025-02/0194ea01-dd69-78fc-82a3-c7ab902eab78",
    "pubDate": "2025-11-28T01:20:49+00:00"
  },
  {
    "title": "Russia-Ukraine war: List of key events, day 1,373",
    "description": "Here are the key events from day 1,373 of Russia’s war on Ukraine.",
    "link": "https://www.aljazeera.com/news/2025/11/28/russia-ukraine-war-list-of-key-events-day-1373?traffic_source=rss",
    "thumbnail": "https://www.aljazeera.com/wp-content/uploads/2025/11/2025-11-27T122839Z_1575840346_RC2V4IAKZ453_RTRMADP_3_UKRAINE-CRISIS-KOSTIANTYNIVKA-1764285222_616ab6-1764290570.jpg?resize=1200%2C630&quality=80",
    "pubDate": "2025-11-28T01:10:46+00:00"
  },
  {
    "title": "At 15 my best friend promised she'd have my baby. Now I'm a mum",
    "description": "Georgia and Daisy's childhood closeness later become the foundation for a life-changing act of generosity.",
    "link": "https://www.bbc.com/news/articles/cz7nqwrw4djo?at_medium=RSS&at_campaign=rss",
    "thumbnail": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/fefb/live/a255a070-cb9d-11f0-9fb5-5f3a3703a365.jpg",
    "pubDate": "2025-11-28T00:10:02+00:00"
  },
  {
    "title": "Trump says National Guard’s Sarah Beckstrom has died after DC shooting",
    "description": "US president says second National Guard member 'fighting for his life' after attack a day earlier in Washington, DC.",
    "link": "https://www.aljazeera.com/news/2025/11/28/trump-says-one-national-guard-soldier-shot-near-white-house-has-died?traffic_source=rss",
    "thumbnail": "https://www.aljazeera.com/wp-content/uploads/2025/11/AP25331587657583-1764289367.jpg?resize=1920%2C1440",
    "pubDate": "2025-11-28T00:03:46+00:00"
  },
  {
    "title": "‘No Alarm Went Off’: Hong Kong Fire Survivor Recounts Harrowing Escape",
    "description": "Many windows were covered, preventing residents from seeing the fire and smoke, one survivor said.",
    "link": "https://www.nytimes.com/2025/11/27/world/asia/hong-kong-fire-survivors-escape.html",
    "thumbnail": "https://static01.nyt.com/images/2025/12/26/multimedia/26hong-kong-fire-residents-pwgh/26hong-kong-fire-residents-pwgh-facebookJumbo.jpg",
    "pubDate": "2025-11-27T23:35:38+00:00"
  },
  {
    "title": "Here’s what happened in crypto today",
    "description": "Need to know what happened in crypto today? Here is the latest news on daily trends and events impacting Bitcoin price, blockchain, DeFi, NFTs, Web3 and crypto regulation.",
    "link": "https://cointelegraph.com/news/what-happened-in-crypto-today?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
    "thumbnail": "https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=1200/https://s3.cointelegraph.com/uploads/2025-06/01979423-ef8e-7c60-b937-b9ddf75fe8ad",
    "pubDate": "2025-11-27T23:02:16+00:00"
  },
  {
    "title": "Ex-Brexit Party MEP named in Nathan Gill messages denies taking pro-Russian payments",
    "description": "A prominent former MEP for Nigel Farage's old party denies taking bribes in a pro-Russian campaign.",
    "link": "https://www.bbc.com/news/articles/cn09x11yr7ro?at_medium=RSS&at_campaign=rss",
    "thumbnail": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/4d25/live/14fd62a0-cb14-11f0-9dff-996e2d13e3e5.jpg",
    "pubDate": "2025-11-27T22:54:07+00:00"
  },
  {
    "title": "Putin doubles down on demands for Ukrainian territory ahead of talks with US in Moscow",
    "description": "The Russian president accuses Kyiv of wanting to fight \"to the last Ukrainian\" - which he says Russia is also \"in principle\" ready to do.",
    "link": "https://www.bbc.com/news/articles/cp84nl57v0lo?at_medium=RSS&at_campaign=rss",
    "thumbnail": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/0c52/live/ba403110-cbba-11f0-a892-01d657345866.jpg",
    "pubDate": "2025-11-27T22:18:56+00:00"
  },
  {
    "title": "Guinea-Bissau’s deposed President Embalo arrives in Senegal after coup",
    "description": "Senegal's Foreign Ministry says Umaro Sissoco Embalo arrived in the country a day after he was deposed in military coup.",
    "link": "https://www.aljazeera.com/news/2025/11/27/guinea-bissaus-deposed-president-embalo-arrives-in-senegal-after-coup?traffic_source=rss",
    "thumbnail": "https://www.aljazeera.com/wp-content/uploads/2025/11/ap_6928c8dc0b00d-1764280540.jpg?resize=1920%2C1440",
    "pubDate": "2025-11-27T22:18:17+00:00"
  },
  {
    "title": "Bhutan stakes $970K ETH via Figment in validator push",
    "description": "The small nation’s Ether staking adds to its expanding blockchain activity as it remains one of the few governments holding Bitcoin.",
    "link": "https://cointelegraph.com/news/bhutan-stakes-eth-figment-validator?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
    "thumbnail": "https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=1200/https://s3.cointelegraph.com/uploads/2025-10/0199e1e9-fdad-7a9d-8c1e-d13043944209",
    "pubDate": "2025-11-27T22:15:43+00:00"
  },
  {
    "title": "Bitcoiners accuse JPMorgan of rigging the game against Strategy, DATs",
    "description": "The financial services giant has filed with the US Securities and Exchange Commission to launch a leveraged BTC financial product.",
    "link": "https://cointelegraph.com/news/bitcoiners-accuse-jpmorgan-rigging-strategy-dats?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
    "thumbnail": "https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=1200/https://s3.cointelegraph.com/uploads/2024-12/0193b202-d51e-7207-8eb7-4d0a582fa5f1",
    "pubDate": "2025-11-27T21:54:20+00:00"
  },
  {
    "title": "Trump administration will re-examine green card holders from 19 countries",
    "description": "Afghanistan, Cuba, Haiti, Iran, Somalia and Venezuela are among the countries subject to the review.",
    "link": "https://www.bbc.com/news/articles/ckgl8j24ky1o?at_medium=RSS&at_campaign=rss",
    "thumbnail": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/b666/live/da4bc770-cbd4-11f0-8e93-71481b645865.jpg",
    "pubDate": "2025-11-27T21:46:38+00:00"
  },
  {
    "title": "‘Real uncertainty’: What to know about Honduras’ presidential election",
    "description": "Several candidates are vying to replace President Xiomara Castro, but concerns about voting process have caused tension.",
    "link": "https://www.aljazeera.com/news/2025/11/27/real-uncertainty-what-to-know-about-the-honduran-presidential-election?traffic_source=rss",
    "thumbnail": "https://www.aljazeera.com/wp-content/uploads/2025/11/AP25327053451520-1764258761.jpg?resize=1200%2C675",
    "pubDate": "2025-11-27T21:41:47+00:00"
  },
  {
    "title": "Balancer DAO Starts Discussing $8M Recovery Plan After $110M Exploit Cut TVL by Two-Thirds",
    "description": "The recovered tokens, spanning multiple networks and assets, will be paid out in the same tokens as originally provided, with a claim mechanism being developed.",
    "link": "https://www.coindesk.com/web3/2025/11/27/balancer-dao-starts-discussing-usd8m-recovery-plan-after-usd110m-exploit-cut-tvl-by-two-thirds",
    "thumbnail": "",
    "pubDate": "2025-11-27T21:39:14+00:00"
  },
  {
    "title": "Israeli troops kill two Palestinians after they appear to surrender",
    "description": "The Palestinian Authority says the killings are a \"war crime\", while an Israeli minister backed the soldiers.",
    "link": "https://www.bbc.com/news/articles/c8dyqzm0rp4o?at_medium=RSS&at_campaign=rss",
    "thumbnail": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/2da6/live/01f5f9b0-cbd7-11f0-a892-01d657345866.jpg",
    "pubDate": "2025-11-27T21:24:50+00:00"
  },
  {
    "title": "Former Peru President Pedro Castillo sentenced to 11.5 years in prison",
    "description": "The decision follows Castillo's failed 2022 bid to dissolve Congress and avoid a third impeachment attempt.",
    "link": "https://www.aljazeera.com/news/2025/11/27/former-peru-president-pedro-castillo-sentenced-to-11-5-years-in-prison?traffic_source=rss",
    "thumbnail": "https://www.aljazeera.com/wp-content/uploads/2025/11/afp_6928a023694b-1764270115.jpg?resize=1920%2C1440",
    "pubDate": "2025-11-27T20:48:32+00:00"
  },
  {
    "title": "Canada’s Carney rolls back climate rules to boost investments",
    "description": "In its deal with Alberta, Canada will scrap emissions cap on the oil and gas sector, among other moves.",
    "link": "https://www.aljazeera.com/economy/2025/11/27/canada-rolls-back-climate-rules-to-boost-investments?traffic_source=rss",
    "thumbnail": "https://www.aljazeera.com/wp-content/uploads/2025/07/2025-07-16T171750Z_1538730765_RC2RNFAAEMGP_RTRMADP_3_CANADA-POLITICS-1753911257.jpg?resize=1920%2C1440",
    "pubDate": "2025-11-27T20:32:01+00:00"
  },
  {
    "title": "Amundi brings euro money market fund onchain with first tokenized share",
    "description": "The asset manager’s hybrid rollout enables investors to choose between the traditional fund and a new blockchain-based version recorded on Ethereum.",
    "link": "https://cointelegraph.com/news/amundi-tokenized-euro-money-market-fund-ethereum?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
    "thumbnail": "https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=1200/https://s3.cointelegraph.com/uploads/2025-11/019ac674-77f7-79f2-a431-00b76614c9f5",
    "pubDate": "2025-11-27T20:23:33+00:00"
  },
  {
    "title": "Toncoin Lags Broader Crypto Rebound as Derivatives Data Shows Cautious Optimism",
    "description": "Altcoin funding rates, including for TON, have turned positive, indicating renewed confidence among traders, but overall market participation remains muted.",
    "link": "https://www.coindesk.com/markets/2025/11/27/toncoin-lags-broader-crypto-rebound-as-derivatives-data-shows-cautious-optimism",
    "thumbnail": "",
    "pubDate": "2025-11-27T20:11:39+00:00"
  },
  {
    "title": "Trump Family-Linked Alt5 Sigma Ousts Top Execs After CEO Suspension Shakes Up Leadership",
    "description": "The company is on its third CEO in six weeks, with Tony Isaac appointed as Acting CEO, and has named Steven Plumb as its new CFO.",
    "link": "https://www.coindesk.com/business/2025/11/27/trump-family-linked-alt5-sigma-ousts-top-execs-after-ceo-suspension-shakes-up-leadership",
    "thumbnail": "",
    "pubDate": "2025-11-27T20:08:37+00:00"
  },
  {
    "title": "Video shows Israeli soldiers shooting surrendering Palestinians in Jenin",
    "description": "Israeli soldiers have been filmed shooting two Palestinians who were seen on their knees with their hands in the air.",
    "link": "https://www.aljazeera.com/video/newsfeed/2025/11/27/video-shows-israeli-soldiers-shooting-surrendering-palestinians-in-jenin?traffic_source=rss",
    "thumbnail": "https://www.aljazeera.com/wp-content/uploads/2025/11/image-1764273748.jpg?resize=1920%2C1080&quality=80",
    "pubDate": "2025-11-27T20:02:43+00:00"
  },
  {
    "title": "What time does the Fortnite Zero Hour Chapter Finale live event start?",
    "description": "The Fortnite Zero Hour Chapter Finale live event will send off Chapter 6 with a cinematic experience featuring iconic collaborations.",
    "link": "https://www.polygon.com/fortnite-zero-hour-chapter-finale-live-event-start-time/",
    "thumbnail": "https://static0.polygonimages.com/wordpress/wp-content/uploads/2025/11/fortnite-zero-hour-live-event.jpg?w=1600&h=900&fit=crop",
    "pubDate": "2025-11-27T19:01:14+00:00"
  },
  {
    "title": "Putin breaks his silence on Ukraine peace plan, says Moscow ready for 'serious' talks",
    "description": "Russian President Vladimir Putin said the outlines of a draft peace plan agreed by the U.S. and Ukraine could become the basis of a deal to end the war.",
    "link": "https://www.cnbc.com/2025/11/27/putin-moscow-ready-for-serious-talks-on-ukraine-peace-plan.html",
    "thumbnail": "https://image.cnbcfm.com/api/v1/image/108233058-1764251945985-gettyimages-2248081649-AFP_86C62Q7.jpeg?v=1764252021&w=1920&h=1080",
    "pubDate": "2025-11-27T18:40:30+00:00"
  },
  {
    "title": "Get Studio Ghibli Steelbook Editions For As Low As $13.49 In Amazon's Black Friday Sale",
    "description": "Studio Ghibli Steelbook Editions Get collectible Blu-ray and DVD combo packs for cheap. See at Amazon Studio Ghibli fans can add a handful of Steelbook Edition Blu-ray and DVD combo packs to their collection for low prices during Amazon's Black Friday sale, including several of the best films directed by Hayao Miyazaki. My Neighbor Totoro, Nausicaa of the Valley of the Wind, and Princess Mononoke Steelbooks are discounted to only $16.19. You can also get The Secret World of Arietty Steelbook Edition for the same price. And if you haven't picked up Shout Factory's 2025 rerelease of Grave of the Fireflies, you can grab the Steelbook Edition for only $13.49. Meanwhile, the standard Blu-ray edition of The Boy and the Heron is discounted to $16.49, and Miyazaki's directorial debut, Lupin the 3rd: The Castle of Cagliostro, is on sale for $18 on Blu-ray and $21 on 4K Blu-ray. Lupin the 3rd isn't a Ghibli movie, but it's definitely worth watching if you're a fan of Miyazaki's work. Continue Reading at GameSpot",
    "link": "https://www.gamespot.com/articles/studio-ghibli-movies-limited-edition-steelbook-blu-ray-amazon-deals/1100-6530746/?ftag=CAD-01-10abi2f",
    "thumbnail": "https://www.gamespot.com/a/uploads/screen_kubrick/1595/15950357/4613000-4545981-studioghiblihayaomiyazakisteelbooks.jpg",
    "pubDate": "2025-11-27T18:38:00+00:00"
  },
  {
    "title": "Where is Maurice's Black Market Vending Machine in Borderlands 4",
    "description": "Here's where you can find Maurice's Black Market Vending Machine this week in Borderlands 4 and grab some nice legendary gear!",
    "link": "https://www.polygon.com/borderlands-4-maurices-black-market-vending-legendary-machine-location/",
    "thumbnail": "https://static0.polygonimages.com/wordpress/wp-content/uploads/2025/09/maurice-sblackmarketvendingmachine_bl4.jpg?w=1600&h=900&fit=crop",
    "pubDate": "2025-11-27T18:30:38+00:00"
  },
  {
    "title": "Black Friday Deals Can Put People in Debt. Here’s How to Manage It.",
    "description": "The convenience of one-click purchases and “buy now, pay later” loans is making it easier for people to shop — and shop and shop — during the holidays.",
    "link": "https://www.nytimes.com/2025/11/27/business/black-friday-shopping-debt.html",
    "thumbnail": "https://static01.nyt.com/images/2025/11/27/multimedia/27Biz-Holiday-Overspending-1-zpgl/27Biz-Holiday-Overspending-1-zpgl-facebookJumbo.jpg",
    "pubDate": "2025-11-27T18:28:07+00:00"
  },
  {
    "title": "Who are the winners and losers from Rachel Reeves' Budget?",
    "description": "BBC Verify has examined what we know about how the Budget is likely to financially affect different groups.",
    "link": "https://www.bbc.com/news/articles/cwyx4zpp0n0o?at_medium=RSS&at_campaign=rss",
    "thumbnail": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/49b6/live/e4171940-cbba-11f0-a892-01d657345866.png",
    "pubDate": "2025-11-27T18:23:07+00:00"
  },
  {
    "title": "Why Is the U.S. Threatening Venezuela?",
    "description": "Venezuela doesn’t play a large role in the drug trade to the United States, so what is motivating the massive military buildup? Julian E. Barnes, who reports on intelligence and international security, discusses the issues with our senior writer Katrin Bennhold.",
    "link": "https://www.nytimes.com/video/world/americas/100000010549651/trump-venezuela-pressure-campaign.html",
    "thumbnail": "https://static01.nyt.com/images/2025/11/26/world/americas/venezuela/venezuela-facebookJumbo.jpg?video-overlay",
    "pubDate": "2025-11-27T18:20:13+00:00"
  },
  {
    "title": "SEC investigates Jefferies over First Brands collapse, report says",
    "description": "The FT said the SEC is looking into whether Jefferies gave investors enough information on their exposure to the failed auto business.",
    "link": "https://www.cnbc.com/2025/11/27/sec-investigates-jefferies-over-first-brands-collapse-report-says.html",
    "thumbnail": "https://image.cnbcfm.com/api/v1/image/108214446-1760996506866-gettyimages-2241909727-JEFFERIES_HQ.jpeg?v=1760996569&w=1920&h=1080",
    "pubDate": "2025-11-27T18:02:34+00:00"
  },
  {
    "title": "The first Dune bombed, but it's still better than Timothée Chalamet's version",
    "description": "Here are 6 things the 1984 fiasco, which bombed at the box office and with critics, actually does better than the acclaimed 2020s movies",
    "link": "https://www.polygon.com/david-lynch-dune-1984-turkey-villeneuve/",
    "thumbnail": "https://static0.polygonimages.com/wordpress/wp-content/uploads/2025/11/dune-paul.jpg?w=1600&h=900&fit=crop",
    "pubDate": "2025-11-27T18:01:14+00:00"
  },
  {
    "title": "Three arrests after BBC investigation into criminal network on High Street",
    "description": "Two Iranian men and a British man are held after raids in Birmingham and the West Midlands.",
    "link": "https://www.bbc.com/news/articles/c23ev9r40ero?at_medium=RSS&at_campaign=rss",
    "thumbnail": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/9af8/live/12c80140-cbb2-11f0-9fb5-5f3a3703a365.jpg",
    "pubDate": "2025-11-27T18:00:10+00:00"
  },
  {
    "title": "Avalanche ETF Race Heats Up as Bitwise Becomes First to Add Staking",
    "description": "Bitwise moves its Avalanche ETF closer to market with updated SEC filing and becomes first issuer to include staking.",
    "link": "https://www.coindesk.com/business/2025/11/27/avalanche-etf-race-heats-up-as-bitwise-becomes-first-to-add-staking",
    "thumbnail": "",
    "pubDate": "2025-11-27T17:49:40+00:00"
  },
  {
    "title": "Stranger Things season 5 hinges on you knowing a sci-fi masterpiece",
    "description": "Madeleine L'Engle's classic science fantasy novel A Wrinkle in Time has parallels with Vecna and the Mind Flayer",
    "link": "https://www.polygon.com/stranger-things-season-5-a-wrinkle-in-time/",
    "thumbnail": "https://static0.polygonimages.com/wordpress/wp-content/uploads/2025/11/stranger_things_wrinkle.jpg?w=1600&h=900&fit=crop",
    "pubDate": "2025-11-27T17:37:14+00:00"
  },
  {
    "title": "After 13 years, Laura Bailey is finally playing her dream Critical Role character",
    "description": "Laura Bailey has a clear love for all her Critical Role characters, but it's only now that she's playing her dream one.",
    "link": "https://www.polygon.com/after-13-years-laura-bailey-is-finally-playing-her-dream-critical-role-character/",
    "thumbnail": "https://static0.polygonimages.com/wordpress/wp-content/uploads/2025/11/critical-role-laura-bailey-thimble.jpg?w=1600&h=900&fit=crop",
    "pubDate": "2025-11-27T17:15:14+00:00"
  },
  {
    "title": "Nintendo's best Switch accessory was a cheap one everyone hated",
    "description": "The Switch's Joy-Con grip let me play in docked mode when a Pro Controller was out of budget, it's far more comfortable anyway",
    "link": "https://www.polygon.com/best-switch-accessory-joy-con-grip/",
    "thumbnail": "https://static0.polygonimages.com/wordpress/wp-content/uploads/2025/11/switch_joycon_grip.jpg?w=1600&h=900&fit=crop",
    "pubDate": "2025-11-27T17:02:14+00:00"
  },
  {
    "title": "Here's This Week's Free Game From The Epic Games Store On Mobile",
    "description": "For the last couple of years, the Epic Games Store has given away free games every week through its PC storefront. With the company having launched its own mobile store, it has also started a second free games program on iOS and Android devices, kicking things off with a curated library of titles and weekly freebies. The app also features mobile versions of Fortnite, Fall Guys, and Rocket League Sideswipe. To access these games you will need to create a free Epic account and install the free Epic Games Store mobile app and log in with your account, but once you do, you can start claiming your free games every Thursday through it. One other thing to note is that Android users can access the app via Android-based emulation devices like Retroid Pocket, as they aren't limited to just smartphone and tablets. Download the Epic Games Store Mobile app For now, only iOS users in the European Union can install the app, but the app is available worldwide to Android device users and they have a wider selection of games to choose from in comparison. Like its PC counterpart, you'll have one week to grab each game that's offered. Here's a closer look at what you can grab this week, and what the current mobile games library has to offer. You can also explore what the free PC games are this week on the Epic Games Store. Continue Reading at GameSpot",
    "link": "https://www.gamespot.com/articles/free-games-epic-games-store-mobile/1100-6530257/?ftag=CAD-01-10abi2f",
    "thumbnail": "https://www.gamespot.com/a/uploads/screen_kubrick/1601/16018044/4462498-egs-mobile.jpg",
    "pubDate": "2025-11-27T16:47:00+00:00"
  },
  {
    "title": "U.S. Has Limited Knowledge of Those It Kills in Boat Strikes",
    "description": "The U.S. military has killed more than 80 people since the campaign began in early September. But it does not know who specifically is being killed.",
    "link": "https://www.nytimes.com/2025/11/27/us/politics/us-military-boat-strikes.html",
    "thumbnail": "https://static01.nyt.com/images/2025/11/26/multimedia/00dc-intel-plhw/00dc-intel-plhw-facebookJumbo.jpg",
    "pubDate": "2025-11-27T16:39:42+00:00"
  },
  {
    "title": "Arc Raider cheaters now get incinerated after latest update",
    "description": "Arc Raiders' latest update introduces a funny and appropriate punishment for players who use a glitch to get through a locked door.",
    "link": "https://www.polygon.com/arc-raiders-patch-notes-fire-trap-locked-doors/",
    "thumbnail": "https://static0.polygonimages.com/wordpress/wp-content/uploads/2025/11/arc-raiders-queen-blaze-grenade-trap.jpg?w=1600&h=900&fit=crop",
    "pubDate": "2025-11-27T16:39:39+00:00"
  },
  {
    "title": "Households face 'dismal' rise in spending power, says IFS, as Starmer defends Budget",
    "description": "Average disposable income is set to grow by \"only\" 0.5% annually over the next five years, the think tank says.",
    "link": "https://www.bbc.com/news/articles/c75vwevr652o?at_medium=RSS&at_campaign=rss",
    "thumbnail": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/af1f/live/914de4e0-cbac-11f0-9fb5-5f3a3703a365.jpg",
    "pubDate": "2025-11-27T16:35:50+00:00"
  },
  {
    "title": "'I'm Han Solo' was just one bop from loathed Kinect Star Wars",
    "description": "The meme-worthy dance game does some pretty hilarious stuff with pop princesses like Britney and Christina, too.",
    "link": "https://www.polygon.com/kinect-star-wars-songs/",
    "thumbnail": "https://static0.polygonimages.com/wordpress/wp-content/uploads/2025/11/leia-kinect-star-wars.jpeg?w=1600&h=900&fit=crop",
    "pubDate": "2025-11-27T16:31:14+00:00"
  },
  {
    "title": "Borderlands 4 Gets 50% Discount For PS5 And Xbox At Amazon",
    "description": "Borderlands 4 for PS5 / Xbox Series X $35 (was $70) See at Amazon See at GameStop Borderlands 4 for Nintendo Switch 2 $55 (was $70) | Release Date TBA Preorder at Target Preorder at Amazon If you haven't picked up a copy of Borderlands 4, you can score an incredible deal at Amazon and GameStop for Black Friday. Borderlands 4 is on sale for only $35 just two months after its release. The 50% discount is for the physical edition on PS5 and Xbox Series X. This deal first popped up today (November 27) at GameStop, and Amazon matched it shortly after. Amazon has sold out of the PS5 edition once already, so this deal might not be available after today. Borderlands 4 for PS5 / Xbox Series X $35 (was $70) While previous Borderlands games were primarily set on the planet of Pandora--Borderlands 3 expanded on this with several more planets to visit--Borderlands 4 takes place on the world of Kairos, giving players free rein to cause some chaos as they take on the forces of the Timekeeper. Just like its predecessors, the key goal here is to take control of one of four unique Vault Hunters, grow their skills, and strengthen them further by finding powerful weapons and gear. It's a formula that has been present since the original Borderlands game, but in Borderlands 4, that gameplay has been fine-tuned to its best and enhanced with quality-of-life features. PS5 -- $35 ($70) Xbox Series X -- $35 ($70) See at Amazon See at GameStop Borderlands 4 for Nintendo Switch 2 $55 (was $70) | Release Date TBA The Nintendo Switch 2 port of Borderlands 4 was originally slated for October 3, just a few weeks after the game's September 1 launch on other platforms. But then about a week before launch day, Gearbox announced an indefinite delay to polish the experience on Switch 2. If you're planning on buying Borderlands 4 for Nintendo Switch 2, it makes sense to secure a preorder right now. Target has slashed $15 from the price. Amazon was matching this offer but sold out fast. Keep in mind this is a Game-Key Card, so you will need to download Borderlands 4 from the eShop after loading the cartridge into your console for the first time. Preorder at Target Preorder at Amazon While previous Borderlands games were primarily set on the planet of Pandora--Borderlands 3 expanded on this with several more planets to visit--Borderlands 4 takes place on the world of Kairos, giving players free rein to cause some chaos as they take on the forces of the Timekeeper. Just like its predecessors, the key goal here is to take control of one of four unique Vault Hunters, grow their skills, and strengthen them further by finding powerful weapons and gear. It's a formula that has been present since the original Borderlands game, but in Borderlands 4, that gameplay has been fine-tuned to its best and enhanced with quality-of-life features. Continue Reading at GameSpot",
    "link": "https://www.gamespot.com/articles/borderlands-4-gets-50-discount-for-ps5-and-xbox-at-amazon/1100-6536260/?ftag=CAD-01-10abi2f",
    "thumbnail": "https://www.gamespot.com/a/uploads/screen_kubrick/1601/16018044/4603402-borderlands-4-bf.jpg",
    "pubDate": "2025-11-27T16:25:00+00:00"
  },
  {
    "title": "The Universe Is For Sale In This Week's Epic Games Store Freebies",
    "description": "The Epic Games Store continues to give away a free game each week, and this week is another nice find with a price that can't be beaten. Every Thursday at 8 AM PT / 11 AM ET, Epic offers at least one free PC game (and sometimes even as many as two or three). All you need to do to claim the free games is create a free Epic account and enable two-factor authentication. You have a week to add the freebies to your library before the new one(s) take their place. At this point, Epic has given away hundreds of free games, and there's no sign that the program will stop any time soon. The company has also extended its freebies to Android devices, and you can claim a free game every week here as well. We keep this article up to date weekly to highlight both the current free games and next week's offerings. If you're looking for more freebies, you can check out our list of the 25 best free PC games to play in 2025, or for more options, the 25 best free games to play in 2025 on multiple platforms. Current free game at Epic Universe For Sale Continue Reading at GameSpot",
    "link": "https://www.gamespot.com/articles/free-games-epic-games-store/1100-6476419/?ftag=CAD-01-10abi2f",
    "thumbnail": "https://www.gamespot.com/a/uploads/screen_kubrick/1601/16018044/4612949-universeforsale.jpg",
    "pubDate": "2025-11-27T16:05:00+00:00"
  },
  {
    "title": "Fortnite wannabe Radical Heights deserved better than a one month lifespan",
    "description": "Cliff Bleszinski's Radical Heights is a notorious multiplayer failure, but the 80s-themed shooter died with potential.",
    "link": "https://www.polygon.com/radical-heights-turkey-day-2025/",
    "thumbnail": "https://static0.polygonimages.com/wordpress/wp-content/uploads/2025/11/radical-heights-shooting.jpg?w=1600&h=900&fit=crop",
    "pubDate": "2025-11-27T16:01:14+00:00"
  },
  {
    "title": "88-year-old Morgan Freeman shares the secrets to his long life and 60-year career: 'Keep getting up in the morning, keep moving'",
    "description": "At 88 years old, renowned actor Morgan Freeman doesn't plan to retire. Here's what he says is his secret to longevity.",
    "link": "https://www.cnbc.com/2025/11/27/morgan-freemans-secret-to-longevity-as-an-88-year-old-actor.html",
    "thumbnail": "https://image.cnbcfm.com/api/v1/image/108231090-1764005845553-gettyimages-2243899279-The_Jennifer_Hudson_Show_Season_4.jpeg?v=1764016286&w=1920&h=1080",
    "pubDate": "2025-11-27T16:00:01+00:00"
  },
  {
    "title": "Lego Star Wars Grogu With Hover Pram 50% Off Deal Restocked At Walmart",
    "description": "Lego Star Wars: Grogu with Hover Pram (1,048 pieces) $50 (was $100) | Restocked November 27 See at Walmart See at Amazon UPDATE: Walmart has restocked the $50 Grogu with Hover Pram deal on November 27. Walmart also has a few other Star Wars sets for up to 50% off: Executor Super Star Destroyer (630 pieces) -- $40 ($70) Tantive IV Starship (654 pieces) -- $40 ($80) Also at Amazon Boarding the Tantive IV (502 pieces) -- $38.49 ($55) Also at Amazon Grogu with Hover Pram (1,048 pieces) -- $50 ($100) Continue Reading at GameSpot",
    "link": "https://www.gamespot.com/articles/lego-baby-yoda-and-hover-pram-is-50-off-at-amazon-but-itll-sell-out-soon/1100-6535220/?ftag=CAD-01-10abi2f",
    "thumbnail": "https://www.gamespot.com/a/uploads/screen_kubrick/1595/15950357/4609299-4596226-groguwithhoverpram.png",
    "pubDate": "2025-11-27T15:27:00+00:00"
  },
  {
    "title": "Dying Light: The Beast getting New Game Plus in huge update",
    "description": "New Game Plus is finally coming to Dying Light: The Beast, after countless player requests, along with Legend Levels and bug fixes",
    "link": "https://www.polygon.com/dying-light-the-beast-new-game-plus-update/",
    "thumbnail": "https://static0.polygonimages.com/wordpress/wp-content/uploads/2025/10/dying-light-the-beast-impressions-5.jpg?w=1600&h=900&fit=crop",
    "pubDate": "2025-11-27T15:20:24+00:00"
  },
  {
    "title": "Where the Waters Are Rough, a Fishing Town Confronts Trump’s Priorities",
    "description": "First, Newport, Ore., lost its Coast Guard rescue chopper. Then came the swirl of rumors and evidence that Immigration and Customs Enforcement was coming to town.",
    "link": "https://www.nytimes.com/2025/11/27/us/politics/newport-oregon-ice.html",
    "thumbnail": "https://static01.nyt.com/images/2025/11/27/arts/lighthouse-desktop/lighthouse-desktop-facebookJumbo.jpg",
    "pubDate": "2025-11-27T14:48:31+00:00"
  },
  {
    "title": "With Trump's tax bill set to dent giving by the wealthy, can middle-class donors make up the difference?",
    "description": "Next year, some 140 million Americans will get a new tax break on donations. Experts warn it's unclear whether they will use it.",
    "link": "https://www.cnbc.com/2025/11/27/trump-tax-changes-middle-class-donors-giving-gap.html",
    "thumbnail": "https://image.cnbcfm.com/api/v1/image/108232670-1764181464247-gettyimages-1799912850-SAVLATIONARYM.jpeg?v=1764181583&w=1920&h=1080",
    "pubDate": "2025-11-27T14:00:01+00:00"
  },
  {
    "title": "TikTok-fueled K-beauty boom triggers a retail race in the U.S.",
    "description": "K-beauty has vaulted into the American mainstream, driven by TikTok and younger, more diverse shoppers. Retailers from Ulta to Walmart are racing to cash in.",
    "link": "https://www.cnbc.com/2025/11/27/k-beauty-tiktok-makeup.html",
    "thumbnail": "https://image.cnbcfm.com/api/v1/image/108227539-1763484418622-gettyimages-1409521302-koreanbeauty0426161_cag.jpeg?v=1764272456&w=1920&h=1080",
    "pubDate": "2025-11-27T13:00:02+00:00"
  },
  {
    "title": "How Google put together the pieces for its AI comeback",
    "description": "The company's Gemini 3 and Ironwood AI chip are driving Wall Street's excitement behind Alphabet's AI comeback, but challenges remain.",
    "link": "https://www.cnbc.com/2025/11/27/how-google-put-together-the-pieces-for-its-ai-comeback.html",
    "thumbnail": "https://image.cnbcfm.com/api/v1/image/108228511-1763577992035-gettyimages-2247381802-vcg111604745843.jpeg?v=1764184784&w=1920&h=1080",
    "pubDate": "2025-11-27T12:00:01+00:00"
  },
  {
    "title": "Gen X-ers Have Money to Spend. Why Are Retailers Ignoring Them?",
    "description": "Three in four Americans ages 45 to 60 say they expect to overspend for the holidays. They’re “sort of like the glue within the consumer spectrum.”",
    "link": "https://www.nytimes.com/2025/11/27/business/gen-x-holiday-spending.html",
    "thumbnail": "https://static01.nyt.com/images/2025/11/25/business/00biz-genx-spending/00biz-genx-spending-facebookJumbo.jpg",
    "pubDate": "2025-11-27T10:03:38+00:00"
  },
  {
    "title": "U.S. to Press Europe and Other Allies on Immigration, Document Says",
    "description": "American diplomats were told to raise U.S. concerns about “violent crimes associated with people of a migration background.”",
    "link": "https://www.nytimes.com/2025/11/26/us/politics/trump-rubio-mass-migration.html",
    "thumbnail": "https://static01.nyt.com/images/2025/11/26/multimedia/26dc-rubio-migrants-vwph/26dc-rubio-migrants-vwph-facebookJumbo.jpg",
    "pubDate": "2025-11-27T02:30:54+00:00"
  },
  {
    "title": "Black Friday is most popular with Gen Z, even as the holiday loses its shine, new survey finds",
    "description": "A new AT&amp;T survey found that members of Generation Z are the biggest Black Friday shoppers, while older generations shop closer to Christmas.",
    "link": "https://www.cnbc.com/2025/11/26/att-holiday-shopping-survey-black-friday-gen-z.html",
    "thumbnail": "https://image.cnbcfm.com/api/v1/image/108231995-1764101405012-gettyimages-2247871527-TARGET_SHOPPERS.jpeg?v=1764101572&w=1920&h=1080",
    "pubDate": "2025-11-26T19:07:54+00:00"
  },
  {
    "title": "Texas throws its hat in the ring for cold chain powerhouse",
    "description": "",
    "link": "https://finance.yahoo.com/news/texas-throws-hat-ring-cold-181405047.html",
    "thumbnail": "https://s.yimg.com/ny/api/res/1.2/EKg4pSa79b2mDtwma4xpjA--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyMDA7aD02NzU-/https://media.zenfs.com/en/freightwaves_373/f4faa4e83070947abf4319060e2eac7b",
    "pubDate": "2025-11-26T18:14:05+00:00"
  },
  {
    "title": "Is Google Stock a Buy at $4 Trillion?",
    "description": "",
    "link": "https://finance.yahoo.com/news/google-stock-buy-4-trillion-180330877.html",
    "thumbnail": "https://s.yimg.com/ny/api/res/1.2/WNpA6WoJ2ffjeDmmmTsX8Q--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyMDA7aD04MDA-/https://media.zenfs.com/en/barchart_com_477/92ef183c42026825f0de825fd26975b4",
    "pubDate": "2025-11-26T18:03:30+00:00"
  },
  {
    "title": "HP Stock Tumbles While Dell Stock Climbs After Earnings. Here’s What Happened.",
    "description": "",
    "link": "https://www.barrons.com/articles/hp-stock-dell-earnings-analysts-644345fe?siteid=yhoof2&yptr=yahoo",
    "thumbnail": "",
    "pubDate": "2025-11-26T18:03:00+00:00"
  },
  {
    "title": "Down 45% From Its 52-Week High, Wall Street Still Loves This Semiconductor Stock",
    "description": "",
    "link": "https://finance.yahoo.com/news/down-45-52-week-high-180002664.html",
    "thumbnail": "https://s.yimg.com/ny/api/res/1.2/zA8In7s7mJ2VuQBrph3.TA--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyMDA7aD04MDA-/https://media.zenfs.com/en/barchart_com_477/0eec48aa19bd8939739b4615831b5272",
    "pubDate": "2025-11-26T18:00:02+00:00"
  },
  {
    "title": "Dogecoin ETF Launch Fails To Shine, Less Than $2 Million Inflows in 48 Hours",
    "description": "",
    "link": "https://finance.yahoo.com/news/dogecoin-etf-launch-fails-shine-180000034.html",
    "thumbnail": "https://s.yimg.com/ny/api/res/1.2/WBeQndKBMIRM2InFxCYiIw--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyMDA7aD02NzU-/https://media.zenfs.com/en/beincrypto_us_662/d112c24188ea500f73d7639c9639dd08",
    "pubDate": "2025-11-26T18:00:00+00:00"
  },
  {
    "title": "Libya Reopens Its Oil Patch and Big Oil Shows Up",
    "description": "",
    "link": "https://finance.yahoo.com/news/libya-reopens-oil-patch-big-180000915.html",
    "thumbnail": "https://media.zenfs.com/en/oilprice.com/44daf87dfddcaa59f8403f3d2a3566ed",
    "pubDate": "2025-11-26T18:00:00+00:00"
  },
  {
    "title": "IPO Stock Taps Massive Medicare Market, Soars Into Buy Range",
    "description": "",
    "link": "https://www.investors.com/stock-lists/ipo-analysis/ipo-stock-billiontoone-blln-stock/?src=A00220&yptr=yahoo",
    "thumbnail": "https://www.investors.com/wp-content/uploads/2017/02/A1mainCancer-021717-adobe.jpg",
    "pubDate": "2025-11-26T17:59:37+00:00"
  },
  {
    "title": "UK budget: financial services sector reaction",
    "description": "",
    "link": "https://finance.yahoo.com/news/uk-budget-financial-services-sector-175608995.html",
    "thumbnail": "https://media.zenfs.com/en/private_banker_international_938/e5b23179b442230193e745cc2e2204a3",
    "pubDate": "2025-11-26T17:56:08+00:00"
  },
  {
    "title": "Apple contests India's antitrust penalty law with risk of $38 billion fine, filing shows",
    "description": "",
    "link": "https://finance.yahoo.com/news/apple-contests-indias-antitrust-penalty-174453263.html",
    "thumbnail": "https://media.zenfs.com/en/reuters-finance.com/0aede2ba9f82a8b8e9fe9dbd8fa63852",
    "pubDate": "2025-11-26T17:44:53+00:00"
  },
  {
    "title": "Mortgage rates dropped this week amid fresh signs of job market weakness",
    "description": "",
    "link": "https://finance.yahoo.com/news/mortgage-rates-dropped-this-week-amid-fresh-signs-of-job-market-weakness-170338602.html",
    "thumbnail": "https://s.yimg.com/ny/api/res/1.2/mYaxQ2PK6NvWWInp38yd4w--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyMDA7aD04MDA-/https://s.yimg.com/os/creatr-uploaded-images/2025-11/64a9b680-cae9-11f0-b3af-28fc92eb3877",
    "pubDate": "2025-11-26T17:03:38+00:00"
  },
  {
    "title": "Black Friday car deals are sparser this year, analyst says: 'Buyers may be a little disappointed'",
    "description": "While there's ample inventory to choose from, car shoppers may have a hard time finding any generous Black Friday or end-of-year deals.",
    "link": "https://www.cnbc.com/2025/11/26/black-friday-car-deals.html",
    "thumbnail": "https://image.cnbcfm.com/api/v1/image/108231616-1764075848408-gettyimages-2047728376-ikf01584.jpeg?v=1764075877&w=1920&h=1080",
    "pubDate": "2025-11-26T12:35:01+00:00"
  }
]