[
  {
    "title": "Animoca bets on altcoin upside to lure investors as it plans for IPO",
    "description": "Animoca Brands’ founder, Yat Siu, anticipates that the crypto industry will not have a one-winner “takes all” scenario like the internet era in the early 2000s.",
    "link": "https://cointelegraph.com/news/animoca-brands-altcoins-bitcoin-cryptocurrencies-investment-executive?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
    "thumbnail": "https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjUtMTEvMDE5YWMzMGUtN2YzYi03MmQ5LWE2YzItNTU0NjY5NWQ3N2Uz.jpg",
    "pubDate": "2025-11-27T03:42:04+00:00"
  },
  {
    "title": "SEC tokenized stock exemptions should be targeted, stock exchanges argue",
    "description": "A group representing major stock exchanges has urged the SEC to abandon its plan to grant an “innovation exemption” to brokers and crypto firms seeking to offer tokenized stocks.",
    "link": "https://cointelegraph.com/news/sec-tokenized-stock-exemptions-targeted-stock-exchanges-say?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
    "thumbnail": "https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjQtMTEvMDE5MzBlM2MtMTRjMC03MWMxLWJhY2UtZjk0NmM4OTNlYzA2.jpg",
    "pubDate": "2025-11-27T03:37:45+00:00"
  },
  {
    "title": "Bitcoin risks deeper drop if whale exchange deposits stay high: Analyst",
    "description": "Bitcoin whale deposits to exchanges surged to 9,000 BTC on Nov. 21, with large holders driving 45% of inflows. If it keeps up, Bitcoin could have more to fall.",
    "link": "https://cointelegraph.com/news/bitcoin-risks-further-downside-whales-continue-elevated-exchange-deposits-cryptoquant?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
    "thumbnail": "https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjQtMTEvMDE5MzYwZWEtYzQwYS03NzBkLWE4NTYtMTBiNDZhM2MxNjhi.jpg",
    "pubDate": "2025-11-27T03:36:34+00:00"
  },
  {
    "title": "China industrial profits drop 5.5% in October, worst performance in five months",
    "description": "While manufacturers find some relief from the trade pact, weak domestic demand and uncertainties in global trade continue to cast a shadow over the outlook.",
    "link": "https://www.cnbc.com/2025/11/27/china-industrial-profits-drop-in-october-worst-level-in-five-months-trade-uncertainty.html",
    "thumbnail": "https://image.cnbcfm.com/api/v1/image/108232846-1764201290410-gettyimages-2197358286-ECP_fc1233819.jpeg?v=1764201304&w=1920&h=1080",
    "pubDate": "2025-11-27T03:35:57+00:00"
  },
  {
    "title": "Bitcoin's Ascent May Hit a Wall Around Mid-$90K: Trading Firm",
    "description": "Bitcoin has surged past the $90,000 mark, buoyed by rising expectations of a December Federal Reserve rate cut.",
    "link": "https://www.coindesk.com/markets/2025/11/27/bitcoin-s-ascent-may-hit-a-wall-around-mid-usd90k-trading-firm",
    "thumbnail": "",
    "pubDate": "2025-11-27T03:29:36+00:00"
  },
  {
    "title": "Nasdaq seeks to ‘super-size’ option limits for BlackRock's Bitcoin ETF",
    "description": "The push from the Nasdaq to increase option limits for the BlackRock Bitcoin fund shows Bitcoin markets are “breaking out of their training wheels.”",
    "link": "https://cointelegraph.com/news/nasdaq-ibit-bitcoin-etf-options-1-million?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
    "thumbnail": "https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjQtMTIvMDE5M2M4MjktODY4OC03ZGQ0LWFjYzUtNTY3YjhjNGFmMDBh.jpg",
    "pubDate": "2025-11-27T03:20:26+00:00"
  },
  {
    "title": "Lego Star Wars Executor And Tantive IV Starships Are $40 Each For Black Friday",
    "description": "Lego Star Wars Executor Super Star Destroyer (630 Pieces) $40 (was $70) See at Walmart Lego Star Wars Tantive IV (654 Pieces) $40 (was $80) | Retiring soon See at Amazon See at Walmart Lego Star Wars Boarding the Tantive IV (502 Pieces) $33 (was $55) | Retiring soon See at Walmart See at Amazon Walmart's Black Friday Lego deals are selling fast, but Star Wars fans can still add Darth Vader and Princess Leia's ships to their collections at steeply discounted prices. The 630-piece Executor Super Star Destroyer is $30 off, dropping the price to only $40 (was $70). The Tantive IV is also on sale for $40, but this 654-piece model retails for $80, so you're saving 50% on Princess Leia's ship from A New Hope. Amazon is matching Walmart's deal for the Tantive IV. Star Wars fans can also save big on Boarding the Tantive IV, a 502-piece Lego set piece that recreates Darth Vader's first appearance. At the time of writing, Walmart has Boarding the Tantive IV for $33 (was $55), and Amazon is selling it for $38.49. Amazon had the $33 price earlier today (November 26), so it's possible the retailer will lower it again. The alternative is Walmart could raise its price, so we'd recommend scooping up the $33 deal while you still can. Continue Reading at GameSpot",
    "link": "https://www.gamespot.com/articles/lego-star-wars-executor-super-star-destroyer-tantive-iv-black-friday-deals/1100-6536544/?ftag=CAD-01-10abi2f",
    "thumbnail": "https://www.gamespot.com/a/uploads/square_avatar/1595/15950357/4612510-executorsuper.png",
    "pubDate": "2025-11-27T03:15:00+00:00"
  },
  {
    "title": "Hong Kong’s deadliest fire in 63 years: What we know and how it spread",
    "description": "At least 44 people have been killed in the blaze in Hong Kong's Tai Po neighbourhood. The fire is still raging.",
    "link": "https://www.aljazeera.com/news/2025/11/27/hong-kongs-deadliest-fire-in-63-years-what-we-know-and-how-it-spread?traffic_source=rss",
    "thumbnail": "https://www.aljazeera.com/wp-content/uploads/2025/11/2025-11-27T012535Z_131440516_RC2O4IAC98CH_RTRMADP_3_HONGKONG-FIRE-1764208464.jpg?resize=1920%2C1440",
    "pubDate": "2025-11-27T03:04:15+00:00"
  },
  {
    "title": "Hong Kong Arrests 3 Tied to Construction Company After Deadly Apartment Fire",
    "description": "The police said that building materials used by the company for the work at Wang Fuk Court may not have been up to fire safety standards. The police did not identify the company or who was arrested.",
    "link": "https://www.nytimes.com/2025/11/26/world/asia/arrests-hong-kong-fire-manslaughter.html",
    "thumbnail": "https://static01.nyt.com/images/2025/11/26/multimedia/26hong-kong-fire-arrests-wgpc/26hong-kong-fire-arrests-wgpc-facebookJumbo.jpg",
    "pubDate": "2025-11-27T03:03:59+00:00"
  },
  {
    "title": "What Is Operation Allies Welcome, the Program That Gave Some Afghans Entry to the U.S.?",
    "description": "The Biden administration set up the initiative after the Taliban retook power in Afghanistan in August 2021 for those who assisted U.S. troops.",
    "link": "https://www.nytimes.com/2025/11/26/us/operation-allies-welcome-dc-shooting.html",
    "thumbnail": "https://static01.nyt.com/images/2025/11/26/multimedia/26dc-shooting-live-operation-allies-welcome-qwvb/26dc-shooting-live-operation-allies-welcome-qwvb-facebookJumbo.jpg",
    "pubDate": "2025-11-27T02:49:16+00:00"
  },
  {
    "title": "Asia Morning Briefing: Bitcoin's Fragile Rally is Built on Shrinking Liquidity",
    "description": "Large holder deposits have hit exchanges and realized losses are climbing, according to CryptoQuant and Glassnode, indicating the market’s rally is being built on thin liquidity.",
    "link": "https://www.coindesk.com/markets/2025/11/27/asia-morning-briefing-bitcoin-s-fragile-rally-is-built-on-shrinking-liquidity",
    "thumbnail": "",
    "pubDate": "2025-11-27T02:35:42+00:00"
  },
  {
    "title": "Two National Guard members in critical condition after shooting near White House",
    "description": "Law enforcement sources said the suspect was an Afghan national who entered the US in 2021.",
    "link": "https://www.bbc.com/news/articles/c3r7qpqddnro?at_medium=RSS&at_campaign=rss",
    "thumbnail": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/51a4/live/74146670-cb33-11f0-8c06-f5d460985095.jpg",
    "pubDate": "2025-11-27T02:32:25+00:00"
  },
  {
    "title": "U.S. to Press Europe and Other Allies on Immigration, Document Says",
    "description": "American diplomats were told to raise U.S. concerns about “violent crimes associated with people of a migration background.”",
    "link": "https://www.nytimes.com/2025/11/26/us/politics/trump-rubio-mass-migration.html",
    "thumbnail": "https://static01.nyt.com/images/2025/11/26/multimedia/26dc-rubio-migrants-vwph/26dc-rubio-migrants-vwph-facebookJumbo.jpg",
    "pubDate": "2025-11-27T02:30:54+00:00"
  },
  {
    "title": "Russia’s ‘shadow vessels’ using false flags to skirt sanctions, report says",
    "description": "Centre for Research on Energy says 113 Russian vessels have flown a false flag in the first nine months of 2025.",
    "link": "https://www.aljazeera.com/economy/2025/11/27/russias-shadow-vessels-using-false-flags-to-skirt-sanctions-report-says?traffic_source=rss",
    "thumbnail": "https://www.aljazeera.com/wp-content/uploads/2025/11/2025-10-15T155706Z_948933989_RC27EBA2G9O4_RTRMADP_3_BRITAIN-RUSSIA-SANCTIONS-1761181127-1764206627.jpg?resize=1200%2C630&quality=80",
    "pubDate": "2025-11-27T02:26:13+00:00"
  },
  {
    "title": "DWF Labs launches $75M fund for ‘institutional phase’ of DeFi",
    "description": "Crypto market maker DWF Labs’ fund has been earmarked for dark pool DEXs, decentralized money markets, and yield-bearing products.",
    "link": "https://cointelegraph.com/news/dwf-labs-launches-75m-fund-institutional-phase-defi?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
    "thumbnail": "https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjUtMTEvMDE5YWMyNWYtNmUxZi03YzYxLTgyYTctOTJmMzE3NjZlZTY2.jpg",
    "pubDate": "2025-11-27T02:18:15+00:00"
  },
  {
    "title": "Asia-Pacific markets track Wall Street gains as tech extends rebound",
    "description": "Overnight, shares of artificial intelligence player Oracle boosted major U.S. averages after Deutsche Bank reaffirmed its bullish stance on the name.",
    "link": "https://www.cnbc.com/2025/11/27/asia-pacific-markets-today-thursday-nikkei-225-hang-seng-index-csi-300-kospi.html",
    "thumbnail": "https://image.cnbcfm.com/api/v1/image/107233749-1683003461527-gettyimages-103455489-gi_0198006.jpeg?v=1740525072&w=1920&h=1080",
    "pubDate": "2025-11-27T01:59:33+00:00"
  },
  {
    "title": "Zootopia 2 creators address the post-credits scene and Zootopia 3",
    "description": "Zootopia 2 has a post-credits scene that teases Zootopia 3. Here's what it means, and what the directors say about the series' future.",
    "link": "https://www.polygon.com/zootopia-2-post-credits-scene-explained-director-interview-sequel/",
    "thumbnail": "https://static0.polygonimages.com/wordpress/wp-content/uploads/2025/11/mcdzotw_wd005.jpg?w=1600&h=900&fit=crop",
    "pubDate": "2025-11-27T01:44:57+00:00"
  },
  {
    "title": "Social media users report Netflix outage during 'Stranger Things' premiere",
    "description": "Social media users said they were experiencing issues with Netflix on Wednesday, the night of the \"Stranger Things\" fifth season premiere.",
    "link": "https://www.cnbc.com/2025/11/26/netflix-outage-stranger-things.html",
    "thumbnail": "https://image.cnbcfm.com/api/v1/image/108219999-17619180342025-10-31t124225z_1078586780_rc2ymhavntx8_rtrmadp_0_television-stranger-things-season-5-lucca.jpeg?v=1761918055&w=1920&h=1080",
    "pubDate": "2025-11-27T01:36:21+00:00"
  },
  {
    "title": "Grab Mega Man: The Complete Series On Blu-Ray For 40% Off",
    "description": "Mega Man: The Complete Series (Blu-ray) $30 (was $50) | Black Friday Deal See at Amazon See at Crunchyroll Mega Man: The Complete Series is on sale for 40% off at Amazon for Black Friday. Fans of the Blue Bomber can pick up the '90s animated series on Blu-ray for only $30 (was $50). Mega Man: The Complete Series just launched on Blu-ray at the end of October, so it's not surprising this is a new all-time low for one of Discotek Media's latest Blu-ray releases. Several other adaptations of video games in Discotek Media's catalog are on sale for Black Friday, including Professor Layton and the Eternal Diva for $15 (was $25), Monster Rancher: The Complete Series for $36 (was $60), and Darkstalkers: The Complete Animated Series for $24 (was $40). Darkstalkers launched last month on the same day as Mega Man. You can also save big on several of Discotek's Digimon movie and TV collections. Continue Reading at GameSpot",
    "link": "https://www.gamespot.com/articles/grab-mega-man-the-complete-series-on-blu-ray-for-40-off/1100-6533981/?ftag=CAD-01-10abi2f",
    "thumbnail": "https://www.gamespot.com/a/uploads/square_avatar/1601/16018044/4550187-mega-man-square.jpg",
    "pubDate": "2025-11-27T01:20:00+00:00"
  },
  {
    "title": "PS5 Owners Can Save A Few Bucks On The Minecraft Physical Edition This Week",
    "description": "Minecraft Physical Edition (PS5) $25 (was $30) See at Amazon Amazon's Black Friday deals are officially here, and right now you'll find the Minecraft Physical Edition on PS5 for its lowest price ever. It's discounted to just $25 (was $30), so if you haven't yet played the iconic game, this is a great chance to dive in (or snag it as an affordable gift for a friend or family member). The discount doesn't seem like much, but it comes bundled with 3,500 Tokens, which typically cost $20. This version of Minecraft doesn't see many discounts. It briefly dropped its price by a few bucks during the summer, but this Black Friday deal is the best we've seen. If you're looking for a holiday gift for a younger gamer in your life, this is likely a good choice--just keep in mind this discount only applies to the physical PS5 version. Minecraft Physical Edition (PS5) $25 (was $30) While you'll find Minecraft for $20 at most digital storefronts, this physical edition deal is actually the better offer. Not only do you get a few in-game goodies, but you're getting an additional value of $20 from the 3,500 Tokens. That's a total value of $40 for just $25--and if you know you'll be buying stuff from the in-game store, this is certainly the edition to get. It gets you a physical copy of Minecraft, 3,500 Tokens, and two in-game items: the Popcorn Bucket Hat and Butter Shirt. See at Amazon Minecraft has seen massive success over the years, so it should come as no surprise that it's built up an impressive list of accompanying merchandise. And ahead of Black Friday, several Lego Minecraft sets are on sale. These include the 555-piece Ghast Balloon village Attack set, which is down to $56 (was $70), while the Woodland Mansion Fighting Ring is discounted to $41.49 (was $50), and the Trial Chamber is on sale for $32 (was $40). Check out the links below for even more Minecraft Lego set deals, and then be sure to check out GameSpot's Black Friday Deals Hub to see the latest holiday shopping price cuts on even more video games, Lego sets, and beyond. Lego Minecraft Black Friday Deals Ghast Balloon Village Attack (555 pieces) -- $56 ($70) Mooshroom House (500 pieces) -- $42.49 ($50) Parrot House (535 pieces) -- $56 ($70) Pickaxe Mine (530 pieces) -- $44 ($55) Woodland Mansion Fighting Ring (491 pieces) -- $41.49 ($50) Trial Chamber (322 pieces) -- $32 ($40) Amazon Black Friday Gaming Deals Check out all of the video game and hardware discounts. See at Amazon Sign up for GameSpot's Weekly Deals Newsletter: Continue Reading at GameSpot",
    "link": "https://www.gamespot.com/articles/minecraft-physical-edition-deals-ps5-black-friday/1100-6536428/?ftag=CAD-01-10abi2f",
    "thumbnail": "https://www.gamespot.com/a/uploads/square_avatar/1702/17023653/4608533-81huedtqval._sl1500.jpg",
    "pubDate": "2025-11-27T01:16:00+00:00"
  },
  {
    "title": "Tom Lee cools on $250K Bitcoin call, year-end ATH now just a ‘maybe’",
    "description": "BitMine chair Tom Lee says Bitcoin’s “best days” are still ahead, but has seemingly eased off his bullish prediction of $250,000 Bitcoin by the end of 2025.",
    "link": "https://cointelegraph.com/news/bitmine-tom-lee-bitcoin-prediction-pullback-year-end?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
    "thumbnail": "https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjUtMTEvMDE5YWMyYWItMjRmMS03YWQ3LWFjNTUtNjk2ZTg5ODkxNTlj.jpg",
    "pubDate": "2025-11-27T01:07:40+00:00"
  },
  {
    "title": "Arc Raiders Is Discounted On PC Until December 1",
    "description": "Arc Raiders $34.39 (was $40) See at Fanatical (Standard) See at Fanatical (Deluxe) We've seen a bunch of highly anticipated shooters hit the market over the past few months, and while Battlefield 6 and Call of Duty: Black Ops 7 might be the heavy hitters, extraction shooter Arc Raiders is earning just as much praise. It's currently one of the best-selling and most played games on Steam--and ahead of Black Friday, you can add it to your collection for just $34.39 (was $40). The deal is part of Fanatical's Black Friday sale, which runs until December 1. You'll also get to spin the Black Friday Sale Wheel for spending over $15, which gets you everything from discount coupons to free games. Arc Raiders $34.39 (was $40) The standard edition of Arc Raiders gets you the base games, and purchasing at Fanatical gets you an official Steam key. But if you'd like a few in-game goodies, the Deluxe Edition is also on sale at Fanatical for $52.79 (was $60). This version includes extra cosmetics plus 2,400 Raider Tokens, the premium in-game currency used for cosmetic purchases. Here's a full look at what you'll get in the Deluxe Edition: Wanderer Set: Valente Outfit, Pathfinder Backpack, Blanket Roll Backpack Attachment Character Cosmetic Finger Gun Rapid Fire Emote Cowboy Scrappy Body Type and Skin 2,400 Raider Tokens See at Fanatical (Standard) See at Fanatical (Deluxe) Our Arc Raiders review gave it a resounding 9/10, thanks to its engaging gunplay, unique world design, and challenging endgame content. \"Arc Raiders is an extraction shooter, which means there are technically several popular games like it, but I've never played a game in the genre that's as unpredictable, thrilling, and--perhaps most surprising of all--hopeful,\" wrote critic Mark Delaney. \"We can all kill each other in Arc Raiders. The fact that most of us are choosing instead to lend a helping hand, if not a sign that humanity will be all right in the real world, at the very least makes for one of the best multiplayer games I've ever played.\" Arc Raiders isn't the only great shooter on sale at Fanatical. Thanks to the retailer's Black Friday sale, you can pick up another extraction shooter, Escape from Tarkov, for $37.49 (was $50), which offers a similar PvPvE experience, though it's not quite as beginner-friendly as Arc Raiders. And if you're after a more cooperative experience without the threat of other players, check out Helldivers 2, which continues to see big updates more than a year after release. These deals are just some of the PC gaming discounts available in Fanatical's Black Friday event, so be sure to check out the full sale for even more price cuts. And for even more discounts on video games, tech, Blu-ray, and beyond, be sure to check out GameSpot's Black Friday Deals Hub. Continue Reading at GameSpot",
    "link": "https://www.gamespot.com/articles/fanatical-arc-raiders-black-friday-deal/1100-6536437/?ftag=CAD-01-10abi2f",
    "thumbnail": "https://www.gamespot.com/a/uploads/square_avatar/1702/17023653/4608692-3ef1ea90a64952c060b797fde8602ee7.jpg",
    "pubDate": "2025-11-27T01:03:00+00:00"
  },
  {
    "title": "What to Know About the Fire at a Hong Kong Apartment Complex",
    "description": "Firefighters struggled to contain the blaze in the high-rise buildings. At least 44 people were killed, and many more were feared trapped inside the towers.",
    "link": "https://www.nytimes.com/2025/11/26/world/asia/hong-kong-fire-what-to-know.html",
    "thumbnail": "https://static01.nyt.com/images/2025/11/26/multimedia/26hong-kong-fire-wwk-wzmt/26hong-kong-fire-wwk-wzmt-facebookJumbo.jpg",
    "pubDate": "2025-11-27T00:52:39+00:00"
  },
  {
    "title": "Build An In-Home Arcade With These Arcade1Up Black Friday Deals",
    "description": "Arcade1Up Black Friday Deals Save $50 On Select Cabinets See deals at Amazon The traditional video game arcade might be a relic of the past, but thanks to Arcade1Up, you can bring that retro magic home by assembling your own line of gaming cabinets. For Black Friday 2025, several of the company’s popular arcade cabinets have gotten discounts, with discounts of around $50 on each unit. These cabinets feature multiple pre-installed games and nostalgic designs inspired by classic arcade machines, including original artwork and replica decals on each model, along with modern touches like vibrant LCD displays, adjustable speakers, and online multiplayer modes so you can compete against other Arcade1Up players over the internet. Six models are included in Amazon's deals, including the Class Of '81 Deluxe Arcade Machine and the NBA Jam Deluxe Cabinet, among others. Check out all the discounted Arcade1Up machines below, along with lists of all the games each one comes with. Arcade1Up Class of 81' Deluxe Arcade Machine $450 (was $500) This budget-friendly arcade cabinet has a bright blue finish and decals to give it an '80s-themed look. This model has a 17-inch screen, dual speakers, a light-up marquee, and online leaderboards. 12 games come pre-installed, here's a look at them all: DigDug DigDug 2 Druaga Galaga Galaga '88 Galaxian King &amp; Balloon Mappy Ms. Pac-Man Rally-X Rolling Thunder Rompers See at Amazon Arcade1Up Golden Tee 3D 35th Anniversary Deluxe Arcade Machine $450 (was $500) For a quick round of golf, you can get this deluxe standing cabinet that doesn't require a riser. It comes with eight games (listed below) with online leaderboards. It has a 17-inch display, dual speakers, and a light-up marquee. Golden Tee ‘97 Golden Tee ‘98 Golden Tee ‘99 Golden Tee 2K Golden Tee Classic Shuffle Shot Tee 3D '95 World Class Bowling See at Amazon Arcade1Up NBA Jam Deluxe Cabinet $450 (was $500) This arcade cabinet sports a striking design that makes it resemble the texture of a basketball, and it comes with three games--NBA Jam, NBA Jam: Tournament Edition, and NBA Hangtime. The control panel supports up to two players, and since this is a deluxe model, it is taller than regular Arcade1Up cabinets and it does not require a riser. You can also test your skills on the court through online competition, as the cabinet is Wi-Fi enabled. See at Amazon Arcade1Up Pac-Man Deluxe Cabinet $450 (was $500) Sporting a very bright yellow design, the Pac-Man arcade cabinet comes preloaded with 14 games (listed below). Like the models listed above, this one has a 17-inch display, dual speakers, a light-up marquee, and support for online leaderboards. DigDug DigDug 2 Galaga Galaga '88 Galaxian Mappy Pac-Man Pac-Man Plus Pac-Land Pac &amp; Pal Rolling Thunder Rompers Super Pac-Man See at Amazon Arcade1Up Infinity Game Board $470 (was $500) Designed to be a replacement for a cupboard full of board games, the Infinity Game Board comes preloaded with more than 50 digital board and card games. You can expand the library by browsing the built-in shop and downloading new titles from a selection of more than 170 games. This is a lap-sized device with a built-in 18.5-inch HD touchscreen, and it supports local and online multiplayer for up to six users. See at Amazon Arcade1Up 32-inch Infinity Game Table $950 (was $1,000) For something even bigger, the Infinity Game Table is a 32-inch screen that rests on a set of detachable legs. Designed for multiple players to gather around it, it can run multiple board games like Monopoly, Scrabble, and Trivial Pursuit. It can also be used for other activities like puzzles, card games, and coloring books. See at Amazon While they’re not on sale for Black Friday, Arcade1Up does have a few more cabinets with attractive pricing. These are shorter than the standing models listed above, but you can extend their height by purchasing a Classic SE Riser for $59. The Pac-Man Classic Special Edition, Ms. Pac-Man Classic Special Edition, and Mortal Classic Special Edition cabinets are all priced at $334 each, and they come preloaded with a library of popular arcade games. If you’re limited on space, you can also grab a Countercade for $150. These are designed to sit on your desk, and they come in Pac-Man and Ms. Pac-Man variants Continue Reading at GameSpot",
    "link": "https://www.gamespot.com/articles/arcade1up-cabinet-deals-bf2025/1100-6536377/?ftag=CAD-01-10abi2f",
    "thumbnail": "https://www.gamespot.com/a/uploads/square_avatar/1701/17013431/4612813-4607631-arcade1up-1.jpg",
    "pubDate": "2025-11-27T00:51:00+00:00"
  },
  {
    "title": "The Walking Dead: The Complete Series Blu-Ray Set Is Down To Its Lowest Price Yet",
    "description": "The Walking Dead: Complete Collection (Blu-ray) $94.49 (was $175) See at Amazon Though many of its spin-offs live on, The Walking Dead TV series was officially put to rest in 2022. However, thanks to this Black Friday deal, it's risen from the dead and is now over 80% off at Amazon. You can grab The Walking Dead: Complete Series Blu-ray Box Set for just $94.49 (was $175), which is the lowest price we've seen for the collection. The collection is absolutely massive, containing every episode over the show's eleven seasons, making it one of the best ways to rewatch (or catch up) on the classic zombie thriller. Be sure to check it out before Black Friday ends. The Walking Dead: Complete Collection (Blu-ray) $94.49 (was $175) Packed with a staggering 54 discs, you'll find all 177 episodes from the show's 12-year run. Audio quality varies by season; season one features a 5.1 Dolby TrueHD audio track, while the other 10 seasons feature 7.1 Dolby TrueHD. The physical packaging features stylish, gore-soaked images of the show's main characters superimposed on nightmare-inducing zombies. If you're a fan of bonus features, you'll have a lot to work through with this collection. It pulls together every bonus feature from all previous single-season releases, giving you a wealth of behind-the-scenes shorts and documentaries to enjoy. There's also a 42-minute documentary covering the making of the last season. The Walking Dead: Complete Collection Blu-ray Special Features Audio Commentary tracks on select episodes The Walking Dead Season 11 \"Making Of\" Documentary Featurettes Behind-the-scenes Footage Webisodes Delete Scenes Photo gallery See at Amazon The Walking Dead: Complete Collection (Blu-ray)Amazon has a few other Walking Dead deals, including a slight discount on Fear The Walking Dead: The Complete Collection on Blu-ray. It's listed for $71.49 (was $79.50), and while it's not a huge price cut, it's actually listed for the lowest price we've ever seen. It includes all 113 episodes across 30 discs. The stylish The Walking Dead: Daryl Dixon (Season One) Steelbook is also on sale, listed at Amazon for $17 (was $24). Along with a red, white, and blue steelbook, it includes special features like cast diaries, featurettes, and behind-the-scenes footage. This too is the lowest price we've ever seen, and it's likely to disappear after Black Friday. It's offered in standard Blu-ray format. Continue Reading at GameSpot",
    "link": "https://www.gamespot.com/articles/the-walking-dead-the-complete-series-deal-bf2025/1100-6536507/?ftag=CAD-01-10abi2f",
    "thumbnail": "https://www.gamespot.com/a/uploads/square_avatar/1702/17023653/4612075-7138x56cspl._sl1500%281%29.jpg",
    "pubDate": "2025-11-27T00:24:00+00:00"
  },
  {
    "title": "The 'nice' neighbour behind Liverpool parade carnage",
    "description": "Paul Doyle was considered a steady, dependable family man before a 'calculated' act of violence.",
    "link": "https://www.bbc.com/news/articles/czxpdrvxx4ko?at_medium=RSS&at_campaign=rss",
    "thumbnail": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/ea01/live/782422f0-cade-11f0-9e07-03807f90fdcf.jpg",
    "pubDate": "2025-11-27T00:08:42+00:00"
  },
  {
    "title": "Pokémon Go Tour 2026 heads to Kalos",
    "description": "Niantic has announced Pokémon Go Tour Kalos, the 2026 event that will take place in February both in-person and globally.",
    "link": "https://www.polygon.com/pokemon-go-tour-2026-kalos-event/",
    "thumbnail": "https://static0.polygonimages.com/wordpress/wp-content/uploads/2025/11/go-tour-2026-key-art.png?w=1600&h=900&fit=crop",
    "pubDate": "2025-11-27T00:05:14+00:00"
  },
  {
    "title": "Nine ways the Budget could affect you if you're under 25",
    "description": "The chancellor's Budget contained a slew of measures which will impact young people specifically.",
    "link": "https://www.bbc.com/news/articles/cn4dxmg7jyjo?at_medium=RSS&at_campaign=rss",
    "thumbnail": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/46f7/live/e55c7e80-cade-11f0-995e-fb191683181c.jpg",
    "pubDate": "2025-11-27T00:00:43+00:00"
  },
  {
    "title": "Thailand’s pork industry fears influx of cheap US imports under Trump",
    "description": "Thai pork producers are bracing for intense competition as the US seeks duty-free access to a $3bn market.",
    "link": "https://www.aljazeera.com/economy/2025/11/26/thailands-pork-industry-fears-influx-of-cheap-us-imports-under-trump?traffic_source=rss",
    "thumbnail": "https://www.aljazeera.com/wp-content/uploads/2025/11/GettyImages-1363438394-1-1764141398.jpg?resize=1920%2C1440",
    "pubDate": "2025-11-26T23:49:06+00:00"
  },
  {
    "title": "Add This 10-in-1 Activity Table To Your Game Room For Cheap During Black Friday",
    "description": "Best Choice Products 10-in-1 Gaming Table $120 (was $300) See at Walmart See at Amazon ($170) Walmart's Black Friday sale is officially live, and one of the standout deals is a 60% discount on the Best Choice Products 10-in-1 Gaming Table. The multi-game table includes pieces and tabletops for foosball, air hockey, pool, chess, and more. Right now, you can snag it for just $120 (was $300). Since this Black Friday deal won't stick around forever, it's possible it could sell out fast. If it does, Amazon is discounting the table to $170 instead. Best Choice Products 10-in-1 Gaming Table $120 (was $300) The Best Choice Products 10-in-1 Gaming Table features interchangeable tabletops and 50 accessories to play 10 different games. It's quite small at two feet by four feet, so you should have no problem finding a place for it in your basement or game room. But keep in mind that this size also means a lot of the games aren't played on regulation-size surfaces. Kids, however, should find it to be plenty entertaining, with the option to enjoy several different games without the need to consume your home with several different tables. When you're not using one of the interchangeable tabletops, they can be stacked for compact storage. Here's what games you'll get to play: Slide hockey Foosball Billiards Shuffleboard Table Tennis Chess Cards Checkers Bowling Backgammon Walmart's $120 price applies only to the Walnut wood version; the other variants are priced at $170. See at Walmart See at Amazon ($170) Like the idea, but wish the price was under $100? Then check out the 3-in-1 Multi Game Table, as it's discounted to $89 (was $250). It's not quite as jampacked with games, but you'll still get access to billiards, air hockey, and foosball--and the table's overall dimensions are about the same. For something different, the Costway Electronic Shot Basketball Arcade Game is $90 (was $209), giving you a fun way to practice your shot when there's snow on the driveway. Featuring sound effects, an LED scoreboard, and multiple game modes, it's a cool alternative for any basketball fan. Continue Reading at GameSpot",
    "link": "https://www.gamespot.com/articles/10-in-1-game-table-for-140-bf2025/1100-6536495/?ftag=CAD-01-10abi2f",
    "thumbnail": "https://www.gamespot.com/a/uploads/square_avatar/1702/17023653/4611956-best-choice-products-2x4ft-10-in.jpg",
    "pubDate": "2025-11-26T23:48:00+00:00"
  },
  {
    "title": "CNBC's The China Connection newsletter: Foreign investors warm to China’s cheaper AI valuations despite fears of a U.S. bubble",
    "description": "For all the worries about a bubble in U.S. AI spending, capital flows into China's tech sector is far less, pushing startups to do more with less.",
    "link": "https://www.cnbc.com/2025/11/26/cnbc-china-connection-newsletter-capital-ai-sector-valuations-vc-us-bubble-nvidia-deepseek-chatgpt.html",
    "thumbnail": "https://image.cnbcfm.com/api/v1/image/108230885-1763991320793-gettyimages-2222125433-CHINA_NOETIX_ROBOTICS.jpeg?v=1764205030&w=1920&h=1080",
    "pubDate": "2025-11-26T23:31:53+00:00"
  },
  {
    "title": "Canada announces new support for lumber, steel industries hit by tariffs",
    "description": "The new plan comes amid stalled trade talks between Ottawa and Washington.",
    "link": "https://www.aljazeera.com/economy/2025/11/26/canada-announces-new-support-for-lumber-steel-industries-hit-by-tariffs?traffic_source=rss",
    "thumbnail": "https://www.aljazeera.com/wp-content/uploads/2025/11/2025-11-23T081216Z_1350076382_RC282IAILOSF_RTRMADP_3_G20-SUMMIT-1764193107.jpg?resize=1920%2C1440",
    "pubDate": "2025-11-26T23:09:19+00:00"
  },
  {
    "title": "Trump Says South Africa Is Not Invited to G20 Summit in U.S. in 2026",
    "description": "The president did not attend this year’s annual gathering in South Africa, which has been a frequent target of his attacks.",
    "link": "https://www.nytimes.com/2025/11/26/world/africa/trump-south-africa-g20.html",
    "thumbnail": "https://static01.nyt.com/images/2025/11/26/multimedia/26int-safrica-trump-SWAP-zvgj/26int-safrica-trump-SWAP-zvgj-facebookJumbo.jpg",
    "pubDate": "2025-11-26T23:01:39+00:00"
  },
  {
    "title": "PSV trounce Liverpool as Arsenal topple Bayern while PSG and Real also win",
    "description": "PSV Eindhoven inflict third straight defeat on Premier League holders Liverpool, as Arsenal top Champions League.",
    "link": "https://www.aljazeera.com/sports/2025/11/26/psv-trounce-liverpool-as-arsenal-topple-bayern-while-psg-and-real-also-win?traffic_source=rss",
    "thumbnail": "https://www.aljazeera.com/wp-content/uploads/2025/11/2025-11-26T221833Z_348653628_UP1ELBQ1P26VD_RTRMADP_3_SOCCER-CHAMPIONS-LIV-PSV-1764196159.jpg?resize=1920%2C1423",
    "pubDate": "2025-11-26T22:51:06+00:00"
  },
  {
    "title": "Disney Lorcana TCG Deals - Newly Restocked Booster Box Gets $60 Discount",
    "description": "Disney Lorcana TCG: Into the Inklands Bundle $24.49 (was $35) See at Amazon Disney Lorcana TCG: Elsa Gift Box $20 (was $30) See at Amazon Disney Lorcana TCG: Reign of Jafar - Illumineer's Trove $33 (was $50) See at Amazon Disney Lorcana TCG products are on sale for great prices in Amazon's Black Friday sale, but collectors might be most interested in a newly restocked bundle that isn't even marked as a discount. For the first time since January, Amazon has Disney Lorcana's Into the Inklands Booster Box in stock. It being in stock at all is surprising--though not nearly as surprising as its price. Lorcana fans can snag the Into the Inklands Booster Box for only $83. That's a $61 discount compared to to its original price. We can't imagine Amazon will keep the price this low for long. Continue Reading at GameSpot",
    "link": "https://www.gamespot.com/articles/disney-lorcana-trading-card-game-best-black-friday-bundle-deals/1100-6536246/?ftag=CAD-01-10abi2f",
    "thumbnail": "https://www.gamespot.com/a/uploads/square_avatar/1595/15950357/4602802-lorcanainklands.png",
    "pubDate": "2025-11-26T22:37:00+00:00"
  },
  {
    "title": "The Steam Machine Doesn't Even Have To Try",
    "description": "When news of the revived Steam Machine dropped, throngs of excited enthusiasts quickly staked a claim in its existence. They excitedly heralded its entry into what we all know to be the long-dead \"console war.\" The media chimed in too, opining about the timeliness of its return and whether or not it has the chance to significantly dent the crowded market it's entering into. But I don't think the Steam Machine really needs to \"fight\" in the traditional sense to be competitive. That's because I don't believe it actually has to do anything in order to chip away at the already-crumbling console infrastructure to win hearts and minds. It just has to be there. The console market is arguably in the best place it's ever going to be for a large shakeup. Nintendo is, as always, doing its own thing with the Switch 2, which has proven itself to be a phenomenon beyond what we've seen before, and capable of filling the first Switch's intimidatingly large shoes and serving Nintendo's large niche. Continue Reading at GameSpot",
    "link": "https://www.gamespot.com/articles/the-steam-machine-doesnt-even-have-to-try/1100-6536541/?ftag=CAD-01-10abi2f",
    "thumbnail": "https://www.gamespot.com/a/uploads/screen_kubrick/1748/17481584/4612664-steammachine.jpg",
    "pubDate": "2025-11-26T22:36:00+00:00"
  },
  {
    "title": "NHS doctor suspended over alleged antisemitic social media posts",
    "description": "The tribunal ruled the doctor's posts \"may impact on patient confidence\" in both her and the profession.",
    "link": "https://www.bbc.com/news/articles/cy4x78mrxk3o?at_medium=RSS&at_campaign=rss",
    "thumbnail": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/361a/live/84648fa0-cb15-11f0-970b-9fa9a19bcb60.jpg",
    "pubDate": "2025-11-26T22:30:42+00:00"
  },
  {
    "title": "Trump yanks G20 invitation from South Africa over false genocide claims",
    "description": "The US president has repeatedly accused South Africa of perpetrating human rights abuses against white Afrikaners.",
    "link": "https://www.aljazeera.com/news/2025/11/26/trump-yanks-g20-invitation-from-south-africa-over-false-genocide-claims?traffic_source=rss",
    "thumbnail": "https://www.aljazeera.com/wp-content/uploads/2025/11/AP25330049418771-1764195200.jpg?resize=1920%2C1440",
    "pubDate": "2025-11-26T22:29:50+00:00"
  },
  {
    "title": "Here’s what happened in crypto today",
    "description": "Need to know what happened in crypto today? Here is the latest news on daily trends and events impacting Bitcoin price, blockchain, DeFi, NFTs, Web3 and crypto regulation.",
    "link": "https://cointelegraph.com/news/what-happened-in-crypto-today?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
    "thumbnail": "https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjUtMDYvMDE5Nzk0MjMtZWY4ZS03YzYwLWI5MzctYjlkZGY3NWZlOGFk.jpg",
    "pubDate": "2025-11-26T22:20:07+00:00"
  },
  {
    "title": "'I am devastated': Hong Kong residents in disbelief after fire destroys blocks of flats",
    "description": "Efforts to control the blaze are continuing as locals wait for news of missing loved ones.",
    "link": "https://www.bbc.com/news/articles/cvgjnlx1g6yo?at_medium=RSS&at_campaign=rss",
    "thumbnail": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/57a5/live/b7641ed0-caec-11f0-8c06-f5d460985095.png",
    "pubDate": "2025-11-26T22:12:59+00:00"
  },
  {
    "title": "Conor McGregor calls out Khabib over NFTs, gets shut down by ZachXBT",
    "description": "The former UFC champion tried to launch his own celebrity memecoin, REAL, in April, but the project failed to gain traction.",
    "link": "https://cointelegraph.com/news/conor-mcgregor-khabib-nft-shut-down-zachxbt?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
    "thumbnail": "https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjUtMTEvMDE5YWMxZmEtMGYzYS03OGYwLTkxMzAtYzZiNDMwMDExZTcx.jpg",
    "pubDate": "2025-11-26T22:06:16+00:00"
  },
  {
    "title": "The best Game Pass co-op games to play with family on Thanksgiving",
    "description": "Stop arguing with the fam and start playing games with them. Game Pass has plenty of co-op multiplayer hits to enjoy this Thanksgiving.",
    "link": "https://www.polygon.com/game-pass-games-rec-thanksgiving-holiday-weekend-nov-26-2025/",
    "thumbnail": "https://static0.polygonimages.com/wordpress/wp-content/uploads/2025/11/tmnt-shredder-s-revenge-co-op-screen.png?w=1600&h=900&fit=crop",
    "pubDate": "2025-11-26T22:04:38+00:00"
  },
  {
    "title": "Bitcoin shows ‘strong negative correlation’ with USDt activity: Glassnode",
    "description": "A recent analysis shed light on another correlation between the world’s largest cryptocurrency and stablecoin by market capitalization.",
    "link": "https://cointelegraph.com/news/bitcoin-usdt-performance-glassnode?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
    "thumbnail": "https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjUtMDYvMDE5NzM1NzctYjkzYy03ZjYxLWI2MjItNTJiMGFhYjdmYjBi.jpg",
    "pubDate": "2025-11-26T21:55:53+00:00"
  },
  {
    "title": "WoW Housing Gets You Rewards In Other Blizzard Games, Including An Overwatch 2 Skin",
    "description": "This week in World of Warcraft, player housing will debut in early access to anyone who purchased the upcoming Midnight expansion coming with WoW's 1.2.7 update. To mark the occasion, Blizzard is giving out rewards in several of its games. The only thing players have to do to unlock rewards in multiple games is to earn the \"Welcome Home\" Achievement. To do that, all you need to do is move into a home and fill out a form. That will grant you a new set of cosmetics in Overwatch 2, Heathstone, and StarCraft 2. Here's a breakdown of what you'll get in each game. Overwatch 2 Xal’atath Symmetra Legendary Skin Xal’atath Symmetra Spray Xal'atath Symmetra Name Card Dark Heart Player Icon The Overwatch 2, Heartthstone and StarCraft 2 rewards from World of Warcraft.Hearthstone Earning the \"Welcome Home\" achievement in WoW unlocks the Hearth &amp; Home Card Back StarCraft 2 Earning new Horde and Alliance StarCraft II console skins after you earn the \"Welcome Home\" achievement in WoW. Heathstone is also running a new, limited-time in-game event, \"Welcome to the Neighborhood!,\" featuring an earnable Epic event card. Continue Reading at GameSpot",
    "link": "https://www.gamespot.com/articles/wow-housing-gets-you-rewards-in-other-blizzard-games-including-an-overwatch-2-skin/1100-6536542/?ftag=CAD-01-10abi2f",
    "thumbnail": "https://www.gamespot.com/a/uploads/scale_super/1837/18375603/4612662-worldofwarcrafthousing.jpg",
    "pubDate": "2025-11-26T21:46:00+00:00"
  },
  {
    "title": "Tokenized money market funds surge to $9B, BIS warns of new risks",
    "description": "On-chain money market funds have grown nearly tenfold since 2023, but the Bank for International Settlements warns their adoption brings new liquidity and contagion risks.",
    "link": "https://cointelegraph.com/news/tokenized-money-market-funds-bis-stablecoin-contagion-risks?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
    "thumbnail": "https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjUtMTEvMDE5YWMxZjktY2Q2NS03ZTFlLWJmYzEtYmQ5ZWUxNDQ2OTMz.jpg",
    "pubDate": "2025-11-26T21:44:05+00:00"
  },
  {
    "title": "New UAE Sweeping Banking Decree Looks to Cement Country’s Global Crypto Position",
    "description": "UAE’s new financial law brings crypto and blockchain into traditional finance and under Central Bank’s supervision.",
    "link": "https://www.coindesk.com/policy/2025/11/26/new-uae-sweeping-banking-decree-looks-to-cement-country-s-global-crypto-position",
    "thumbnail": "",
    "pubDate": "2025-11-26T21:31:44+00:00"
  },
  {
    "title": "Extra time for peers to debate assisted dying",
    "description": "The assisted dying bill is allocated further sessions after a record number of amendments in the House of Lords.",
    "link": "https://www.bbc.com/news/articles/cy8jy3vr38mo?at_medium=RSS&at_campaign=rss",
    "thumbnail": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/4ef2/live/d5a7a160-caf0-11f0-84e9-a9bb2f1691c9.png",
    "pubDate": "2025-11-26T21:06:54+00:00"
  },
  {
    "title": "Washington DC shooting live: 2 National Guard troops hurt, suspect detained",
    "description": "Officials in Washington, DC, say one suspect is in custody after the 'targeted shooting' one block from the White House.",
    "link": "https://www.aljazeera.com/news/liveblog/2025/11/26/live-two-us-national-guard-members-shot-killed-near-white-house?traffic_source=rss",
    "thumbnail": "https://www.aljazeera.com/wp-content/uploads/2025/11/AFP__20251126__86AP7WD__v1__HighRes__UsCrimeNationalGuard-1764213049.jpg?resize=1920%2C1440",
    "pubDate": "2025-11-26T20:59:15+00:00"
  },
  {
    "title": "Emergency teams move hastily buried Palestinians to cemeteries",
    "description": "Palestinians are turning to Gaza’s Civil Defence to shift the loved ones they hastily buried to proper cemeteries.",
    "link": "https://www.aljazeera.com/video/newsfeed/2025/11/26/emergency-teams-move-hastily-buried-palestinians-to-cemeteries?traffic_source=rss",
    "thumbnail": "https://www.aljazeera.com/wp-content/uploads/2025/11/image-1764190687.jpg?resize=1920%2C1080&quality=80",
    "pubDate": "2025-11-26T20:58:35+00:00"
  },
  {
    "title": "UK judge reviews Terrorism Act ban on Palestine Action",
    "description": "Judges are reviewing the UK government’s decision to ban the activist group Palestine Action under counter-terror laws.",
    "link": "https://www.aljazeera.com/video/newsfeed/2025/11/26/uk-judge-reviews-terrorism-act-ban-on-palestine-action?traffic_source=rss",
    "thumbnail": "https://www.aljazeera.com/wp-content/uploads/2025/11/image-1764190392.jpg?resize=1620%2C1080&quality=80",
    "pubDate": "2025-11-26T20:54:26+00:00"
  },
  {
    "title": "Russia says talks to end Ukraine war ‘serious’ but rules out concessions",
    "description": "Kremlin spokesman says talks ongoing as US President Donald Trump pushes for an end to the conflict.",
    "link": "https://www.aljazeera.com/news/2025/11/26/russia-says-talks-to-end-ukraine-war-serious-but-rules-out-concessions?traffic_source=rss",
    "thumbnail": "https://www.aljazeera.com/wp-content/uploads/2025/11/getty_692758dcbc-1764186332.jpg?resize=1920%2C1440",
    "pubDate": "2025-11-26T20:50:19+00:00"
  },
  {
    "title": "Millions to pay more in tax as Reeves says Budget is tackling cost of living",
    "description": "The chancellor says she is \"asking ordinary people to pay a little bit more\" as she extends the freeze on income tax bands.",
    "link": "https://www.bbc.com/news/articles/c246npmq1n4o?at_medium=RSS&at_campaign=rss",
    "thumbnail": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/e55c/live/f7e80f90-cafe-11f0-a892-01d657345866.jpg",
    "pubDate": "2025-11-26T20:41:10+00:00"
  },
  {
    "title": "‘In Triage Every Day’: A Beleaguered Speaker Says He’s Overwhelmed",
    "description": "In a podcast interview, Speaker Mike Johnson opened up about the crushing demands of a job that he joked was his in name only.",
    "link": "https://www.nytimes.com/2025/11/26/us/politics/speaker-mike-johnson-beleagured.html",
    "thumbnail": "https://static01.nyt.com/images/2025/11/26/multimedia/26dc-johnson-kjcf/26dc-johnson-kjcf-facebookJumbo.jpg",
    "pubDate": "2025-11-26T20:27:32+00:00"
  },
  {
    "title": "Best Cookware Sets, Based on Years of Testing (2025)",
    "description": "Steer clear of those unwieldy 20-piece behemoths.",
    "link": "https://www.bonappetit.com/story/best-cookware-sets",
    "thumbnail": "https://assets.bonappetit.com/photos/67b916a23b230c59617d38a4/master/pass/best-cookware-sets_LEDE_021925_1398_VOG_Badge_final.jpg",
    "pubDate": "2025-11-26T20:25:42+00:00"
  },
  {
    "title": "APT Trades Little Changed, Undeperforms Wider Crypto Market Rally",
    "description": "The token has support around the $2.16 level and resistance at $2.31.",
    "link": "https://www.coindesk.com/markets/2025/11/26/apt-trades-little-changed-undeperforms-wider-crypto-market-rally",
    "thumbnail": "",
    "pubDate": "2025-11-26T20:22:22+00:00"
  },
  {
    "title": "Wizards delays MTG's Monster Hunter Secret Lair following fan backlash",
    "description": "After the Secret Lair reveal last week and the backlash that ensued, Wizards has delayed Monster Hunter's MTG Superdrop to next year.",
    "link": "https://www.polygon.com/magic-mtg-monster-hunter-secret-lair-delay/",
    "thumbnail": "https://static0.polygonimages.com/wordpress/wp-content/uploads/2025/03/mh-wilds-palico-small.jpg?w=1600&h=900&fit=crop",
    "pubDate": "2025-11-26T20:21:18+00:00"
  },
  {
    "title": "Colorado Judge Tells Immigration Agents to Stop Arrests Without Warrants",
    "description": "The ruling that immigration agents are acting illegally is the latest to rebuke the Trump administration’s tactics, but earlier orders have been blocked on appeal.",
    "link": "https://www.nytimes.com/2025/11/26/us/politics/colorado-immigration-ruling.html",
    "thumbnail": "https://static01.nyt.com/images/2025/11/26/multimedia/26nat-colorado-ice-1-kqbz/26nat-colorado-ice-1-kqbz-facebookJumbo.jpg",
    "pubDate": "2025-11-26T20:18:48+00:00"
  },
  {
    "title": "Judge dismisses Trump election interference racketeering case in Georgia",
    "description": "Fulton County Superior Court Judge Scott McAfee's ruling ends the final case against Trump that remained unresolved after he returned to the White House.",
    "link": "https://www.cnbc.com/2025/11/26/trump-georgia-election-case-dismissed-2020.html",
    "thumbnail": "https://image.cnbcfm.com/api/v1/image/108230861-1764172468628-108230861-1763989708794-gettyimages-2247478837-gy7fo6hhgkjw3vhhv7wyujcpty.jpg?v=1764172475&w=1920&h=1080",
    "pubDate": "2025-11-26T19:56:27+00:00"
  },
  {
    "title": "Golden Joysticks voting stats signal Clair Obscur sweep at The Game Awards",
    "description": "The Golden Joystick Awards revealed the voting stats for this year's show, revealing some decisive victories for Clair Obscur: Expedition 33.",
    "link": "https://www.polygon.com/golden-joysticks-2025-voting-data-clair-obscur-game-awards/",
    "thumbnail": "https://static0.polygonimages.com/wordpress/wp-content/uploads/2025/06/clair-obscur-expedition-33_2025-01-23_006-scaled-1.jpg?w=1600&h=900&fit=crop",
    "pubDate": "2025-11-26T19:47:37+00:00"
  },
  {
    "title": "ICE Detains Mother of White House Press Secretary Karoline Leavitt’s Nephew",
    "description": "Bruna Caroline Ferreira, the mother of a nephew of the White House press secretary, Karoline Leavitt, was pulled over and arrested on her way to pick up her son from school, Ms. Ferreira’s lawyer said.",
    "link": "https://www.nytimes.com/2025/11/26/us/karoline-leavitt-ice-family-member-bruna-ferreira.html",
    "thumbnail": "https://static01.nyt.com/images/2025/11/26/multimedia/26xp-ice-zwgl/26xp-ice-zwgl-facebookJumbo.jpg",
    "pubDate": "2025-11-26T19:43:17+00:00"
  },
  {
    "title": "Unboxing the raw, sometimes-embarrassing inspiration for Consume Me",
    "description": "Jenny Jiao Hsia, the developer of Consume Me, takes us on a tour of her teenage memories.",
    "link": "https://www.polygon.com/consume-me-developers-video-interview/",
    "thumbnail": "https://static0.polygonimages.com/wordpress/wp-content/uploads/2025/11/consumemenotext.jpg?w=1600&h=900&fit=crop",
    "pubDate": "2025-11-26T19:30:14+00:00"
  },
  {
    "title": "Signs of Fatigue: Trump Faces Realities of Aging in Office",
    "description": "President Trump has always used his stamina and energy as a political strength. But that image is getting harder for him to sustain.",
    "link": "https://www.nytimes.com/2025/11/25/us/politics/trump-age-health.html",
    "thumbnail": "https://static01.nyt.com/images/2025/11/25/multimedia/00dc-trump-health-TOP-mpfh/00dc-trump-health-TOP-mpfh-facebookJumbo.jpg",
    "pubDate": "2025-11-26T19:28:54+00:00"
  },
  {
    "title": "Eric Swalwell sues FHFA chief Pulte, alleging director used private information to attack Trump critics",
    "description": "Eric Swalwell alleges FHFA's Pulte used federal mortgage data to hurt Trump’s critics, leaking details about Swalwell family home ahead of his campaign launch.",
    "link": "https://www.cnbc.com/2025/11/26/swalwell-mortgage-fraud-lawsuit-fhfa-pulte-democrat-governor-bid.html",
    "thumbnail": "https://image.cnbcfm.com/api/v1/image/106237343-1573479639092rts2h5cp.jpg?v=1573479741&w=1920&h=1080",
    "pubDate": "2025-11-26T19:26:35+00:00"
  },
  {
    "title": "Everything BA Editors Tried, Tasted, and Loved in November",
    "description": "Like a sponge designed for glassware, a do-it-all ponzu sauce, and the coziest cinnamon creamer.",
    "link": "https://www.bonappetit.com/story/what-editors-loved-november-2025",
    "thumbnail": "https://assets.bonappetit.com/photos/692616c8098dad7a393df8f9/master/pass/11.25_BA_What%20BA%20Editors%20Loved%20in%20November.jpg",
    "pubDate": "2025-11-26T19:11:44+00:00"
  },
  {
    "title": "Chloe Kim prepares for the 2026 Winter Olympics in Mario Kart World",
    "description": "The U.S. champion snowboarder is coming back to the Olympic games, and she's as competitive as ever, as Polygon found out at the Nintendo store.",
    "link": "https://www.polygon.com/chloe-kim-mario-kart-nintendo-store/",
    "thumbnail": "https://static0.polygonimages.com/wordpress/wp-content/uploads/2025/11/chloekimthumb-1.jpg?w=1600&h=900&fit=crop",
    "pubDate": "2025-11-26T19:00:14+00:00"
  },
  {
    "title": "Analyst Report: Boeing Co.",
    "description": "",
    "link": "https://finance.yahoo.com/research/reports/ARGUS_2754_AnalystReport_1764183393000?yptr=yahoo&ncid=yahooproperties_plusresear_nm5q6ze1cei",
    "thumbnail": "https://s.yimg.com/cv/apiv2/cv/apiv2/social/images/yahoo-finance-default-logo.png",
    "pubDate": "2025-11-26T18:56:33+00:00"
  },
  {
    "title": "Best Nonstick Pans: Expert Recommendations for At-Home Chefs (2025)",
    "description": "You only need one, and we've tested dozens to find the very best.",
    "link": "https://www.bonappetit.com/story/best-nonstick-pans",
    "thumbnail": "https://assets.bonappetit.com/photos/67b916abc8baffb687deca3f/master/pass/best-nonstick-pans_LEDE_V1_021925_1612_VOG_Badge_final.jpg",
    "pubDate": "2025-11-26T18:52:05+00:00"
  },
  {
    "title": "This Persona-like RPG credits its creators in a revolutionary way",
    "description": "Slice of life tactics RPG Demonschool uses a simple yet effective method that tells players exactly what a developer worked on.",
    "link": "https://www.polygon.com/demonschool-rpg-persona-credits-developer-studio-work/",
    "thumbnail": "https://static0.polygonimages.com/wordpress/wp-content/uploads/2025/11/demonschool.jpg?w=1600&h=900&fit=crop",
    "pubDate": "2025-11-26T18:46:42+00:00"
  },
  {
    "title": "Faisal Islam: The real reason Reeves is making you pay more tax",
    "description": "This is about buying breathing space, politically and economically. The two factors are now inseparable.",
    "link": "https://www.bbc.com/news/articles/cyvg3en12r1o?at_medium=RSS&at_campaign=rss",
    "thumbnail": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/b138/live/38681fd0-cafd-11f0-a892-01d657345866.jpg",
    "pubDate": "2025-11-26T18:42:24+00:00"
  },
  {
    "title": "Best MXR-17 loadout in Black Ops 7",
    "description": "The best loadout to use with the MXR-17 in Black Ops 7.",
    "link": "https://www.polygon.com/black-ops-7-bo7-mxr-17-loadout-best-build-code/",
    "thumbnail": "https://static0.polygonimages.com/wordpress/wp-content/uploads/2025/11/black-ops-7-bo7-mxr-17-loadout-best-header.jpg?w=1600&h=900&fit=crop",
    "pubDate": "2025-11-26T18:31:08+00:00"
  },
  {
    "title": "Moonlighter 2: The Endless Vault review: Lots of depth for early access",
    "description": "Moonlighter 2: The Endless Vault delivers on the dungeon-to-shop formula in its early access release, albeit with a few scratches here and there.",
    "link": "https://www.polygon.com/moonlighter-2-the-endless-vault-early-access-sequel-review/",
    "thumbnail": "https://static0.polygonimages.com/wordpress/wp-content/uploads/2025/11/cheap-amulet_ml2.jpg?w=1600&h=900&fit=crop",
    "pubDate": "2025-11-26T18:27:45+00:00"
  },
  {
    "title": "Nasdaq ISE Files to Lift BlackRock IBIT Option Limits Into Top Tier Status",
    "description": "Filing comes amid rapid growth in IBIT options activity and a migration of open interest toward US regulated venues.",
    "link": "https://www.coindesk.com/markets/2025/11/26/nasdaq-ise-files-to-lift-blackrock-ibit-option-limits-into-top-tier-status",
    "thumbnail": "",
    "pubDate": "2025-11-26T18:26:03+00:00"
  },
  {
    "title": "House Democrats Issue Report Detailing Trump Crypto Ties as 'New Age of Corruption'",
    "description": "Democratic staff on the House Judiciary Committee gathered data on President Donald Trump's crypto businesses that reportedly gained his family massive wealth.",
    "link": "https://www.coindesk.com/policy/2025/11/26/house-democrats-issue-report-detailing-trump-s-crypto-ties-as-new-age-of-corruption",
    "thumbnail": "",
    "pubDate": "2025-11-26T18:14:53+00:00"
  },
  {
    "title": "Now not the time to replace BBC chair, says committee head",
    "description": "Dame Caroline Dinenage says she advises against any further large-scale changes at the top of the BBC.",
    "link": "https://www.bbc.com/news/articles/cy5g3yv201ko?at_medium=RSS&at_campaign=rss",
    "thumbnail": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/1363/live/15ab7ff0-caf3-11f0-84e9-a9bb2f1691c9.jpg",
    "pubDate": "2025-11-26T18:08:32+00:00"
  },
  {
    "title": "Bitcoin Retakes $90K in Break From Typical Pre-Thanksgiving Price Action",
    "description": "Just when traders got used to price declines on the Wednesday ahead of Turkey Day, bitcoin pulled a reversal higher.",
    "link": "https://www.coindesk.com/markets/2025/11/26/bitcoin-re-takes-usd90k-in-break-from-typical-pre-thanksgiving-price-action",
    "thumbnail": "",
    "pubDate": "2025-11-26T18:06:50+00:00"
  },
  {
    "title": "XLM Edges Higher 2.6% to $0.25 as U.S. Bank Tests Stablecoin Pilot",
    "description": "Major banking institution selects XLM network for programmable digital currency pilot program",
    "link": "https://www.coindesk.com/markets/2025/11/26/xlm-edges-higher-2-6-to-usd0-25-as-u-s-bank-tests-stablecoin-pilot",
    "thumbnail": "",
    "pubDate": "2025-11-26T18:03:45+00:00"
  },
  {
    "title": "Hedera Jumps 1% Breaking Through $0.143 Resistance",
    "description": "Institutional accumulation drives HBAR above key technical levels as futures launch approaches.",
    "link": "https://www.coindesk.com/markets/2025/11/26/hedera-jumps-1-breaking-through-usd0-143-resistance",
    "thumbnail": "",
    "pubDate": "2025-11-26T17:51:04+00:00"
  },
  {
    "title": "'Zootopia 2,' 'Wicked: For Good' lead Thanksgiving box office",
    "description": "Disney's \"Zootopia 2\" and Universal's \"Wicked: For Good\" are set for strong Thanksgiving box office haul, but not as big as 2024's record-breaking tally.",
    "link": "https://www.cnbc.com/2025/11/26/thanksgiving-box-office-zootopia-2-wicked-for-good.html",
    "thumbnail": "https://image.cnbcfm.com/api/v1/image/108232613-1764176601111-g_studio_zootopia2_02_still_7b4ea150_Cropped.jpg?v=1764176670&w=1920&h=1080",
    "pubDate": "2025-11-26T17:50:45+00:00"
  },
  {
    "title": "For Spouses of U.S. Citizens, Green Card Interviews End in Handcuffs",
    "description": "Agents are arresting foreign-born spouses when they report for the final step to obtain permanent residency, and charging them with visa violations that could result in deportation.",
    "link": "https://www.nytimes.com/2025/11/26/us/trump-green-card-interview-arrests.html",
    "thumbnail": "https://static01.nyt.com/images/2025/11/26/multimedia/26nat-immig-spouses-stephen-jfvm/26nat-immig-spouses-stephen-jfvm-facebookJumbo.jpg",
    "pubDate": "2025-11-26T17:44:23+00:00"
  },
  {
    "title": "DeFi’s $55B Plunge Isn’t the Disaster It Looks Like",
    "description": "Despite a sharp $55 billion decline in total value locked since October, the DeFi sector remains structurally strong, with rising DEX activity and steadily growing protocol fundamentals.",
    "link": "https://www.coindesk.com/business/2025/11/26/defi-s-usd55b-plunge-isn-t-the-disaster-it-looks-like",
    "thumbnail": "",
    "pubDate": "2025-11-26T17:38:13+00:00"
  },
  {
    "title": "MIT study finds AI can already replace 11.7% of U.S. workforce",
    "description": "Artificial intelligence can already replace 11.7% of the U.S. labor market, across finance, health care and professional services, according to MIT's study.",
    "link": "https://www.cnbc.com/2025/11/26/mit-study-finds-ai-can-already-replace-11point7percent-of-us-workforce.html",
    "thumbnail": "https://image.cnbcfm.com/api/v1/image/108232119-1764112994142-gettyimages-2209860667-AFP_42FT68T.jpeg?v=1764166052&w=1920&h=1080",
    "pubDate": "2025-11-26T17:16:54+00:00"
  },
  {
    "title": "Where peace stands in Ukraine after frantic diplomacy",
    "description": "The Trump administration seems serious about reaching a deal despite all the apparent chaos around its efforts.",
    "link": "https://www.bbc.com/news/articles/cly0jjv2lg1o?at_medium=RSS&at_campaign=rss",
    "thumbnail": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/1404/live/03863ee0-cae0-11f0-995e-fb191683181c.jpg",
    "pubDate": "2025-11-26T15:29:13+00:00"
  },
  {
    "title": "Apple iPhone shipments to beat Samsung for the first time in 14 years, report says",
    "description": "Apple's success is being driven by its iPhone 17 series launched in September.",
    "link": "https://www.cnbc.com/2025/11/26/apple-iphone-shipments-to-beat-samsung-for-the-first-time-in-14-years.html",
    "thumbnail": "https://image.cnbcfm.com/api/v1/image/108196778-1757507590799-gettyimages-2234563479-_73a3022_jnkqswz6.jpeg?v=1764165696&w=1920&h=1080",
    "pubDate": "2025-11-26T14:39:06+00:00"
  },
  {
    "title": "‘Rush Hour 4’ revived after Trump urged Paramount Skydance to resurrect franchise: Reports",
    "description": "Studios earlier declined a fourth \"Rush Hour\" over concerns about director Brett Ratner, whose career crashed after sexual misconduct allegations he denies.",
    "link": "https://www.cnbc.com/2025/11/25/trump-pushed-paramount-revive-rush-hour-4-reports-say.html",
    "thumbnail": "https://image.cnbcfm.com/api/v1/image/108231981-1764100830002-gettyimages-75880729-14590923.jpeg?v=1764100906&w=1920&h=1080",
    "pubDate": "2025-11-26T02:33:04+00:00"
  },
  {
    "title": "The Best Holiday Gift Is Something You Can Eat",
    "description": "In her holiday letter, Editor in chief Jamila Robinson celebrates how food brings us together.",
    "link": "https://www.bonappetit.com/story/the-best-holiday-gift-is-something-you-can-eat",
    "thumbnail": "https://assets.bonappetit.com/photos/691642acc38ab47f0c2f9236/master/pass/BA1225edletter01.jpg",
    "pubDate": "2025-11-25T21:00:00+00:00"
  },
  {
    "title": "November Snack Drop: 7 Best New Snacks We Tried This Month",
    "description": "Like truffle-laced hummus, fruity fiber bars, and gooey s'mores cookies.",
    "link": "https://www.bonappetit.com/story/snack-drop-november-2025",
    "thumbnail": "https://assets.bonappetit.com/photos/6924d8db5a0e8913fa05197d/master/pass/1125_SnackDrop.gif",
    "pubDate": "2025-11-25T19:10:53+00:00"
  },
  {
    "title": "The Best Black Friday Meal Kit Deals Offer Deep Discounts for Months (2025)",
    "description": "Per serving prices are as low as $4—that's less than a fast-food burger.",
    "link": "https://www.bonappetit.com/story/meal-kit-delivery-service-deals-black-friday-11-25-2025",
    "thumbnail": "https://assets.bonappetit.com/photos/6926188e098dad7a393df8fb/master/pass/11.25_BA_Black%20Friday%20Meal%20Kit%20Deals_v4.jpg",
    "pubDate": "2025-11-25T18:53:24+00:00"
  },
  {
    "title": "The Best Table Linens, Curated for a Variety of Vibes and Tastes",
    "description": "For every personality and taste, there is a piece of fabric that suits it.",
    "link": "https://www.bonappetit.com/story/best-table-linens",
    "thumbnail": "https://assets.bonappetit.com/photos/69247b6110b225e5f9391443/master/pass/11.17_ba_table_linens_with_personality__best_table_linens_.jpg",
    "pubDate": "2025-11-25T16:53:40+00:00"
  },
  {
    "title": "Kohl’s Stock Soars 26% After Earnings. Yes, Kohl’s.",
    "description": "",
    "link": "https://www.barrons.com/articles/kohls-earnings-stock-price-8b7bdf61?siteid=yhoof2&yptr=yahoo",
    "thumbnail": "",
    "pubDate": "2025-11-25T15:03:00+00:00"
  },
  {
    "title": "As China’s Economy Slows, Make This 1 Commodity Trade ASAP",
    "description": "",
    "link": "https://finance.yahoo.com/news/china-economy-slows-1-commodity-150221336.html",
    "thumbnail": "https://s.yimg.com/ny/api/res/1.2/NvIA4M0n3M1eNu748rLPOQ--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyMDA7aD03MTc-/https://media.zenfs.com/en/barchart_com_477/6816447cfbd4402b590d63b47a8670a5",
    "pubDate": "2025-11-25T15:02:21+00:00"
  },
  {
    "title": "Nvidia’s CEO says it’s ‘insane’ to not use AI for every task possible: ‘I promise you, you will have work to do’",
    "description": "",
    "link": "https://finance.yahoo.com/news/nvidia-ceo-says-insane-not-150107180.html",
    "thumbnail": "https://s.yimg.com/ny/api/res/1.2/Dt9MbbPisbrTIU8YtOpeVg--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyMDA7aD04MDA-/https://media.zenfs.com/en/fortune_175/cfb24e8d84d235368ab036a2fddc2fdf",
    "pubDate": "2025-11-25T15:01:07+00:00"
  },
  {
    "title": "Centrus Energy price target lowered to $285 from $340 at BofA",
    "description": "",
    "link": "https://finance.yahoo.com/news/centrus-energy-price-target-lowered-150104672.html",
    "thumbnail": "https://media.zenfs.com/en/tipranks_452/da3bf718e5fc2e4f4f20c2e48e9448e8",
    "pubDate": "2025-11-25T15:01:04+00:00"
  },
  {
    "title": "The Stock Market Is Struggling. Blame Nvidia, Crypto Stocks.",
    "description": "",
    "link": "https://www.barrons.com/livecoverage/stock-market-news-today-112525/card/the-stock-market-is-struggling-blame-nvidia-crypto-stocks--W5TLuXEWmV9HkSEsz9Al?siteid=yhoof2&yptr=yahoo",
    "thumbnail": "https://images.barrons.com/im-783602/social",
    "pubDate": "2025-11-25T15:00:12+00:00"
  },
  {
    "title": "J.M. Smucker Says Coffee Price Hike Not in Cards Amid Tariff Relief",
    "description": "",
    "link": "https://www.wsj.com/business/earnings/j-m-smucker-narrows-fy-guidance-as-profit-revenue-rise-ee5ab6ae?siteid=yhoof2&yptr=yahoo",
    "thumbnail": "",
    "pubDate": "2025-11-25T15:00:00+00:00"
  },
  {
    "title": "Why Trump’s Tariffs Hurt Drillers More Than Refiners",
    "description": "",
    "link": "https://finance.yahoo.com/news/why-trump-tariffs-hurt-drillers-150000712.html",
    "thumbnail": "https://media.zenfs.com/en/oilprice.com/019a9b8f91bdb4f55ee58c29477c0d6e",
    "pubDate": "2025-11-25T15:00:00+00:00"
  },
  {
    "title": "The Best Vitamix Black Friday Deals (2025)",
    "description": "Get up to $200 off a whole range equipment from the maker of the best blenders in the world.",
    "link": "https://www.bonappetit.com/story/vitamix-black-friday-deals-11-25-2025",
    "thumbnail": "https://assets.bonappetit.com/photos/6924bd60ca859795269b4e11/master/pass/11.20_BA_Vitamix%20black%20friday%20deals_v3.jpg",
    "pubDate": "2025-11-25T14:02:00+00:00"
  },
  {
    "title": "The Whole Foods Buyer Who Decides What We Eat",
    "description": "John Lawson has a knack for spotting talent in the packaged food world. Here’s how he decides what makes it to our grocery store shelves.",
    "link": "https://www.bonappetit.com/story/grocery-whole-foods-buyer",
    "thumbnail": "https://assets.bonappetit.com/photos/6913514b8f7360abea7d8f3d/master/pass/5R2A9322.jpg",
    "pubDate": "2025-11-25T11:00:00+00:00"
  },
  {
    "title": "Inside Tam Pham and Harrison Ramhofer's Home Kitchen",
    "description": "Tam Pham and Harrison Ramhofer invite us into their newly rennovated space.",
    "link": "https://www.bonappetit.com/story/chef-somm-home-kitchen-tools",
    "thumbnail": "https://assets.bonappetit.com/photos/68efda37460fa7c6b26df143/master/pass/Bon_Appetit_TT_AD_SHOT_01_0430.jpg",
    "pubDate": "2025-11-25T11:00:00+00:00"
  },
  {
    "title": "Keysight beats quarterly forecast estimates on strong demand from AI data centers",
    "description": "",
    "link": "https://finance.yahoo.com/news/keysight-beats-quarterly-forecast-estimates-222232807.html",
    "thumbnail": "https://s.yimg.com/ny/api/res/1.2/zBKuoD1q7kh7egHfmgfs3A--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyMDA7aD04MDA-/https://s.yimg.com/os/creatr-uploaded-images/2025-11/a65c1800-c9f1-11f0-8db7-d6eb4013fd97",
    "pubDate": "2025-11-24T22:22:32+00:00"
  },
  {
    "title": "Zoom lifts annual outlook on growing demand for AI tools in hybrid work",
    "description": "",
    "link": "https://finance.yahoo.com/news/zoom-communications-lifts-annual-outlook-214115167.html",
    "thumbnail": "https://media.zenfs.com/en/reuters-finance.com/32e92f77840e5ea55e5f98d34b028eb0",
    "pubDate": "2025-11-24T21:41:15+00:00"
  }
]