[
  {
    "title": "PlayStation holiday sale has great deals on PS4 and PS5 games",
    "description": "Now is the time to grow your PlayStation backlog even more as some of 2025's best games are on sale.",
    "link": "https://www.polygon.com/playstation-holiday-sale-2025-ps4-ps5-deals/",
    "thumbnail": "https://static0.polygonimages.com/wordpress/wp-content/uploads/2025/04/clair-obscur-expedition-33-trailer-screenshot.jpg?w=1600&h=900&fit=crop",
    "pubDate": "2025-12-22T21:03:20+00:00"
  },
  {
    "title": "Trump Halts Five Wind Farms Off the East Coast",
    "description": "The Interior Department said the projects posed national security risks, without providing details. The decision imperils billions of dollars of investments.",
    "link": "https://www.nytimes.com/2025/12/22/climate/trump-offshore-wind-farms.html",
    "thumbnail": "https://static01.nyt.com/images/2025/09/26/multimedia/22cli-offshore-wind/22cli-offshore-wind-facebookJumbo.jpg",
    "pubDate": "2025-12-22T20:58:55+00:00"
  },
  {
    "title": "Strategy boosts USD reserve with $748M stock sale, skips Bitcoin purchases",
    "description": "The company sold about 4.5 million common shares last week, lifting its cash reserves to $2.19 billion while pausing Bitcoin purchases.",
    "link": "https://cointelegraph.com/news/strategy-usd-reserve-748m-stock-sale-bitcoin?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
    "thumbnail": "https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjUtMTIvMDE5YjQ2YzYtMDUyMC03MjRhLWI1MzMtMzFhMmY5NTgzNDFjLmpwZw==.jpg",
    "pubDate": "2025-12-22T20:47:12+00:00"
  },
  {
    "title": "Bitcoin slips below $88,000 as traders brace for $28.5 billion Deribit options expiry",
    "description": "Crypto continues to lose ground ahead of this week's record options expiration, while defensive positioning and thinning liquidity suggest caution into 2026.",
    "link": "https://www.coindesk.com/markets/2025/12/22/crypto-markets-slip-further-as-traders-brace-for-usd28-5b-deribit-expiry",
    "thumbnail": "https://cdn.sanity.io/images/s3y3vcno/production/9607a8fc93aea488d2954cf166c47cb86450f649-1920x1080.jpg?auto=format&w=960&h=540&crop=focalpoint&fit=clip&q=75&fm=jpg",
    "pubDate": "2025-12-22T20:46:42+00:00"
  },
  {
    "title": "Call Of Duty Is Finally Coming To Switch Soon - Report",
    "description": "Microsoft has said it's committed to bringing Call of Duty to Nintendo Switch, and it could be coming as soon as next year. Reporter Jez Corden said \"the first CoD Switch version is nearly done.\" He added that the game, whatever it is, will launch \"in a few months.\" In another post, Corden said the release may not be \"close\" but it's \"on the way\" for a 2026 release. He added that the game is \"hitting milestones,\" which is a reference to how a game is proceeding through development. Continue Reading at GameSpot",
    "link": "https://www.gamespot.com/articles/call-of-duty-is-finally-coming-to-switch-soon-report/1100-6537145/?ftag=CAD-01-10abi2f",
    "thumbnail": "https://www.gamespot.com/a/uploads/screen_kubrick/1179/11799911/4627288-screenshot2025-12-22at2.56.15%E2%80%AFpm.png",
    "pubDate": "2025-12-22T20:43:00+00:00"
  },
  {
    "title": "Deadly clashes break out in Aleppo between Syrian army, Kurdish-led SDF",
    "description": "At least two people have been killed in clashes between government forces and the Kurdish-led Syrian Democratic Forces.",
    "link": "https://www.aljazeera.com/video/newsfeed/2025/12/22/deadly-clashes-break-out-in-aleppo-between-syrian-army-kurdish-led-sdf?traffic_source=rss",
    "thumbnail": "https://www.aljazeera.com/wp-content/uploads/2025/12/image-1766436073.jpg?resize=1920%2C1080&quality=80",
    "pubDate": "2025-12-22T20:41:54+00:00"
  },
  {
    "title": "Expedition 33 Studio Won't Scale Up For Next Project, Even Though It Can",
    "description": "Clair Obscur: Expedition 33 was one of 2025's biggest breakout hits, and the game's commercial success has afforded developer Sandfall Interactive the opportunity to scale up for its next project. However, the company is not going to do that--and for what sounds like a good reason. Speaking to Edge, studio boss Guillaume Broche said he does not feel tempted to grow the company in the wake of the success of Expedition 33, which was the studio's debut title. Why not? He said (via GI.biz), \"I think it's good to have limitations when you are creative.\" \"It's the best way to be the best version of yourself. We could scale up now we have a lot more money, but I would say it's not tempting for us, because even the management team and myself, we'd have to be hands-on and doing things for ourselves,\" he said. \"We love making games more than we love managing, so we want to keep doing that. These past five years were some of the best of my life, and I want to be happy like that again.\" Continue Reading at GameSpot",
    "link": "https://www.gamespot.com/articles/expedition-33-studio-wont-scale-up-for-next-project-even-though-it-can/1100-6537141/?ftag=CAD-01-10abi2f",
    "thumbnail": "https://www.gamespot.com/a/uploads/screen_kubrick/1179/11799911/4627278-e33.jpg",
    "pubDate": "2025-12-22T20:41:00+00:00"
  },
  {
    "title": "Call of Duty creator Vince Zampella killed in car crash",
    "description": "Vince Zampella, founder of Infinity Ward and Respawn Entertainment, is dead at 55, ending a nearly 30-year video game development career.",
    "link": "https://www.polygon.com/respawn-vince-zampella-death-call-of-duty-battlefield-ea/",
    "thumbnail": "https://static0.polygonimages.com/wordpress/wp-content/uploads/2025/12/vince_zampella.jpg?w=1600&h=900&fit=crop",
    "pubDate": "2025-12-22T20:33:35+00:00"
  },
  {
    "title": "Ugandan police tear gas crowd at Bobi Wine campaign event",
    "description": "Footage shows police dispersing crowds with tear gas at rallies for Ugandan presidential candidate Bobi Wine in Kampala.",
    "link": "https://www.aljazeera.com/video/newsfeed/2025/12/22/ugandan-police-tear-gas-crowd-at-bobi-wine-campaign-event?traffic_source=rss",
    "thumbnail": "https://www.aljazeera.com/wp-content/uploads/2025/12/image-1766435532.jpg?resize=1722%2C1080&quality=80",
    "pubDate": "2025-12-22T20:32:35+00:00"
  },
  {
    "title": "Why Anaconda's director made a reboot: 'There was no room for fun anymore'",
    "description": "Tom Gormican pokes fun at Hollywood reboots and conscious horror in his meta-remake of the 1997 cult classic, Anaconda.",
    "link": "https://www.polygon.com/anaconda-2025-director-interview/",
    "thumbnail": "https://static0.polygonimages.com/wordpress/wp-content/uploads/2025/12/mcdanac_co019.jpg?w=1600&h=900&fit=crop",
    "pubDate": "2025-12-22T20:30:15+00:00"
  },
  {
    "title": "Clair Obscur: Expedition 33 Amazon-Exclusive Steelbook Edition Is Back In Stock",
    "description": "Clair Obscur: Expedition 33 - Mirror Edition for PS5 / Xbox $60 | Amazon Exclusive See at Amazon Amazon has restocked its exclusive collectible edition of Clair Obscur: Expedition 33 for PS5 and Xbox Series X. Released earlier this month, the Mirror Edition includes a physical copy of the recently crowned GOTY at The Game Awards as well as a new steelbook case, three collectible art cards, and an oversized display box with new artwork. PlayStation 5 physical editions of Clair Obscur have been more challenging to find than the Xbox version. Amazon's new $60 Mirror Edition is actually the only PlayStation 5 physical edition in stock as of December 22. The PS5 standard edition is \"temporarily out of stock\" at Amazon, though you can still place an order. That said, Amazon is charging $60 for the standard edition--$10 higher than the original $50 MSRP--and the same price as the Mirror Edition. Every other major retailer is sold out of the standard edition for PS5, and GameStop's reprint of its exclusive $70 Lumiere Edition is out of stock, too. The standard edition for Xbox is $50 and in stock at multiple major retailers, and Steam keys are discounted to only $36 at GameSpot sister site Fanatical. Clair Obscur: Expedition 33 Editions Amazon-Exclusive Mirror Edition PS5 -- $60 Xbox -- $60 Standard Edition PS5 -- $60 Xbox -- $50 GameStop-Exclusive Lumiere Edition PS5 -- $70 | Sold out Steam keys at Fanatical Standard Edition -- $36 ($50) Digital Deluxe Edition -- $43.19 ($60) Clair Obscur: Expedition 33 - Mirror EditionSandfall Interactive's debut game turned out to be a much bigger hit than anyone could have expected. In fact, it currently holds a 92 on Metacritic from reviewers--including a 9/10 from GameSpot--and a 9.6/10 user score. Along with winning Game of the Year at this year's Game Awards, Clair Obscur won GameSpot's GOTY award. Continue Reading at GameSpot",
    "link": "https://www.gamespot.com/articles/clair-obscur-expedition-33-amazon-exclusive-mirror-edition-ps5-xbox-series-x/1100-6528999/?ftag=CAD-01-10abi2f",
    "thumbnail": "https://www.gamespot.com/a/uploads/screen_kubrick/1595/15950357/4627291-exp33mirroredition.jpg",
    "pubDate": "2025-12-22T20:21:00+00:00"
  },
  {
    "title": "Two men jailed for Grindr targeted thefts",
    "description": "The two men took cash, phones and passwords after arranging to meet their targets at home.",
    "link": "https://www.bbc.com/news/articles/cqlkx2z4zgwo?at_medium=RSS&at_campaign=rss",
    "thumbnail": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/e620/live/229ca850-df5d-11f0-b67b-690eb873de1b.jpg",
    "pubDate": "2025-12-22T20:20:07+00:00"
  },
  {
    "title": "Steam user asks devs to fix game, gets blasted for pirating it",
    "description": "One bold Farthest Frontier fan thought they could complain about the city builder to Crate Entertainment, only to be met with a harsh reality",
    "link": "https://www.polygon.com/steam-game-piracy-farthest-frontier-city-builder-fan/",
    "thumbnail": "https://static0.polygonimages.com/wordpress/wp-content/uploads/2025/12/farthest_frontier_key_art_1080px.jpg?w=1600&h=900&fit=crop",
    "pubDate": "2025-12-22T20:00:14+00:00"
  },
  {
    "title": "CoD, Battlefield Boss Vince Zampella Dies In Car Crash",
    "description": "Vince Zampella, the co-founder of Infinity Ward and one of the leading figures behind the first Call of Duty game, has passed away. Zampella was reportedly in a single-car accident on Sunday, December 21 in the San Gabriel Mountains when the vehicle went off the road and hit a concrete barrier. According to NBC4 Los Angeles, the driver of the vehicle perished in a car fire while the passenger was ejected and died at the hospital. The report didn't share any further specifics about the incident. Zampella got his start in the video game industry in the late '90s with stints at GameTek, Atari, Interactive Media/Ripcord Games, and SegaSoft. In 1999, he joined 2015 Inc and became the lead designer of the third Medal of Honor game, Medal of Honor: Allied Assault, which was published by EA. Continue Reading at GameSpot",
    "link": "https://www.gamespot.com/articles/cod-battlefield-boss-vince-zampella-dies-in-car-crash/1100-6537144/?ftag=CAD-01-10abi2f",
    "thumbnail": "https://www.gamespot.com/a/uploads/screen_kubrick/1837/18375603/4627287-vincezampella.jpg",
    "pubDate": "2025-12-22T20:00:00+00:00"
  },
  {
    "title": "130 Nigerian schoolchildren freed after mass abduction",
    "description": "A group of 130 Nigerian schoolchildren abducted last month were freed, ending a mass abduction that drew global concern.",
    "link": "https://www.aljazeera.com/video/newsfeed/2025/12/22/130-nigerian-schoolchildren-freed-after-mass-abduction?traffic_source=rss",
    "thumbnail": "https://www.aljazeera.com/wp-content/uploads/2025/12/image-1766433183.jpg?resize=1440%2C1080&quality=80",
    "pubDate": "2025-12-22T19:53:29+00:00"
  },
  {
    "title": "Third Palestine Action hunger striker on remand ends protest",
    "description": "A third individual on remand for alleged offences relating to the Palestine Action group has ended a hunger strike after 49 days.",
    "link": "https://www.bbc.com/news/articles/c93n592320do?at_medium=RSS&at_campaign=rss",
    "thumbnail": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/e7e6/live/5ec84f60-df57-11f0-a7ad-b72dffdf9dfd.jpg",
    "pubDate": "2025-12-22T19:48:31+00:00"
  },
  {
    "title": "This Popular Game Is Having Its Servers Shut Off Soon, Will Also Be Delisted",
    "description": "2K Sports has confirmed that WWE 2K24 will be delisted as of January 31, 2026, with servers shutting down on March 31, 2026. This information was disclosed on the game's Steam page, but also applies to the console editions. Once the servers go dark, \"all game functions requiring online servers will no longer function.\" 2K Sports actually first confirmed the server shutdown on December 8, but it wasn't widely reported on until more recently. The game's offline modes like Play Now and Showcase will remain available after the servers go dark. Continue Reading at GameSpot",
    "link": "https://www.gamespot.com/articles/this-popular-game-is-having-its-servers-shut-off-soon-will-also-be-delisted/1100-6537143/?ftag=CAD-01-10abi2f",
    "thumbnail": "https://www.gamespot.com/a/uploads/screen_kubrick/1179/11799911/4627285-2k.jpg",
    "pubDate": "2025-12-22T19:45:00+00:00"
  },
  {
    "title": "Epstein Files: Schumer to force Senate vote on suing DOJ over partial release",
    "description": "President Donald Trump signed a law compelling the full release of the Jeffrey Epstein files. But the DOJ has released just a fraction.",
    "link": "https://www.cnbc.com/2025/12/22/epstein-files-doj-schumer-trump-democrats.html",
    "thumbnail": "https://image.cnbcfm.com/api/v1/image/108244757-1766419957113-gettyimages-2252543897-senate_dems_1_123_121725.jpeg?v=1766431688&w=1920&h=1080",
    "pubDate": "2025-12-22T19:42:15+00:00"
  },
  {
    "title": "Baby followed by BBC back in Gaza hospital after treatment abroad",
    "description": "The BBC revisits one-year-old Siwar Ashour who was temporarily evacuated to Jordan for medical treatment during the Gaza war.",
    "link": "https://www.bbc.com/news/articles/c2084n1pyvdo?at_medium=RSS&at_campaign=rss",
    "thumbnail": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/0ff0/live/bb237940-df4f-11f0-a8dc-93c15fe68710.jpg",
    "pubDate": "2025-12-22T19:38:10+00:00"
  },
  {
    "title": "Assad, Ousted Syrian Ruler, Leads Life of Luxury in Russia",
    "description": "Bashar al-Assad’s long, brutal reign ended swiftly, but he and his close circle have had a soft landing in Russia.",
    "link": "https://www.nytimes.com/2025/12/22/world/middleeast/assad-syria-exile-luxury.html",
    "thumbnail": "https://static01.nyt.com/images/2025/12/20/video/xxvi-assads-cover-square/xxvi-assads-cover-square-facebookJumbo.png",
    "pubDate": "2025-12-22T19:36:01+00:00"
  },
  {
    "title": "Ex-C.I.A. Chief Wants to Block Judge Cannon From Inquiry Pushed by Trump’s Allies",
    "description": "The request, addressed to the top federal judge in Miami, sought to block a U.S. attorney from pursuing a politically charged inquiry before Judge Aileen Cannon, who has repeatedly decided in President Trump’s favor.",
    "link": "https://www.nytimes.com/2025/12/22/us/politics/trump-doj-investigation-judge-cannon-brennan-cia.html",
    "thumbnail": "https://static01.nyt.com/images/2025/12/22/multimedia/22dc-brennan01-photo-qgzh/22dc-brennan01-photo-qgzh-facebookJumbo.jpg",
    "pubDate": "2025-12-22T19:31:45+00:00"
  },
  {
    "title": "Crypto laments loss of key ally on Capitol Hill after Lummis announces retirement",
    "description": "Sen. Cynthia Lummis’ retirement tees up a Republican primary in Wyoming, where the victor will be heavily favored in November.",
    "link": "https://www.cnbc.com/2025/12/22/crypto-lummis-retirement-key-ally-capitol-hill.html",
    "thumbnail": "https://image.cnbcfm.com/api/v1/image/107094109-16588539972022-07-26t164134z_1172648673_rc2rjv9s61hk_rtrmadp_0_usa-trump.jpeg?v=1766430525&w=1920&h=1080",
    "pubDate": "2025-12-22T19:25:15+00:00"
  },
  {
    "title": "Expedition 33's GOTY retraction signals a messy AI debate in 2026",
    "description": "The controversy around Clair Obscur's generative AI usage signals that a murky debate is only going to get messier in 2026.",
    "link": "https://www.polygon.com/clair-obscur-expedition-33-indie-game-awards-controvsery-gen-ai-explained/",
    "thumbnail": "https://static0.polygonimages.com/wordpress/wp-content/uploads/2025/04/clairobscur-fight.jpg?w=1600&h=900&fit=crop",
    "pubDate": "2025-12-22T19:24:06+00:00"
  },
  {
    "title": "Powerball's $1.6 billion jackpot is its fourth largest ever—here's the after-tax payout in every U.S. state",
    "description": "Powerball's jackpot has grown to the fourth largest ever in U.S. lottery history.",
    "link": "https://www.cnbc.com/2025/12/22/powerball-jackpot-after-tax-payout-by-state.html",
    "thumbnail": "https://image.cnbcfm.com/api/v1/image/108244804-1766423836612-gettyimages-2231384486-AFP_72FH6RW.jpeg?v=1766423904&w=1920&h=1080",
    "pubDate": "2025-12-22T19:08:29+00:00"
  },
  {
    "title": "Can diplomacy end the conflict between Thailand and Cambodia?",
    "description": "The neighbouring countries hold their first direct meeting in regional push for peace.",
    "link": "https://www.aljazeera.com/video/inside-story/2025/12/22/can-diplomacy-end-the-conflict-between-thailand-and-cambodia?traffic_source=rss",
    "thumbnail": "https://www.aljazeera.com/wp-content/uploads/2025/12/image-1766429300.jpg?resize=1920%2C1061&quality=80",
    "pubDate": "2025-12-22T19:04:35+00:00"
  },
  {
    "title": "30 years later, Mel Brooks' Dracula satire is still his weirdest misfire",
    "description": "Polygon looks back on Dracula: Dead and Loving It, a vampire spoof that probably should have stayed dead.",
    "link": "https://www.polygon.com/dracula-dead-and-loving-it-mel-brooks-worst-comedy-retropective/",
    "thumbnail": "https://static0.polygonimages.com/wordpress/wp-content/uploads/2025/12/dracula-header.jpg?w=1600&h=900&fit=crop",
    "pubDate": "2025-12-22T19:01:14+00:00"
  },
  {
    "title": "Blue Prince Didn't Use Any AI, Says Publisher",
    "description": "Over the weekend, The Indie Game Awards shook up its winner's circle by stripping Clair Obscur: Expedition 33 of its Game of the Year Award over the publisher's use of AI. In its place, indie-darling Blue Prince was declared the new Game of the Year winner. Now, publisher Raw Fury wants to make sure everyone knows that Blue Prince wasn't made with AI of any kind. In a statement released on X, Raw Fury credited Tonda Ros and his team for a game that \"was built and crafted with full human instinct ... It is the result of eight years of development [fueled] by imagination and creativity, and we are extremely proud of what Tonda has achieved.\" For people that need confirmation: There is no AI used in Blue Prince. The game was built and crafted with full human instinct by Tonda Ros @dogubomb &amp; his team. It is the result of eight years of development, fuelled by imagination and creativity, and we are extremely proud of… pic.twitter.com/zdbqp6xnKy — Raw Fury I ROUTINE IS OUT NOW (@RawFury) December 21, 2025 Blue Prince is a roguelike puzzle game that casts players as Simon P. Jones, a man who is set to inherit a mysterious mansion called the Mt. Holly Estate following the death of his great uncle Herbert S. Sinclair. There are 45 rooms known to be in the mansion, and Simon has to find the hidden 46th room in order to claim his inheritance. However, the layout of the mansion changes each night, and Simon largely has to start from scratch if he can't find it in time. Continue Reading at GameSpot",
    "link": "https://www.gamespot.com/articles/blue-prince-didnt-use-any-ai-says-publisher/1100-6537142/?ftag=CAD-01-10abi2f",
    "thumbnail": "https://www.gamespot.com/a/uploads/screen_kubrick/1837/18375603/4627272-blueprincefeatured.jpg",
    "pubDate": "2025-12-22T19:00:00+00:00"
  },
  {
    "title": "Trump halts wind projects, including Coastal Virginia Offshore Wind, Dominion stock drops 5%",
    "description": "Interior Secretary Doug Burgum said the administration paused the projects due to national security concerns identified by the Pentagon.",
    "link": "https://www.cnbc.com/2025/12/22/trump-offshore-wind-cvow-dominion.html",
    "thumbnail": "https://image.cnbcfm.com/api/v1/image/108244722-1766417176896-gettyimages-2227111307-US-NEWS-TRUMP-WIND-POWER-VP.jpeg?v=1766417215&w=1920&h=1080",
    "pubDate": "2025-12-22T18:56:29+00:00"
  },
  {
    "title": "Stone Roses star Mani's coffin carried by Liam Gallagher as hundreds attend funeral",
    "description": "Mani's coffin was carried out of Manchester Cathedral by Liam Gallagher and his Stone Roses bandmates.",
    "link": "https://www.bbc.com/news/articles/cr5zj532002o?at_medium=RSS&at_campaign=rss",
    "thumbnail": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/d1bf/live/603a3110-df66-11f0-aae2-2191c0e48a3b.jpg",
    "pubDate": "2025-12-22T18:46:14+00:00"
  },
  {
    "title": "Larry Ellison Personally Guarantees Paramount Bid for Warner Bros.",
    "description": "Mr. Ellison’s personal guarantee is meant to address concerns that the Warner Bros. Discovery’s board had expressed about Paramount’s original offer.",
    "link": "https://www.nytimes.com/2025/12/22/business/larry-ellison-paramount-warner-brothers-bid.html",
    "thumbnail": "https://static01.nyt.com/newsgraphics/images/icons/defaultPromoCrop.png",
    "pubDate": "2025-12-22T18:34:46+00:00"
  },
  {
    "title": "Post Office had deal with Fujitsu to fix Horizon errors 19 years ago",
    "description": "The emergence of a document contradicts claims made by the Post Office over bugs in its IT system during criminal prosecutions.",
    "link": "https://www.bbc.com/news/articles/cqlkx6n15ero?at_medium=RSS&at_campaign=rss",
    "thumbnail": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/0f8b/live/09562070-df5c-11f0-a8dc-93c15fe68710.jpg",
    "pubDate": "2025-12-22T18:25:38+00:00"
  },
  {
    "title": "David Sacks calls CFTC, SEC picks a crypto regulation ‘dream team‘",
    "description": "Following Michael Selig's confirmation, White House official David Sacks said the SEC and CFTC were set to offer \"clear regulatory guidelines\" for digital assets.",
    "link": "https://cointelegraph.com/news/david-sacks-cftc-sec-crypto-dream-team-regulation?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
    "thumbnail": "https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjUtMTIvMDE5YjMzNzYtMzNiMC03YjRjLWI3MDktZDg4MjdhMjEwYzhlLmpwZw==.jpg",
    "pubDate": "2025-12-22T18:19:07+00:00"
  },
  {
    "title": "Nintendo's holiday sale on Switch and Switch 2 games has some great deals",
    "description": "Switch and Switch 2 games are on sale in Nintendo's holiday hits sale, including Minecraft, Super Mario Odyssey, and Hades 2.",
    "link": "https://www.polygon.com/nintendo-switch-2-holiday-sale-games-discounts/",
    "thumbnail": "https://static0.polygonimages.com/wordpress/wp-content/uploads/2025/12/mario-christmas.jpg?w=1600&h=900&fit=crop",
    "pubDate": "2025-12-22T18:17:43+00:00"
  },
  {
    "title": "Canal boats swallowed by giant hole as major incident declared",
    "description": "Two boats have been left at the bottom of the cavity, where water has drained away.",
    "link": "https://www.bbc.com/news/articles/c2lvq0yk9dko?at_medium=RSS&at_campaign=rss",
    "thumbnail": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/4c0b/live/2acf9f80-df46-11f0-a8dc-93c15fe68710.jpg",
    "pubDate": "2025-12-22T18:14:50+00:00"
  },
  {
    "title": "Why Warner Bros. Discovery shareholders might opt for Paramount's offer — and why they might not",
    "description": "WBD shareholders must weigh pros and cons of tendering their shares to Paramount for $30 per share. CNBC lays out the arguments on both sides.",
    "link": "https://www.cnbc.com/2025/12/22/paramount-wbd-tender-offer-arguments.html",
    "thumbnail": "https://image.cnbcfm.com/api/v1/image/108244454-1766185236909-Side_by_Side_template.jpg?v=1766425031&w=1920&h=1080",
    "pubDate": "2025-12-22T18:09:08+00:00"
  },
  {
    "title": "UPS stumbles into holiday season amid shifting trade rules",
    "description": "After the end of the de minimis rule rewired US import requirements, UPS is struggling to clear shipments.",
    "link": "https://www.aljazeera.com/economy/2025/12/22/ups-stumbles-into-holiday-season-amid-shifting-trade-rules?traffic_source=rss",
    "thumbnail": "https://www.aljazeera.com/wp-content/uploads/2013/06/20136605855138734_20.jpeg?resize=1200%2C675",
    "pubDate": "2025-12-22T18:06:11+00:00"
  },
  {
    "title": "Two identical Banksy murals appear in London",
    "description": "Artist confirms mural near Notting Hill is his, after an identical one appeared in central London.",
    "link": "https://www.bbc.com/news/articles/c62d16q93x4o?at_medium=RSS&at_campaign=rss",
    "thumbnail": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/d60b/live/43113220-df55-11f0-b67b-690eb873de1b.jpg",
    "pubDate": "2025-12-22T18:05:04+00:00"
  },
  {
    "title": "Srebrenica: Genocide on Trial",
    "description": "The horrors of the Srebrenica genocide in Bosnia and Herzegovina and the war crimes trials that gave birth to the ICC.",
    "link": "https://www.aljazeera.com/video/featured-documentaries/2025/12/22/srebrenica-genocide-on-trial?traffic_source=rss",
    "thumbnail": "https://www.aljazeera.com/wp-content/uploads/2025/12/image-1766425537.jpg?resize=1920%2C1080&quality=80",
    "pubDate": "2025-12-22T18:00:00+00:00"
  },
  {
    "title": "Husband and five other men charged with sex offences against ex-wife",
    "description": "Philip Young is charged with offences including rape and administering a substance with intent to stupefy.",
    "link": "https://www.bbc.com/news/articles/c78vgm0e3zzo?at_medium=RSS&at_campaign=rss",
    "thumbnail": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/daa9/live/5d620bd0-df5b-11f0-a7ad-b72dffdf9dfd.jpg",
    "pubDate": "2025-12-22T17:58:28+00:00"
  },
  {
    "title": "Trump pauses more offshore wind projects citing national security concerns",
    "description": "The directive pausing five projects comes as the administration ramps up offshore oil and gas production.",
    "link": "https://www.aljazeera.com/economy/2025/12/22/trump-pauses-more-offshore-wind-projects-citing-national-security-concerns?traffic_source=rss",
    "thumbnail": "https://www.aljazeera.com/wp-content/uploads/2025/12/2025-12-22T151844Z_2046624838_RC2SXGAOZRS2_RTRMADP_3_USA-TRUMP-OFFSHORE-WIN-1766423696.jpg?resize=1920%2C1440",
    "pubDate": "2025-12-22T17:56:01+00:00"
  },
  {
    "title": "Crypto prices again muted as gold surges to new record, U.S. stocks advance",
    "description": "Bitcoin for the moment was unable to hold the $90,000 level reached prior to the U.S. market open.",
    "link": "https://www.coindesk.com/markets/2025/12/22/crypto-prices-again-muted-as-gold-surges-to-new-record-u-s-stocks-advance",
    "thumbnail": "https://cdn.sanity.io/images/s3y3vcno/production/3fefd4274e66ebe6fa9b269e9039d7f0e3e7896d-5000x3111.jpg?auto=format&w=960&h=540&crop=focalpoint&fit=clip&q=75&fm=jpg",
    "pubDate": "2025-12-22T17:45:30+00:00"
  },
  {
    "title": "Displacement camp running out of supplies for people fleeing Sudan’s war",
    "description": "Authorities say they don't have enough food, tents, and equipment to accommodate everyone fleeing Sudan’s war.",
    "link": "https://www.aljazeera.com/video/newsfeed/2025/12/22/displacement-camp-running-out-of-supplies-for-people-fleeing-sudans-war?traffic_source=rss",
    "thumbnail": "https://www.aljazeera.com/wp-content/uploads/2025/12/image-1766425450.jpg?resize=1920%2C1080&quality=80",
    "pubDate": "2025-12-22T17:45:16+00:00"
  },
  {
    "title": "The Great Flood is Netflix's newest K-brand top movie",
    "description": "The Great Flood is Netflix’s top movie thanks to its gripping sci-fi disaster plot, believable stakes, and shocking twist ending.",
    "link": "https://www.polygon.com/netflix-the-great-flood-korean-sci-fi-disaster-movie/",
    "thumbnail": "https://static0.polygonimages.com/wordpress/wp-content/uploads/2025/12/greatflood_firstlook_1.jpg?w=1600&h=900&fit=crop",
    "pubDate": "2025-12-22T17:40:36+00:00"
  },
  {
    "title": "After the Assad Regime’s Fall, His Enforcers Are Lying Low and Living Large",
    "description": "A Times investigation into the whereabouts of top Syrian officials who fled after the regime’s fall shows many remain free — shielded by wealth and accommodating host nations.",
    "link": "https://www.nytimes.com/2025/12/22/world/middleeast/assad-syria-enforcers-lives-now.html",
    "thumbnail": "https://static01.nyt.com/images/2025/12/20/video/xxvi-enforcers-HTLN-NEW/xxvi-enforcers-HTLN-NEW-facebookJumbo.png",
    "pubDate": "2025-12-22T17:40:24+00:00"
  },
  {
    "title": "Sudan’s Darfur grapples with severe measles outbreak amid ongoing violence",
    "description": "MSF official tells Al Jazeera South Darfur hospital 'overwhelmed' by rapid increase in measles cases.",
    "link": "https://www.aljazeera.com/news/2025/12/22/sudans-darfur-grapples-with-severe-measles-outbreak-amid-ongoing-violence?traffic_source=rss",
    "thumbnail": "https://www.aljazeera.com/wp-content/uploads/2025/12/reuters_6949669e-1766418078.jpg?resize=1920%2C1440",
    "pubDate": "2025-12-22T17:38:17+00:00"
  },
  {
    "title": "Arc Raiders Is My Game Of The Year, But Its Use Of Generative AI Really Sucks",
    "description": "These past two months with Arc Raiders have been the most fun I've had with games all year. It represents the most exciting and unpredictable multiplayer landscape I've jumped into since Sea of Thieves in 2018, which I consider my favorite game ever made. It's safe to say I really love Arc Raiders. But it's become difficult to fully espouse those feelings as we learn about Embark Studio's use of generative AI. According to the studio, Arc Raiders' voice acting was initially performed by humans, then used to \"train\" AI so that it could speak in the actors' voices while addressing any possible circumstance. For Embark, the team doesn't need to bring in the voice actors each time new content is added to the game. The AI voices learn to speak in the voices of the actors, which the actors are said to have agreed upon when they were hired, and the tools take it from there. Maybe it shouldn't have come as a surprise, since the team's previous game, The Finals, uses generative AI in a similar way. In an interview, Embark assured players that the game's visual artwork is entirely human-made, but admitted to using this text-to-speech training to bring voices to the game's shop NPCs, emotes, and other character barks. Knowing this has left me conflicted when I think to sing the game's praises. On one hand, I can't deny the hold Arc Raiders has taken over me. The heart wants what the heart wants, and Embark's extraction shooter, rich in emergent, player-driven drama, has lit my heart on fire in a way few games ever have. At the same time, I've already written my review. Though it was a glowing one that I don't regret, I also feel it's my job to call out this disappointing practice. In recent weeks, similar practices or plans have arisen in several high-profile examples. Larian Studios' boss vouched for it in some cases. Nexon's former CEO said AI is about to rewrite everything in the games industry. Ubisoft announced it's using an AI tool to help write its games in some instances. Even Hideo Kojima, often considered a unique voice in the industry, says he uses it at times. It's being presented as not just helpful, but inevitable. Continue Reading at GameSpot",
    "link": "https://www.gamespot.com/articles/arc-raiders-is-my-game-of-the-year-but-its-use-of-generative-ai-really-sucks/1100-6537140/?ftag=CAD-01-10abi2f",
    "thumbnail": "https://www.gamespot.com/a/uploads/screen_kubrick/1632/16320660/4593114-arcraiders_16-9_03.jpg",
    "pubDate": "2025-12-22T17:35:00+00:00"
  },
  {
    "title": "Turning Point USA held its AmericaFest conference. Here’s what happened",
    "description": "Turning Point USA's first AmericaFest without Charlie Kirk reveals ideological rifts within the conservative movement.",
    "link": "https://www.aljazeera.com/news/2025/12/22/turning-point-usa-held-its-americafest-conference-heres-what-happened?traffic_source=rss",
    "thumbnail": "https://www.aljazeera.com/wp-content/uploads/2025/12/afp_69491938cca1-1766398264.jpg?resize=1920%2C1440",
    "pubDate": "2025-12-22T17:32:46+00:00"
  },
  {
    "title": "BNB at $860 lags broader market as scrutiny of Binance grows",
    "description": "An FT report alleged Binance failed to stop suspicious transactions, despite agreeing to pay $4.3 billion to settle a U.S. criminal case in 2023.",
    "link": "https://www.coindesk.com/markets/2025/12/22/bnb-lags-market-despite-break-above-usd860-as-scrutiny-of-binance-grows",
    "thumbnail": "https://cdn.sanity.io/images/s3y3vcno/production/56d1830a3eb04636993db4e0ff7b1a283fe9ba88-700x430.png?auto=format&w=960&h=540&crop=focalpoint&fit=clip&q=75&fm=jpg",
    "pubDate": "2025-12-22T17:32:33+00:00"
  },
  {
    "title": "How US banks are quietly preparing for an onchain future",
    "description": "Behind the scenes, US banks are rebuilding core financial infrastructure so cash, custody and funds can move onchain under regulatory oversight.",
    "link": "https://cointelegraph.com/news/how-us-banks-are-quietly-preparing-for-an-onchain-future?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
    "thumbnail": "https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjUtMDgvMDE5OGFhYzUtMTA4Ni03YTc2LThhNGYtZTFjZTkxYTI5MjY2.jpg",
    "pubDate": "2025-12-22T17:24:10+00:00"
  },
  {
    "title": "Alphabet to acquire data center and energy infrastructure company Intersect",
    "description": "Alphabet said the acquisition will help bring more data center and generation capacity online faster.",
    "link": "https://www.cnbc.com/2025/12/22/alphabet-to-acquire-intersect.html",
    "thumbnail": "https://image.cnbcfm.com/api/v1/image/108226430-1763156552157-gettyimages-2246165387-7texasgov.jpeg?v=1763156676&w=1920&h=1080",
    "pubDate": "2025-12-22T17:20:36+00:00"
  },
  {
    "title": "More Tomb Raider Ports May Be Coming To Switch 2",
    "description": "Last month, Aspyr shadow-dropped the Switch and Switch 2 versions of Tomb Raider: Definitive Edition, the 2013 reboot that kicked off a new era for Lara Croft. According to Aspyr, the response has been so strong that more Tomb Raider games may make the leap to Switch 2. Aspyr product manager Jordon Reese was recently asked by Nintendo Everything about the possibility of the other Survivor trilogy games--Rise of the Tomb Raider and Shadow of the Tomb Raider--coming to Switch 2. Reese didn't directly confirm those titles, but he also seemed to leave the door open for them. \"We've successfully brought back the classic era [Tomb Raider 1-6] and now the origin story of Lara Croft to modern Nintendo platforms,\" said Reese. \"We can't announce anything at the moment, but the passionate response to this release is strong encouragement for us to continue exploring those possibilities.\" Continue Reading at GameSpot",
    "link": "https://www.gamespot.com/articles/more-tomb-raider-ports-may-be-coming-to-switch-2/1100-6537139/?ftag=CAD-01-10abi2f",
    "thumbnail": "https://www.gamespot.com/a/uploads/screen_kubrick/1837/18375603/4627213-shadowofthetombraider.jpg",
    "pubDate": "2025-12-22T17:16:00+00:00"
  },
  {
    "title": "Best attributes to level up in Clair Obscur Expedition 33",
    "description": "Attributes determine the stats of party members in Clair Obscur: Expedition 33. Here are the best attributes to level up in Clair Obscur: Expedition 33.",
    "link": "https://www.polygon.com/clair-obscur-expedition-33-guides/562119/attributes-best-all/",
    "thumbnail": "https://static0.polygonimages.com/wordpress/wp-content/uploads/2025/04/maelle-expedition-33.jpeg?w=1600&h=900&fit=crop",
    "pubDate": "2025-12-22T17:15:49+00:00"
  },
  {
    "title": "Jim Beam Halts Production at Flagship Distillery as Whiskey and Bourbon Markets Struggle",
    "description": "The bourbon giant is closing its flagship distilling operation for all of 2026.",
    "link": "https://www.nytimes.com/2025/12/22/dining/jim-beam-production-pause-whiskey-bourbon.html",
    "thumbnail": "https://static01.nyt.com/images/2025/12/22/multimedia/JIM-BEAM-05-hzgv/JIM-BEAM-05-hzgv-facebookJumbo.jpg",
    "pubDate": "2025-12-22T17:15:12+00:00"
  },
  {
    "title": "Tokenized US Treasurys surge 50x since 2024, marking shift toward on-chain finance",
    "description": "From niche experiment to $7 billion market, tokenized US Treasurys are quietly becoming a major driver of institutional onchain yield.",
    "link": "https://cointelegraph.com/news/tokenized-us-treasurys-surge-50x-since-2024-onchain-finance?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
    "thumbnail": "https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjUtMTIvMDE5YjQ2YWYtOWM4MC03MzdlLThjYjUtODVjYzBhYTczZjE4LmpwZw==.jpg",
    "pubDate": "2025-12-22T17:08:59+00:00"
  },
  {
    "title": "The NBA is pursuing ownership groups for a potential basketball league in Europe",
    "description": "The NBA is exploring the launch of a new professional men’s league in Europe in partnership with FIBA.",
    "link": "https://www.cnbc.com/2025/12/22/nba-basketball-league-in-europe.html",
    "thumbnail": "https://image.cnbcfm.com/api/v1/image/108244702-1766415162574-gettyimages-2245059149-OPED-NBA-GAMBLING-EDITORIAL-LV.jpeg?v=1766420906&w=1920&h=1080",
    "pubDate": "2025-12-22T17:08:38+00:00"
  },
  {
    "title": "Driving Home for Christmas singer Chris Rea dies aged 74",
    "description": "The singer died in hospital on Monday following a short illness, his family said in a statement.",
    "link": "https://www.bbc.com/news/articles/c8r3ne23e4go?at_medium=RSS&at_campaign=rss",
    "thumbnail": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/2ced/live/65224300-df4f-11f0-aae2-2191c0e48a3b.jpg",
    "pubDate": "2025-12-22T17:07:09+00:00"
  },
  {
    "title": "Coinbase agrees to buy The Clearing Company to deepen prediction markets push",
    "description": "The deal brings a team with specialized experience building event-based trading systems, including veterans from Polymarket and Kalshi.",
    "link": "https://www.coindesk.com/business/2025/12/22/coinbase-agrees-to-buy-the-clearing-company-to-deepen-prediction-markets-push",
    "thumbnail": "https://cdn.sanity.io/images/s3y3vcno/production/2f3568ba988df704ac0fc97e2593677bdcbf178e-1920x1080.jpg?auto=format&w=960&h=540&crop=focalpoint&fit=clip&q=75&fm=jpg",
    "pubDate": "2025-12-22T17:01:27+00:00"
  },
  {
    "title": "The 10 best adventure games of 2025",
    "description": "2025 was a standout year for adventure games that pushed the boundaries of what the genre can be",
    "link": "https://www.polygon.com/best-adventure-games-2025/",
    "thumbnail": "https://static0.polygonimages.com/wordpress/wp-content/uploads/2025/12/best-adventure-games-2025.jpg?w=1600&h=900&fit=crop",
    "pubDate": "2025-12-22T17:00:15+00:00"
  },
  {
    "title": "Paramount guarantees Larry Ellison backing in amended WBD bid",
    "description": "Paramount notably did not increase its bid on Monday, reiterating that it believes the deal is superior to Netflix's.",
    "link": "https://www.cnbc.com/2025/12/22/wbd-bid-paramount-larry-ellison-backing-bid.html",
    "thumbnail": "https://image.cnbcfm.com/api/v1/image/108238516-1765220735445-gettyimages-1258470450-AFP_33H24HJ.jpeg?v=1765220758&w=1920&h=1080",
    "pubDate": "2025-12-22T16:55:18+00:00"
  },
  {
    "title": "ETHZilla sells $74.5 million of ether in effort to trim debt load",
    "description": "This is the company's second sale of part of its ETH treasury, following a $40 million sale in October to fund share repurchases.",
    "link": "https://www.coindesk.com/business/2025/12/22/ethzilla-sells-usd74-5-million-of-ether-in-effort-to-trim-debt-load",
    "thumbnail": "https://cdn.sanity.io/images/s3y3vcno/production/4853dd74c80fc2679cc738a259a38b305149f867-3840x2160.png?auto=format&w=960&h=540&crop=focalpoint&fit=clip&q=75&fm=jpg",
    "pubDate": "2025-12-22T16:53:44+00:00"
  },
  {
    "title": "Expedition 33 Actor Says The Game Awards Best Performance Award Doesn't Credit Everyone",
    "description": "The actor who provided the motion capture for Clair Obscur: Expedition 33's Gustave has spoken out to say it would be \"more logical\" to have a Best Character category at awards shows to help give credit to everyone who contributed to bringing a character to life in a game. The actor, Maxence Cazorla, is saying this against the backdrop of only one person, voice actor Charlie Cox, being nominated for Best Performance at The Game Awards for the role of Gustave. For what it's worth, Cox was open in acknowledging that Cazorla deserved credit, too, and Cazorla said Cox was kind to say that. Cox did not end up winning Best Performance, as it was Jennifer English as Maelle from Expedition 33 who took home the award. In any event, Cazorla told Eurogamer that he believes a \"Best Character category feels more logical\" than \"isolating a single performer and potentially leaving others invisible.\" Whether or not this is something that host and organizer Geoff Keighley is considering for next year's The Game Awards is unknown. Continue Reading at GameSpot",
    "link": "https://www.gamespot.com/articles/expedition-33-actor-says-the-game-awards-best-performance-award-doesnt-credit-everyone/1100-6537137/?ftag=CAD-01-10abi2f",
    "thumbnail": "https://www.gamespot.com/a/uploads/screen_kubrick/1179/11799911/4627218-expedition33.jpg",
    "pubDate": "2025-12-22T16:40:00+00:00"
  },
  {
    "title": "Ghost Of Yotei Dev Studio Head Is Leaving And Doesn't Know What He'll Do Next",
    "description": "Sucker Punch Productions co-founder Brian Fleming is leaving the gaming studio after working there since it opened 28 years ago in 1997. What's he doing next? Fleming says he does not know. In a post on LinkedIn, Fleming said, \"I really don't know what's next.\" He's staying with Sucker Punch through April 2026 to help with the transition efforts, and after that he said he plans to travel. He's also going to spend the time trying to \"sort out which opportunities\" he wants to pursue next. Fleming said he's considering a lot of different options for the future, including staying in games, moving to the wider technology space, getting into the \"entertainment\" business, and even working in the \"advocacy/politics\" areas. Continue Reading at GameSpot",
    "link": "https://www.gamespot.com/articles/ghost-of-yotei-dev-studio-head-leaving-the-studio-and-doesnt-know-what-hell-do-next/1100-6537135/?ftag=CAD-01-10abi2f",
    "thumbnail": "https://www.gamespot.com/a/uploads/screen_kubrick/1179/11799911/4627209-screenshot2025-12-22at11.35.04%E2%80%AFam.png",
    "pubDate": "2025-12-22T16:21:00+00:00"
  },
  {
    "title": "Price predictions 12/22: SPX, DXY, BTC, ETH, BNB, XRP, SOL, DOGE, ADA, BCH",
    "description": "Bitcoin and select altcoins are attempting to start a recovery, but higher levels are expected to attract strong selling by the bears.",
    "link": "https://cointelegraph.com/news/price-predictions-12-22-spx-dxy-btc-eth-bnb-xrp-sol-doge-ada-bch?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
    "thumbnail": "https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjUtMTIvMDE5YjQ2ZDctZDhiMC03OGM4LWFjYTYtNTQ2MmQzNzBjM2E1LmpwZw==.jpg",
    "pubDate": "2025-12-22T16:19:49+00:00"
  },
  {
    "title": "U.S. bipartisan lawmakers draw up tax bill with stablecoin and staking relief",
    "description": "New House proposal would exempt some stablecoin payments from capital gains taxes and allow stakers to defer income recognition for up to five years.",
    "link": "https://www.coindesk.com/policy/2025/12/22/u-s-bipartisan-lawmakers-draw-up-tax-bill-with-stablecoin-and-staking-relief",
    "thumbnail": "https://cdn.sanity.io/images/s3y3vcno/production/11d38e96067e18f4d9e1e0057cdf51ebefe2cca9-1920x1080.jpg?auto=format&w=960&h=540&crop=focalpoint&fit=clip&q=75&fm=jpg",
    "pubDate": "2025-12-22T16:18:14+00:00"
  },
  {
    "title": "BlackRock names bitcoin ETF a top 2025 theme despite price slump",
    "description": "The world's largest asset manager is promoting its underperforming bitcoin fund over higher-fee winners, signaling long-term commitment.",
    "link": "https://www.coindesk.com/markets/2025/12/22/blackrock-names-bitcoin-etf-a-top-2025-theme-despite-price-slump",
    "thumbnail": "https://cdn.sanity.io/images/s3y3vcno/production/41cbb7ee40d94b98973687037c93204cb2d611a6-1920x1080.jpg?auto=format&w=960&h=540&crop=focalpoint&fit=clip&q=75&fm=jpg",
    "pubDate": "2025-12-22T16:01:13+00:00"
  },
  {
    "title": "JPMorgan explores crypto trading for institutional clients: Report",
    "description": "The move by the traditional banking giant would represent a significant deepening of ties to the crypto industry and change in CEO Jamie Dimon’s approach to digital assets.",
    "link": "https://cointelegraph.com/news/jpmorgan-crypto-trading-institutional-clients?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
    "thumbnail": "https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjUtMTIvMDE5YjQ2NzQtNjE4NC03MGI3LTg2N2UtMWQ3ZjNjZTgyMGNmLmpwZw==.jpg",
    "pubDate": "2025-12-22T15:56:36+00:00"
  },
  {
    "title": "New Trump envoy says he will serve to make Greenland part of US",
    "description": "Denmark warns Washington to respect its sovereignty, while Greenland says it will decide its own future.",
    "link": "https://www.bbc.com/news/articles/ckgmd132ge4o?at_medium=RSS&at_campaign=rss",
    "thumbnail": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/69ce/live/2b00a520-df47-11f0-a8dc-93c15fe68710.jpg",
    "pubDate": "2025-12-22T15:49:12+00:00"
  },
  {
    "title": "The Economy Survived 2025, But Many Americans Are Reeling",
    "description": "A feared recession didn’t materialize, but unemployment rose, wage growth slowed and affordability challenges are mounting.",
    "link": "https://www.nytimes.com/2025/12/22/business/economy-unemployment-wages-affordability.html",
    "thumbnail": "https://static01.nyt.com/images/2025/12/20/business/00econ-wrap/00econ-wrap-facebookJumbo.jpg",
    "pubDate": "2025-12-22T15:47:48+00:00"
  },
  {
    "title": "Ether analysts see ‘upward breakout’ as ETH price returns to $3K",
    "description": "Ether rebounded 16% to reclaim $3,000 as whales accumulate heavily, exchange supply hits nine-year lows and network activity surges.",
    "link": "https://cointelegraph.com/news/ethereum-upward-breakout-eth-price-returns-3k?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
    "thumbnail": "https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjUtMTIvMDE5YWUxMGQtZjZhMi03YTEwLTlhYmMtNTFkM2U2OWIyOTdl.jpg",
    "pubDate": "2025-12-22T15:46:19+00:00"
  },
  {
    "title": "CME loses top spot to Binance in bitcoin futures open interest as institutional demand wanes",
    "description": "Behind the move is a sharp narrowing in the profitability of the basis trade, in which traders attempt to capture a spread by buying spot bitcoin while selling BTC futures.",
    "link": "https://www.coindesk.com/markets/2025/12/22/cme-loses-top-spot-to-binance-in-bitcoin-futures-open-interest-as-institutional-demand-wanes",
    "thumbnail": "https://cdn.sanity.io/images/s3y3vcno/production/1bcf4c0f104cf5c93e93443baef20058cd93c32a-3200x1800.png?auto=format&w=960&h=540&crop=focalpoint&fit=clip&q=75&fm=jpg",
    "pubDate": "2025-12-22T15:46:19+00:00"
  },
  {
    "title": "Filecoin climbs after breaking above $1.29 resistance zone",
    "description": "Technical momentum built as institutional flows drove price through key resistance levels amid an 87% volume surge above average.",
    "link": "https://www.coindesk.com/markets/2025/12/22/filecoin-climbs-after-breaking-above-usd1-29-resistance-zone",
    "thumbnail": "https://cdn.sanity.io/images/s3y3vcno/production/8d5d441f4d5317c073228483f261397bbdedbac7-700x430.png?auto=format&w=960&h=540&crop=focalpoint&fit=clip&q=75&fm=jpg",
    "pubDate": "2025-12-22T15:07:14+00:00"
  },
  {
    "title": "Coinbase to acquire The Clearing Company in prediction markets push",
    "description": "Coinbase is buying The Clearing Company as it expands into prediction markets and broadens its product lineup beyond crypto trading.",
    "link": "https://cointelegraph.com/news/coinbase-acquires-clearing-company-prediction-markets?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
    "thumbnail": "https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjUtMTIvMDE5YjQ2ODMtMzdhNS03ZDJlLWFkNjItOTdhMjk2OWM4OWVjLmpwZw==.jpg",
    "pubDate": "2025-12-22T15:04:43+00:00"
  },
  {
    "title": "The clock is ticking for crypto tax loss harvesting",
    "description": "Investors might be able to take advantage of the recent crypto market downturn in order to lower their taxable income.",
    "link": "https://www.coindesk.com/opinion/2025/12/22/the-clock-is-ticking-for-crypto-tax-loss-harvesting",
    "thumbnail": "https://cdn.sanity.io/images/s3y3vcno/production/5c7143f754bd073deb1cd2283317f351a0c34727-1920x1080.jpg?auto=format",
    "pubDate": "2025-12-22T14:35:59+00:00"
  },
  {
    "title": "Trump’s World Liberty Financial token ends 2025 down over 40%",
    "description": "The Trump family’s crypto project, World Liberty Financial, has seen its fair share of controversy, and its token is ending the year significantly down.",
    "link": "https://cointelegraph.com/news/trump-world-liberty-financial-token-ends-2025-down?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
    "thumbnail": "https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjUtMTIvMDE5YjQ1ODktZjRhMS03ZjlhLWFlMzktODNhYTQ5ZmZkNDliLmpwZw==.jpg",
    "pubDate": "2025-12-22T14:20:42+00:00"
  },
  {
    "title": "Ghana passes law to legalize crypto trading, central bank governor says",
    "description": "Ghana legalizes cryptocurrency and gives its central bank authority to regulate and license providers to reduce fraud and systemic risks.",
    "link": "https://cointelegraph.com/news/ghana-passes-law-to-legalize-crypto-trading-central-bank-governor-says?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
    "thumbnail": "https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjUtMTIvMDE5YjQ1ZmUtNzE3Zi03Mzk0LTlmMzktNzk2YjIwMWYyYjA3LmpwZw==.jpg",
    "pubDate": "2025-12-22T13:40:12+00:00"
  },
  {
    "title": "Brick trophies, a life-size pink Cadillac and a team sponsorship: Why Lego is going all in on F1",
    "description": "Lego and Formula 1 kicked off a multiyear partnership in 2025. Here's how that collaboration is providing value to the toy company and the racing organization.",
    "link": "https://www.cnbc.com/2025/12/22/lego-formula-1-partnership-fan-base.html",
    "thumbnail": "https://image.cnbcfm.com/api/v1/image/108243077-1765992210577-gettyimages-2247578026-hv3_6895_f2d8u6s2.jpeg?v=1766162524&w=1920&h=1080",
    "pubDate": "2025-12-22T13:30:01+00:00"
  },
  {
    "title": "As Trump Clings to Tariffs, His Argentine Ally Is Opening Up to Trade",
    "description": "President Javier Milei is eliminating barriers to what had been a closed-off economy, moving in the opposite direction of his main political ally, President Trump.",
    "link": "https://www.nytimes.com/2025/12/22/world/americas/argentina-trade.html",
    "thumbnail": "https://static01.nyt.com/images/2025/12/22/multimedia/22int-argentina-consumption-promo/22int-argentina-consumption-jczq-facebookJumbo.jpg",
    "pubDate": "2025-12-22T12:59:57+00:00"
  },
  {
    "title": "Supplements in your stocking: Why wellness gifts are gaining steam for the holidays and beyond",
    "description": "Retailers are blurring the lines between beauty and wellness as customers look for holiday gifts and focus on self-care.",
    "link": "https://www.cnbc.com/2025/12/22/supplements-wellness-christmas-gifts.html",
    "thumbnail": "https://image.cnbcfm.com/api/v1/image/108244150-1766153945265-IMG_0265.jpg?v=1766411885&w=1920&h=1080",
    "pubDate": "2025-12-22T12:00:01+00:00"
  },
  {
    "title": "Artists We Lost in 2025, in Their Words",
    "description": "Robert Redford, Roberta Flack, Diane Keaton and Brian Wilson are among the cultural luminaries who died this year.",
    "link": "https://www.nytimes.com/2025/12/22/arts/artists-who-died-in-2025.html",
    "thumbnail": "https://static01.nyt.com/images/2025/12/22/arts/22cul-artists-we-lost-promo/22cul-artists-we-lost-promo-facebookJumbo.jpg",
    "pubDate": "2025-12-22T10:02:31+00:00"
  },
  {
    "title": "’60 Minutes’ Pulls Segment on Venezuelans Deported by Trump Administration, Drawing Criticism",
    "description": "Sharyn Alfonsi, a “60 Minutes” correspondent, criticized the network’s decision to remove her reporting from Sunday’s edition of the show.",
    "link": "https://www.nytimes.com/2025/12/21/business/60-minutes-trump-bari-weiss.html",
    "thumbnail": "https://static01.nyt.com/images/2025/12/21/multimedia/21biz-cbs-60-minutes-gkqw/21biz-cbs-60-minutes-gkqw-facebookJumbo.jpg",
    "pubDate": "2025-12-22T04:39:00+00:00"
  },
  {
    "title": "Trevi Therapeutics (TRVI) Targets Next Phase of Growth with Leadership Change",
    "description": "",
    "link": "https://finance.yahoo.com/news/trevi-therapeutics-trvi-targets-next-123115813.html",
    "thumbnail": "https://s.yimg.com/ny/api/res/1.2/tOcrWlXgmwyD4PeNJRo4Zw--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyMDA7aD04MDA-/https://media.zenfs.com/en/insidermonkey.com/9a5c850cc118e26f552871a4ad528b36",
    "pubDate": "2025-12-21T12:31:15+00:00"
  },
  {
    "title": "Analysts Remain Bullish on Seabridge Gold (SA) Amid KSM Project Progress",
    "description": "",
    "link": "https://finance.yahoo.com/news/analysts-remain-bullish-seabridge-gold-123113186.html",
    "thumbnail": "https://s.yimg.com/ny/api/res/1.2/2FAZMG6VtDQZs.6DYrbAWg--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyMDA7aD02NzM-/https://media.zenfs.com/en/insidermonkey.com/6f206bd587d8e5fef5ec92ee2759dd39",
    "pubDate": "2025-12-21T12:31:13+00:00"
  },
  {
    "title": "TD Cowen Initiates Coverage on RAPT Therapeutics (RAPT) with a “Buy”",
    "description": "",
    "link": "https://finance.yahoo.com/news/td-cowen-initiates-coverage-rapt-123112680.html",
    "thumbnail": "https://s.yimg.com/ny/api/res/1.2/Z9kg10IqlRqAqy0Oy5twZg--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyMDA7aD04MDA-/https://media.zenfs.com/en/insidermonkey.com/89c0b31c8a49a4b2c6733fddd0910df8",
    "pubDate": "2025-12-21T12:31:12+00:00"
  },
  {
    "title": "Analyst Sentiment Remains Bullish on CytomX Therapeutics (CTMX) Amid CX-2051 Therapy Progress",
    "description": "",
    "link": "https://finance.yahoo.com/news/analyst-sentiment-remains-bullish-cytomx-123108166.html",
    "thumbnail": "https://s.yimg.com/ny/api/res/1.2/AbZ7OO1iqiBVSZxHLJjdtw--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyMDA7aD02NzM-/https://media.zenfs.com/en/insidermonkey.com/ed5315c73f7eca11f3f6cbed074fad49",
    "pubDate": "2025-12-21T12:31:08+00:00"
  },
  {
    "title": "H.C Wainwright and Citizens Raise PT on DBV Technologies (DBVT) Following Phase 3 VITESSE Trial Result",
    "description": "",
    "link": "https://finance.yahoo.com/news/h-c-wainwright-citizens-raise-123106218.html",
    "thumbnail": "https://s.yimg.com/ny/api/res/1.2/prUEb26DdO7cTGTOOWTyzg--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyMDA7aD02NzM-/https://media.zenfs.com/en/insidermonkey.com/b7c2cdfffb12a9800a974d6767f3e7d2",
    "pubDate": "2025-12-21T12:31:06+00:00"
  },
  {
    "title": "Compass Therapeutics’ (CMPX) Tovecimig Drives Strong Analyst Sentiment",
    "description": "",
    "link": "https://finance.yahoo.com/news/compass-therapeutics-cmpx-tovecimig-drives-123105202.html",
    "thumbnail": "https://s.yimg.com/ny/api/res/1.2/l8zSulexqQMBkE9M0AXRzg--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyMDA7aD02NzM-/https://media.zenfs.com/en/insidermonkey.com/a5f3d6b67c41beb9c9b5315d5441323f",
    "pubDate": "2025-12-21T12:31:05+00:00"
  },
  {
    "title": "5 crystal-clear signs you’ve retired (very) well in America. Can you finally stop stressing out in 2026?",
    "description": "",
    "link": "https://finance.yahoo.com/news/5-crystal-clear-signs-ve-123000616.html",
    "thumbnail": "https://media.zenfs.com/en/moneywise_327/97b0f816d0873228d728cca5bb691e28",
    "pubDate": "2025-12-21T12:30:00+00:00"
  },
  {
    "title": "Do you really need $1 million in savings to retire comfortably? 'It depends' says JPMorgan",
    "description": "",
    "link": "https://finance.yahoo.com/news/really-1-million-savings-retire-122500408.html",
    "thumbnail": "https://s.yimg.com/ny/api/res/1.2/fjSJ7RUfo4RosM5qnfTNGA--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyMDA7aD02NTk-/https://media.zenfs.com/en/moneywise_ecomm_711/9eb1598307a4ddced6d1473acd62db51",
    "pubDate": "2025-12-21T12:25:00+00:00"
  },
  {
    "title": "Here’s Who Should Really Be Worried About Social Security Cuts",
    "description": "",
    "link": "https://finance.yahoo.com/news/really-worried-social-security-cuts-115511466.html",
    "thumbnail": "https://s.yimg.com/ny/api/res/1.2/CACCsmDNm9EDvfkMLhW91w--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyMDA7aD02NzU-/https://media.zenfs.com/en/gobankingrates_644/1d467fd115c1812f7671c8d9a7a01fd5",
    "pubDate": "2025-12-21T11:55:11+00:00"
  },
  {
    "title": "Better Crypto Buy: Bitcoin vs. XRP",
    "description": "",
    "link": "https://finance.yahoo.com/news/better-crypto-buy-bitcoin-vs-115000278.html",
    "thumbnail": "https://s.yimg.com/ny/api/res/1.2/BGZEXcOS58zMRyp72LKkog--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyMDA7aD02NzU-/https://media.zenfs.com/en/motleyfool.com/2ba99af979320fa68294e36eb33c45f3",
    "pubDate": "2025-12-21T11:50:00+00:00"
  }
]