[
  {
    "title": "Bitmine’s stash crosses 4M ETH after latest $40M buy",
    "description": "Bitmine's Ether haul now exceeds 4 million tokens worth over $12 billion after the company purchased nearly 100 million Ether in the past week.",
    "link": "https://cointelegraph.com/news/bitmine-crosses-4m-eth-latest-40-million-buy?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
    "thumbnail": "https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjUtMTIvMDE5YWU0NDYtMWUyOS03ZTFiLWFiZWMtNjZiYmJhZGQ2ZjQ1.jpg",
    "pubDate": "2025-12-23T02:14:12+00:00"
  },
  {
    "title": "The Economy Survived 2025, But Many Americans Are Reeling",
    "description": "A feared recession didn’t materialize, but unemployment rose, wage growth slowed and affordability challenges are mounting.",
    "link": "https://www.nytimes.com/2025/12/22/business/economy-unemployment-wages-affordability.html",
    "thumbnail": "https://static01.nyt.com/images/2025/12/20/business/00econ-wrap/00econ-wrap-facebookJumbo.jpg",
    "pubDate": "2025-12-23T01:58:18+00:00"
  },
  {
    "title": "Trump warns Maduro not to ‘play tough’ as China, Russia back Venezuela",
    "description": "Latest threat comes as US coastguard continues to pursue a third oil tanker off the coast of Venezuela.",
    "link": "https://www.aljazeera.com/news/2025/12/23/trump-warns-maduro-not-to-play-tough-as-china-russia-back-venezuela?traffic_source=rss",
    "thumbnail": "https://www.aljazeera.com/wp-content/uploads/2025/12/AP25356831768553-1766454006.jpg?resize=1920%2C1440",
    "pubDate": "2025-12-23T01:43:53+00:00"
  },
  {
    "title": "Fortnite Winterfest 2025: All Quests And Rewards",
    "description": "Fortnite's latest Winterfest celebration kicked off with the usual array of map and gameplay changes in Battle Royale and piles of free stuff in the Winterfest cabin. But that's not all there is to care about in Fortnite's latest update--we've also got a pair of new sets of quests that reward XP, and an additional free cosmetic that must be earned by completing a specific one of those new quests. Let's take a look at what we've got here. Not all of the Winterfest quests are currently available. As of December 20, only the first two sets of quests are available. Table of Contents [hide]Winterfest 2025 quests Winterfest 2025 quests The first of these new quests sets, listed under Winterfest in your quest log, are for Battle Royale. There are four time-gated groups of this set of quests--the first group is available now, and the rest will be added periodically. Completing a quest awards 12K XP each, and there may be a reward at the end of the questline--but we don't know for sure yet. These quests expire when Winterfest ends on January 5. Continue Reading at GameSpot",
    "link": "https://www.gamespot.com/articles/fortnite-winterfest-2025-all-quests-and-rewards/1100-6537092/?ftag=CAD-01-10abi2f",
    "thumbnail": "https://www.gamespot.com/a/uploads/screen_kubrick/1757/17577455/4625848-crackshotcabin.jpg",
    "pubDate": "2025-12-23T01:39:00+00:00"
  },
  {
    "title": "US regulator approves pill form of Wegovy weight-loss drug",
    "description": "Wegovy becomes first pill of its kind to be approved, shifting weight-loss drugs beyond injections.",
    "link": "https://www.bbc.com/news/articles/ce86le5dyxyo?at_medium=RSS&at_campaign=rss",
    "thumbnail": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/af6b/live/bcb57630-df97-11f0-aae2-2191c0e48a3b.jpg",
    "pubDate": "2025-12-23T01:29:07+00:00"
  },
  {
    "title": "Lego Batman: Legacy Of The Dark Knight Appears To Be A Full Switch 2 Release",
    "description": "Lego Batman: Legacy of the Dark Knight Standard Edition $70 | Releases May 29, 2026 Preorder at Amazon Preorder at Best Buy Lego Batman: Legacy of the Dark Knight Deluxe Edition $90 | Releases May 26, 2026 See at Amazon The Caped Crusader returns next year with Lego Batman: Legacy of the Dark Knight launching on PlayStation 5, Switch 2, Xbox Series X|S, and PC on May 29, 2026. This all-new Lego Batman title looks to be a tribute to multiple eras of the hero, letting players explore different versions of Gotham City as multiple Lego-ified incarnations of Batman. Preorders are now open for the game, including a $70 standard edition and a $90 Deluxe Edition, which includes new gear and vehicles to help protect the streets of Gotham. You can also start playing the game a few days early if you preorder the Deluxe Edition. All other versions include bonus cosmetics for securing a copy of the game before launch. However, the most notable point about the Lego Batman: Legacy of the Dark Knight is that the Switch 2 version appears to be a true physical version, not a Game Key-Card release. So, unless something changes before launch, that means the full game will be on the cartridge and won't require you to download it to the console's limited SSD or a microSD Express card. This would make sense considering recent news that Nintendo is offering publishers a smaller cartridge option. Lego Batman: Legacy of the Dark Knight Preorder Bonuses Lego Batman: Legacy of the Dark Knight Preorder BonusesPreordeing any version of Lego Batman: Legacy of the Dark Knight will unlock the batsuit from The Dark Knight Returns, a classic blue-and-grey ensemble inspired by the legendary comic book mini-series. Continue Reading at GameSpot",
    "link": "https://www.gamespot.com/articles/lego-batman-legacy-of-the-dark-knight-preorder-guide/1100-6536955/?ftag=CAD-01-10abi2f",
    "thumbnail": "https://www.gamespot.com/a/uploads/square_avatar/1601/16018044/4622826-lego-batman-3.jpg",
    "pubDate": "2025-12-23T01:29:00+00:00"
  },
  {
    "title": "The Classic Pink Panther Films Are Coming To 4K Blu-ray Nex Week",
    "description": "The Pink Panther Blu-rays Releasing December 30 See at Amazon The Pink Panther is one of the few film franchises instantly recognizable by its theme tune, and if you've never seen it, you can grab four classic entries in the series on 4K Blu-ray starting December 30. Each new release includes a standard Blu-ray disc of the movie and special features. Preorders are available now, and each one is discounted to $31.49 (was $45) at Amazon. Here's a look at all four of the upcoming Pink Panther 4K Blu-rays, along with links to preorder if you're interested. The Pink Panther (1963) (4K) $31.49 (was $45) | Releases December 30 The Pink Panther film series began with the original film in 1963, introducing the world to the blundering French police inspector Jacques Clouseau, played by Peter Sellers. Facing off against the dashing European thief Sir Charles Lytton (David Niven), Clouseau had to match what few wits he had against the master criminal and prevent him from stealing the titular Pink Panther diamond. This new 4K Blu-ray release is the first time the film has been available in 4K. Preorders are discounted to $31.49 (was $45) at Amazon. Preorder at Amazon A Shot in the Dark (4K) $31.49 (was $45) | Releases December 30 The next film in the series, A Shot in the Dark, hit theaters in 1964 and sees Sellers return as Inspector Clouseau. This was a standalone sequel to The Pink Panther, and it introduced Clouseau's boss, Commissioner Dreyfus, who was the frequent victim of the inspector's near-lethal clumsiness. Just like The Pink Panther, this new A Shot in the Dark 4K Blu-ray launches on December 30, and Amazon is marking down preorders to $31.49 (was $45). Preorder at Amazon The Pink Panther Strikes Again (4K) $31.49 (was $45) | Releases December 30 Sellers reunited with director Blake Edwards and several familiar faces for Return of the Pink Panther in 1975--though, strangely, that film's 4K Blu-ray version is planned to launch later in 2026 and it not available to preorder. However, its 1976 follow-up, The Pink Panther Strikes Again, is getting a 4K Blu-ray on the same day as the others. This entry follows the now-deranged Commissioner Dreyfus from the previous films and his schemes to murder Clouseau. Preorder at Amazon Revenge of the Pink Panther (4K) $31.49 (was $45) | Releases December 30 The final Pink Panther 4K Blu-ray launching on December 30 is 1978's Revenge of the Pink Panther. This film closes out Sellers' run as Clouseau, and sees the detective take on French drug kingpin Philippe Douvier. Just like the other releases, preorders are discounted to $31.49 (was $45) at Amazon. Preorder at Amazon While this covers most of the mainline films starring Peter Sellers as Inspector Jacques Clouseau, the third film in the series, Return of the Pink Panther, is expected to be released on 4K Blu-ray later in 2026. Continue Reading at GameSpot",
    "link": "https://www.gamespot.com/articles/the-pink-panther-4k-blu-rays/1100-6537015/?ftag=CAD-01-10abi2f",
    "thumbnail": "https://www.gamespot.com/a/uploads/square_avatar/1601/16018044/4624025-pink-panther.jpg",
    "pubDate": "2025-12-23T00:56:00+00:00"
  },
  {
    "title": "FDA approves first GLP-1 pill for obesity from Wegovy maker Novo Nordisk",
    "description": "The approval gives Novo Nordisk a head start over chief rival Eli Lilly, which is racing to launch its own obesity pill.",
    "link": "https://www.cnbc.com/2025/12/22/fda-approves-first-glp-1-pill-for-obesity-from-novo-nordisk.html",
    "thumbnail": "https://image.cnbcfm.com/api/v1/image/108231152-17640105232025-11-24t185245z_617754530_rc263iabxpyr_rtrmadp_0_novo-nordisk.jpeg?v=1764010568&w=1920&h=1080",
    "pubDate": "2025-12-23T00:52:55+00:00"
  },
  {
    "title": "Call of Duty co-creator Vince Zampella dies in California car crash",
    "description": "The influential video game developer died after his car crashed and caught fire on a highway in Los Angeles.",
    "link": "https://www.bbc.com/news/articles/cx25rled0ylo?at_medium=RSS&at_campaign=rss",
    "thumbnail": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/09cf/live/c3c06b50-df84-11f0-b89f-11674143d4d8.jpg",
    "pubDate": "2025-12-23T00:48:58+00:00"
  },
  {
    "title": "Return To Pandora With These Avatar Collector's Editions 4K Blu-Rays",
    "description": "Avatar Blu-rays Collector's Edition, 4K, and 3D Blu-rays See at Amazon See at Walmart Avatar: The Way of Water Collector's Edition (4K) $76 See at Amazon See at Walmart With Avatar: Fire and Ash now in theaters, it's a great time to catch up on the previous two films in director James Cameron's blockbuster sci-fi series. Luckily, new stock of the Avatar and Avatar: The Way of Water Collector's Edition 4K Blu-rays have arrived at Amazon and Walmart. These are the most comprehensive versions of the films available so far, offering both 4K and Blu-ray versions of the movies on disc alongside a bunch of special features, some of which are exclusive to these Collector's Editions. We've outlined the details for both Collector's Editions below. However, if you're looking to save some cash, we've also thrown in links to the standard edition 4K Blu-rays and 3D Blu-ray releases for Avatar and Avatar: The Way of Water as well. Avatar Collector's Edition (4K) $47.73 Avatar's Collector's Edition is loaded with extra content across this four-disc set. The box set includes theatrical, special edition, and extended cuts of Avatar in 4K, as well as standard Blu-ray and a digital streaming copy of the film. What makes this edition special is that it includes hours of exclusive special features, ranging from deleted scenes to an in-depth deconstruction of how several major moments from the movie were created and filmed. Additionally, there's a behind-the-scenes presentation by famed filmmaker Jon Landau, RDA promos featuring Stephen Lang as Colonel Miles Quaritch, and several featurettes examining the script, artwork, and marketing of Avatar. Considering that the film employed several groundbreaking visual and special effects technologies throughout its production, the deep dives into how Avatar was made make for a lengthy and informative look behind the curtain. See at Amazon See at Walmart Avatar Standard Edition (4K) $27 While the 4K version of Avatar isn't as extensive as the Collector's Edition in terms of special features or different cuts of the film, it's still a solid option. The three-disc set includes three hours of bonus materials and the upscaled edits from the 2022 theatrical remaster minus the extended additional scenes from previous releases. See at Walmart Avatar 3D Blu-ray $34.49 (was $56) If you have a 3D TV, you can also get the 3D version of Avatar. The movie raised the bar for 3D films and remains the gold standard for the format. The 3D version uses the theatrical cut of Avatar. It also includes a standard (non-3D) Blu-ray and digital copy of the film, along with the same selection of bonus materials as the standard 4K version. See at Amazon Avatar: The Way of Water Collector's Edition (4K) $76 Like the Avatar: Collector's Edition, this version of the film sequel is packed with extras. In total, there are over eight hours of bonus materials across four discs that thoroughly explore the making of the movie through several featurettes, while also expanding on its story with several deleted and extended scenes. All the discs are housed inside of a fold-out case featuring unique artwork from the movie, and it supports Dolby Vision. See at Amazon See at Walmart Avatar: The Way of Water Standard Edition (4K) $22.49 If you want to save a few dollars and don't mind missing out on the Collector's Edition's exclusive extras, Avatar: The Way of Water is also available in a standard edition 4K Blu-ray release for just $22.49. While the list of special features is shorter, you're still getting a 4K quality version of the film on disc. And if you really want to save, there's even a DVD version of Avatar: The Way of Water available for $10, but this is strictly a movie-only release with no extra content, and it's in much lower visual quality than the 4K or even 3D Blu-ray versions. See at Amazon (4K) See at Amazon (DVD) Avatar: The Way of Water 3d (Blu-ray) $31.36 Fans of 3D movies can also pick up the film in this enhanced version, but it's worth noting that it has a smaller selection of special features than the standard and Collector's Edition 4K Blu-rays. It still totals over three hours of extra content with a curated list of featurettes, behind-the-scenes documentaries, and more, plus you're getting a standard Blu-ray and digital copy of the film to watch. See at Amazon Directed by James Cameron (Terminator 2, Alien, Titanic), the Avatar series takes place in the 22nd Century on the faraway alien planet of Pandora, where the native Na'vi species clash with high-tech human colonizers who pillage the world for its valuable resources. The saga follows Jake Sully, a human whose mind is transferred into a genetically engineered Na'vi body on a mission to infiltrate and sabotage their resistance. However, Sully quickly finds himself won over by the Na'vi, and joins their side to push back the invading human forces. The first two films in the series, Avatar and Avatar: The Way of Water are some of the most successful movies in recent history. The two films combined have grossed over $5.2 billion at the box office, and the third film, Avatar: Fire and Ash, premiered on December 19 to positive reviews and an equally strong $345 million global box office opening weekend. Cameron plans to wrap up the saga with two more Avatar films, with Avatar 4 tentatively planned for December 2029, followed by the fifth and final movie in December 2031. Continue Reading at GameSpot",
    "link": "https://www.gamespot.com/articles/avatar-movies-blu-rays-round-up/1100-6536996/?ftag=CAD-01-10abi2f",
    "thumbnail": "https://www.gamespot.com/a/uploads/square_avatar/1601/16018044/4623863-avatar-square.jpg",
    "pubDate": "2025-12-23T00:35:00+00:00"
  },
  {
    "title": "Recent Bitcoin miner capitulation may signal bottom is near: VanEck",
    "description": "Bitcoin has often surged after sustained hashrate drops, a trend that would provide much-needed relief to many struggling Bitcoin miners at current prices.",
    "link": "https://cointelegraph.com/news/bitcoin-mining-woes-may-signal-bullish-price-action?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
    "thumbnail": "https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjUtMTIvMDE5YjQ4MGYtOTE0YS03NGQxLTk2YzktMDgyY2VmYzFmM2QzLmpwZw==.jpg",
    "pubDate": "2025-12-23T00:32:08+00:00"
  },
  {
    "title": "What the underwhelming Epstein files release means for Trump and Maga",
    "description": "Conservative influencers were conspicuously silent following the latest release - but political danger remains for the president.",
    "link": "https://www.bbc.com/news/articles/cy95w0x9889o?at_medium=RSS&at_campaign=rss",
    "thumbnail": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/34ca/live/5f75b820-df30-11f0-b67b-690eb873de1b.jpg",
    "pubDate": "2025-12-23T00:24:25+00:00"
  },
  {
    "title": "Royal Christmas cards have a touchy-feely look this year",
    "description": "Correspondent Sean Coughlan takes a look at the themes in some of this year's royal cards from across Europe.",
    "link": "https://www.bbc.com/news/articles/cvg80n2yxmko?at_medium=RSS&at_campaign=rss",
    "thumbnail": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/f637/live/171beae0-df62-11f0-b67b-690eb873de1b.jpg",
    "pubDate": "2025-12-23T00:06:39+00:00"
  },
  {
    "title": "Our son can't come home for Christmas after insulation mould took over",
    "description": "Mr and Mrs Wadley's 19-year-old son has asthma and cannot come home for Christmas due to mould all over the walls.",
    "link": "https://www.bbc.com/news/articles/cz0ne0k70dro?at_medium=RSS&at_campaign=rss",
    "thumbnail": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/755a/live/cbf22b00-df62-11f0-aae2-2191c0e48a3b.jpg",
    "pubDate": "2025-12-23T00:01:43+00:00"
  },
  {
    "title": "2025 likely to be UK's hottest on record, says Met Office",
    "description": "Scientists could not be clearer that human-caused climate change is driving the UK's warming trend.",
    "link": "https://www.bbc.com/news/articles/cvgjzpglw4yo?at_medium=RSS&at_campaign=rss",
    "thumbnail": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/f9f4/live/ff8942a0-dcf1-11f0-bc51-61713ec32de7.jpg",
    "pubDate": "2025-12-23T00:00:09+00:00"
  },
  {
    "title": "F.D.A. Approves Wegovy Weight-Loss Pill",
    "description": "The agency greenlit an oral version of the obesity drug Wegovy.",
    "link": "https://www.nytimes.com/2025/12/22/well/fda-approves-wegovy-weight-loss-pill.html",
    "thumbnail": "https://static01.nyt.com/images/2025/12/22/multimedia/HFO-WEGOVY-PILL/HFO-WEGOVY-PILL-facebookJumbo.jpg",
    "pubDate": "2025-12-22T23:45:09+00:00"
  },
  {
    "title": "Trump says US 'has to have' Greenland after naming special envoy",
    "description": "Denmark warns Washington to respect its sovereignty, while Greenland says it will decide its own future.",
    "link": "https://www.bbc.com/news/articles/ckgmd132ge4o?at_medium=RSS&at_campaign=rss",
    "thumbnail": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/69ce/live/2b00a520-df47-11f0-a8dc-93c15fe68710.jpg",
    "pubDate": "2025-12-22T23:40:18+00:00"
  },
  {
    "title": "Inside the rise of Gen Z’s nostalgia-fueled plush-toy craze as they delay adulthood",
    "description": "\"The economy, the wars, everything is really depressing and serious, whereas toys just bring a little bit of joy back into life,\" one toy director said.",
    "link": "https://www.cnbc.com/2025/12/23/inside-the-rise-of-gen-zs-plush-toy-craze-as-they-delay-adulthood.html",
    "thumbnail": "https://image.cnbcfm.com/api/v1/image/108239615-1765363667608-GettyImages-2238341603.jpg?v=1766054421&w=1920&h=1080",
    "pubDate": "2025-12-22T23:20:37+00:00"
  },
  {
    "title": "Wall Street’s bid on crypto dominated 2025 but what’s the demand outlook for 2026?",
    "description": "Federal Reserve policy and crypto-friendly regulation could be setting the market up for a bullish 2026, but there are still a handful of hurdles investors should be aware of.",
    "link": "https://cointelegraph.com/news/wall-street-ruled-crypto-in-2025-what-s-the-demand-outlook-for-2026?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
    "thumbnail": "https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjUtMTIvMDE5YjQ3Y2ItNzc3Yi03MzhkLWJiODktNmMyM2YyN2M2Njc4LmpwZw==.jpg",
    "pubDate": "2025-12-22T23:06:27+00:00"
  },
  {
    "title": "Trump Administration Oil Tanker Seizures Are Meant to Force Maduro Out, Officials Say",
    "description": "Homeland Security Secretary Kristi Noem said the ship seizures were meant to force Venezuela’s president Nicolás Maduro from power.",
    "link": "https://www.nytimes.com/2025/12/22/world/americas/trump-venezuela-oil-tankers-maduro.html",
    "thumbnail": "https://static01.nyt.com/images/2025/12/22/multimedia/22int-tankers-us-venezula-jhzk/22int-tankers-us-venezula-jhzk-facebookJumbo.jpg",
    "pubDate": "2025-12-22T23:04:18+00:00"
  },
  {
    "title": "Greenland PM rebukes Trump special envoy overture",
    "description": "President Donald Trump on Sunday appointed Louisiana Governor Jeff Landry as a 'special envoy' to Greenland.",
    "link": "https://www.cnbc.com/2025/12/22/greenland-pm-rebukes-trump-special-envoy-overture.html",
    "thumbnail": "https://image.cnbcfm.com/api/v1/image/108244926-1766437781567-gettyimages-2206219919-TRUMP_LANDRY_HYUNDAI.jpeg?v=1766437807&w=1920&h=1080",
    "pubDate": "2025-12-22T23:03:10+00:00"
  },
  {
    "title": "The police report of my sexual assault was published by the tabloids",
    "description": "Jenny Evans funnelled her anger into training to become a journalist and uncover the truth.",
    "link": "https://www.bbc.com/news/articles/c9qe5rljpgno?at_medium=RSS&at_campaign=rss",
    "thumbnail": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/e122/live/e2e4f430-dc08-11f0-932f-e1ac58e2c593.jpg",
    "pubDate": "2025-12-22T22:55:31+00:00"
  },
  {
    "title": "Palmer Luckey’s Erebor hits $4.3B valuation as regulators advance bank charter",
    "description": "Luckey-backed Erebor raised $350 million at a $4.35 billion valuation as OCC and FDIC approvals signal momentum for crypto- and AI-focused banking.",
    "link": "https://cointelegraph.com/news/palmer-luckey-erebor-valuation-occ-fdic-crypto-bank?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
    "thumbnail": "https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjUtMTIvMDE5YjQ3NzctNmYxYS03YzAyLWI5OGItMzY3Njc3NjljNzBiLmpwZw==.jpg",
    "pubDate": "2025-12-22T22:48:59+00:00"
  },
  {
    "title": "EU council endorses offline and online versions of digital euro",
    "description": "The Council of the European Union endorsed the launch of the European Central Bank’s digital euro in both an online and a privacy-focused offline version.",
    "link": "https://cointelegraph.com/news/eu-council-endorses-offline-and-online-versions-of-digital-euro?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
    "thumbnail": "https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjUtMTIvMDE5YjQ1YjktMmJkNS03YTY0LWFmOTYtNzk3ZTBiNjcyNzRhLmpwZw==.jpg",
    "pubDate": "2025-12-22T22:48:55+00:00"
  },
  {
    "title": "Arcade1Up Ms. Pac-Man And Galaga Countercade Is Back On Sale At Amazon",
    "description": "Arcade1Up Class of '81 Pac-Man &amp; Galaga Countercade $130 (was $150) See at Amazon See at Best Buy See at Walmart Arcade1Up Pac-Man Countercade $130 (was $150) See at Amazon See at Best Buy Sold out at Walmart If you'd love to have a home arcade machine but are worried about how much space a standing cabinet takes up, Arcade1Up's Countercades are definitely worth checking out--especially when they are on sale like they are now. The Class of '81 Ms. Pac-Man and Galaga model and the Pac-Man model are discounted to $130 (was $150) at Amazon and Best Buy. Both of these compact cabinets include three preloaded Namco arcade classics, 7-inch, vertically oriented displays, and full-size arcade controls. It's worth noting that both models originally launched ahead of the 2024 holiday season and sold out at full price. Continue Reading at GameSpot",
    "link": "https://www.gamespot.com/articles/arcade1up-countercade-arcade-machines-pac-man-galaga-ms-pac-man/1100-6534222/?ftag=CAD-01-10abi2f",
    "thumbnail": "https://www.gamespot.com/a/uploads/square_avatar/1595/15950357/4627312-arcade1upcountercadems.pac-man.png",
    "pubDate": "2025-12-22T22:37:00+00:00"
  },
  {
    "title": "ETHZilla liquidates $74.5M in Ether to redeem convertible debt",
    "description": "The transaction highlights growing pressure on crypto treasury companies to prioritize debt reduction as token prices remain volatile.",
    "link": "https://cointelegraph.com/news/ethzilla-liquidates-ether-redeem-convertible-debt?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
    "thumbnail": "https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjUtMTIvMDE5YjQ3ZGItOTdlZi03NjQ3LWIxNjctMWZhOTA4NGFlZjljLmpwZw==.jpg",
    "pubDate": "2025-12-22T22:09:53+00:00"
  },
  {
    "title": "How U.S. oil tanker seizures targeting Venezuela are linked to rising geopolitical tensions with China",
    "description": "U.S. seizures of vessels carrying Venezuelan oil may become a bigger strategic pressure point in the geopolitical battle with China, a major buyer of the crude.",
    "link": "https://www.cnbc.com/2025/12/22/tanker-seizures-venezuela-oil-china.html",
    "thumbnail": "https://image.cnbcfm.com/api/v1/image/108244496-17663161122025-12-21t004257z_1544712258_rc2gkiajkv0i_rtrmadp_0_usa-venezuela-military-vessel.jpeg?v=1766316158&w=1920&h=1080",
    "pubDate": "2025-12-22T21:54:46+00:00"
  },
  {
    "title": "Jim Beam Halts Production at Flagship Distillery as Whiskey and Bourbon Markets Struggle",
    "description": "The bourbon giant is closing its flagship distilling operation for all of 2026.",
    "link": "https://www.nytimes.com/2025/12/22/dining/jim-beam-production-pause-whiskey-bourbon.html",
    "thumbnail": "https://static01.nyt.com/images/2025/12/22/multimedia/JIM-BEAM-05-hzgv/JIM-BEAM-05-hzgv-facebookJumbo.jpg",
    "pubDate": "2025-12-22T21:48:36+00:00"
  },
  {
    "title": "Israel kills two Palestinians in Gaza City as ceasefire violations mount",
    "description": "Deadly attack comes as Gaza government media office says Israel violated ceasefire 875 times since it began in October.",
    "link": "https://www.aljazeera.com/news/2025/12/22/israel-kills-two-palestinians-in-gaza-city-as-ceasefire-violations-mount?traffic_source=rss",
    "thumbnail": "https://www.aljazeera.com/wp-content/uploads/2025/11/epa_692099750bd6-1763744117.jpg?resize=1920%2C1440",
    "pubDate": "2025-12-22T21:48:01+00:00"
  },
  {
    "title": "Trump Halts 5 Wind Farms Off the East Coast",
    "description": "The Interior Department said the projects posed national security risks, without providing details. The decision imperils billions of dollars of investments.",
    "link": "https://www.nytimes.com/2025/12/22/climate/trump-offshore-wind-farms.html",
    "thumbnail": "https://static01.nyt.com/images/2025/09/26/multimedia/22cli-offshore-wind/22cli-offshore-wind-facebookJumbo.jpg",
    "pubDate": "2025-12-22T21:38:12+00:00"
  },
  {
    "title": "Arizona lawmaker proposes barring taxes on crypto and blockchain",
    "description": "Two bills and one resolution proposed by state lawmaker Wendy Rogers could allow Arizona voters to change the state's taxation laws applied to digital assets and blockchain.",
    "link": "https://cointelegraph.com/news/arizona-bill-crypto-blockchain-taxes-ban?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
    "thumbnail": "https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjUtMTIvMDE5YjQ3OGQtOGQ2Ni03ZGNlLThhZTgtOWYzYmRmZjY3YTRlLmpwZw==.jpg",
    "pubDate": "2025-12-22T21:37:58+00:00"
  },
  {
    "title": "Foster scores late goal as South Africa defeat Angola in their AFCON opener",
    "description": "Lyle Foster's match-winning 79th-minute strike allowed South Africa to win first opening match at AFCON since 2004.",
    "link": "https://www.aljazeera.com/sports/2025/12/22/foster-scores-late-goal-as-south-africa-defeat-angola-in-their-afcon-opener?traffic_source=rss",
    "thumbnail": "https://www.aljazeera.com/wp-content/uploads/2025/12/AP25356691798511-1766436268_340f17-1766437187.jpg?resize=1200%2C630&quality=80",
    "pubDate": "2025-12-22T21:29:25+00:00"
  },
  {
    "title": "Ros Atkins on… the oil tanker being pursued by the US",
    "description": "The BBC’s Analysis Editor Ros Atkins looks at what we know about the \"active pursuit\" of an oil tanker by the US Coast Guard off the coast of Venezuela.",
    "link": "https://www.bbc.com/news/videos/ce3w4x2v0xko?at_medium=RSS&at_campaign=rss",
    "thumbnail": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/c426/live/e596b9f0-df7a-11f0-aae2-2191c0e48a3b.jpg",
    "pubDate": "2025-12-22T21:27:01+00:00"
  },
  {
    "title": "Trump halts wind projects, including Coastal Virginia Offshore Wind, Dominion stock drops 4%",
    "description": "Interior Secretary Doug Burgum said the administration paused the projects due to national security concerns identified by the Pentagon.",
    "link": "https://www.cnbc.com/2025/12/22/trump-offshore-wind-cvow-dominion.html",
    "thumbnail": "https://image.cnbcfm.com/api/v1/image/108244722-1766417176896-gettyimages-2227111307-US-NEWS-TRUMP-WIND-POWER-VP.jpeg?v=1766442970&w=1920&h=1080",
    "pubDate": "2025-12-22T21:04:01+00:00"
  },
  {
    "title": "PlayStation holiday sale has great deals on PS4 and PS5 games",
    "description": "Now is the time to grow your PlayStation backlog even more as some of 2025's best games are on sale.",
    "link": "https://www.polygon.com/playstation-holiday-sale-2025-ps4-ps5-deals/",
    "thumbnail": "https://static0.polygonimages.com/wordpress/wp-content/uploads/2025/04/clair-obscur-expedition-33-trailer-screenshot.jpg?w=1600&h=900&fit=crop",
    "pubDate": "2025-12-22T21:03:20+00:00"
  },
  {
    "title": "Thailand and Cambodia agree to meet amid renewed cross-border fighting",
    "description": "Planned talks come as Southeast Asian leaders urge both countries to show 'maximum restraint' and return to dialogue.",
    "link": "https://www.aljazeera.com/news/2025/12/22/thailand-and-cambodia-agree-to-meet-amid-renewed-cross-border-fighting?traffic_source=rss",
    "thumbnail": "https://www.aljazeera.com/wp-content/uploads/2025/12/getty_6949ade521-1766436325.jpg?resize=1920%2C1440",
    "pubDate": "2025-12-22T21:02:55+00:00"
  },
  {
    "title": "Boxer Ty Mitchell tells Al Jazeera why he had to confront Tommy Robinson",
    "description": "Boxer Ty Mitchell told Al Jazeera why he had to confront far-right British activist Tommy Robinson.",
    "link": "https://www.aljazeera.com/video/newsfeed/2025/12/22/boxer-ty-mitchell-tells-al-jazeera-why-he-had-to-confront-tommy-robinson?traffic_source=rss",
    "thumbnail": "https://www.aljazeera.com/wp-content/uploads/2025/12/boxer_ty_mitchell_al_jazeera_interview_22_december_2025-1766436242.jpg?resize=1200%2C630",
    "pubDate": "2025-12-22T20:58:04+00:00"
  },
  {
    "title": "Canada names new ambassador to US as key trade talks loom",
    "description": "Terms of North American free trade deal set to be renegotiated in 2026 under shadow of US tariff policies.",
    "link": "https://www.aljazeera.com/news/2025/12/22/canada-names-new-ambassador-to-the-united-states-with-emphasis-on-trade?traffic_source=rss",
    "thumbnail": "https://www.aljazeera.com/wp-content/uploads/2025/12/getty_6931c5232c-1764869411.jpg?resize=1920%2C1440",
    "pubDate": "2025-12-22T20:56:32+00:00"
  },
  {
    "title": "Strategy boosts USD reserve with $748M stock sale, skips Bitcoin purchases",
    "description": "The company sold about 4.5 million common shares last week, lifting its cash reserves to $2.19 billion while pausing Bitcoin purchases.",
    "link": "https://cointelegraph.com/news/strategy-usd-reserve-748m-stock-sale-bitcoin?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
    "thumbnail": "https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjUtMTIvMDE5YjQ2YzYtMDUyMC03MjRhLWI1MzMtMzFhMmY5NTgzNDFjLmpwZw==.jpg",
    "pubDate": "2025-12-22T20:47:12+00:00"
  },
  {
    "title": "Bitcoin slips below $88,000 as traders brace for $28.5 billion Deribit options expiry",
    "description": "Crypto continues to lose ground ahead of this week's record options expiration, while defensive positioning and thinning liquidity suggest caution into 2026.",
    "link": "https://www.coindesk.com/markets/2025/12/22/crypto-markets-slip-further-as-traders-brace-for-usd28-5b-deribit-expiry",
    "thumbnail": "https://cdn.sanity.io/images/s3y3vcno/production/9607a8fc93aea488d2954cf166c47cb86450f649-1920x1080.jpg?auto=format&w=960&h=540&crop=focalpoint&fit=clip&q=75&fm=jpg",
    "pubDate": "2025-12-22T20:46:42+00:00"
  },
  {
    "title": "Call Of Duty Is Finally Coming To Switch Soon - Report",
    "description": "Microsoft has said it's committed to bringing Call of Duty to Nintendo Switch, and it could be coming as soon as next year. Reporter Jez Corden said \"the first CoD Switch version is nearly done.\" He added that the game, whatever it is, will launch \"in a few months.\" In another post, Corden said the release may not be \"close\" but it's \"on the way\" for a 2026 release. He added that the game is \"hitting milestones,\" which is a reference to how a game is proceeding through development. Continue Reading at GameSpot",
    "link": "https://www.gamespot.com/articles/call-of-duty-is-finally-coming-to-switch-soon-report/1100-6537145/?ftag=CAD-01-10abi2f",
    "thumbnail": "https://www.gamespot.com/a/uploads/screen_kubrick/1179/11799911/4627288-screenshot2025-12-22at2.56.15%E2%80%AFpm.png",
    "pubDate": "2025-12-22T20:43:00+00:00"
  },
  {
    "title": "Deadly clashes break out in Aleppo between Syrian army, Kurdish-led SDF",
    "description": "At least two people have been killed in clashes between government forces and the Kurdish-led Syrian Democratic Forces.",
    "link": "https://www.aljazeera.com/video/newsfeed/2025/12/22/deadly-clashes-break-out-in-aleppo-between-syrian-army-kurdish-led-sdf?traffic_source=rss",
    "thumbnail": "https://www.aljazeera.com/wp-content/uploads/2025/12/image-1766436073.jpg?resize=1920%2C1080&quality=80",
    "pubDate": "2025-12-22T20:41:54+00:00"
  },
  {
    "title": "Expedition 33 Studio Won't Scale Up For Next Project, Even Though It Can",
    "description": "Clair Obscur: Expedition 33 was one of 2025's biggest breakout hits, and the game's commercial success has afforded developer Sandfall Interactive the opportunity to scale up for its next project. However, the company is not going to do that--and for what sounds like a good reason. Speaking to Edge, studio boss Guillaume Broche said he does not feel tempted to grow the company in the wake of the success of Expedition 33, which was the studio's debut title. Why not? He said (via GI.biz), \"I think it's good to have limitations when you are creative.\" \"It's the best way to be the best version of yourself. We could scale up now we have a lot more money, but I would say it's not tempting for us, because even the management team and myself, we'd have to be hands-on and doing things for ourselves,\" he said. \"We love making games more than we love managing, so we want to keep doing that. These past five years were some of the best of my life, and I want to be happy like that again.\" Continue Reading at GameSpot",
    "link": "https://www.gamespot.com/articles/expedition-33-studio-wont-scale-up-for-next-project-even-though-it-can/1100-6537141/?ftag=CAD-01-10abi2f",
    "thumbnail": "https://www.gamespot.com/a/uploads/screen_kubrick/1179/11799911/4627278-e33.jpg",
    "pubDate": "2025-12-22T20:41:00+00:00"
  },
  {
    "title": "Call of Duty creator Vince Zampella killed in car crash",
    "description": "Vince Zampella, founder of Infinity Ward and Respawn Entertainment, is dead at 55, ending a nearly 30-year video game development career.",
    "link": "https://www.polygon.com/respawn-vince-zampella-death-call-of-duty-battlefield-ea/",
    "thumbnail": "https://static0.polygonimages.com/wordpress/wp-content/uploads/2025/12/vince_zampella.jpg?w=1600&h=900&fit=crop",
    "pubDate": "2025-12-22T20:33:35+00:00"
  },
  {
    "title": "Ugandan police tear gas crowd at Bobi Wine campaign event",
    "description": "Footage shows police dispersing crowds with tear gas at rallies for Ugandan presidential candidate Bobi Wine in Kampala.",
    "link": "https://www.aljazeera.com/video/newsfeed/2025/12/22/ugandan-police-tear-gas-crowd-at-bobi-wine-campaign-event?traffic_source=rss",
    "thumbnail": "https://www.aljazeera.com/wp-content/uploads/2025/12/image-1766435532.jpg?resize=1722%2C1080&quality=80",
    "pubDate": "2025-12-22T20:32:35+00:00"
  },
  {
    "title": "Why Anaconda's director made a reboot: 'There was no room for fun anymore'",
    "description": "Tom Gormican pokes fun at Hollywood reboots and conscious horror in his meta-remake of the 1997 cult classic, Anaconda.",
    "link": "https://www.polygon.com/anaconda-2025-director-interview/",
    "thumbnail": "https://static0.polygonimages.com/wordpress/wp-content/uploads/2025/12/mcdanac_co019.jpg?w=1600&h=900&fit=crop",
    "pubDate": "2025-12-22T20:30:15+00:00"
  },
  {
    "title": "Clair Obscur: Expedition 33 Amazon-Exclusive Steelbook Edition Is Back In Stock",
    "description": "Clair Obscur: Expedition 33 - Mirror Edition for PS5 / Xbox $60 | Amazon Exclusive See at Amazon Amazon has restocked its exclusive collectible edition of Clair Obscur: Expedition 33 for PS5 and Xbox Series X. Released earlier this month, the Mirror Edition includes a physical copy of the recently crowned GOTY at The Game Awards as well as a new steelbook case, three collectible art cards, and an oversized display box with new artwork. PlayStation 5 physical editions of Clair Obscur have been more challenging to find than the Xbox version. Amazon's new $60 Mirror Edition is actually the only PlayStation 5 physical edition in stock as of December 22. The PS5 standard edition is \"temporarily out of stock\" at Amazon, though you can still place an order. That said, Amazon is charging $60 for the standard edition--$10 higher than the original $50 MSRP--and the same price as the Mirror Edition. Every other major retailer is sold out of the standard edition for PS5, and GameStop's reprint of its exclusive $70 Lumiere Edition is out of stock, too. The standard edition for Xbox is $50 and in stock at multiple major retailers, and Steam keys are discounted to only $36 at GameSpot sister site Fanatical. Clair Obscur: Expedition 33 Editions Amazon-Exclusive Mirror Edition PS5 -- $60 Xbox -- $60 Standard Edition PS5 -- $60 Xbox -- $50 GameStop-Exclusive Lumiere Edition PS5 -- $70 | Sold out Steam keys at Fanatical Standard Edition -- $36 ($50) Digital Deluxe Edition -- $43.19 ($60) Clair Obscur: Expedition 33 - Mirror EditionSandfall Interactive's debut game turned out to be a much bigger hit than anyone could have expected. In fact, it currently holds a 92 on Metacritic from reviewers--including a 9/10 from GameSpot--and a 9.6/10 user score. Along with winning Game of the Year at this year's Game Awards, Clair Obscur won GameSpot's GOTY award. Continue Reading at GameSpot",
    "link": "https://www.gamespot.com/articles/clair-obscur-expedition-33-amazon-exclusive-mirror-edition-ps5-xbox-series-x/1100-6528999/?ftag=CAD-01-10abi2f",
    "thumbnail": "https://www.gamespot.com/a/uploads/square_avatar/1595/15950357/4554758-clairobscurmirroredition.png",
    "pubDate": "2025-12-22T20:21:00+00:00"
  },
  {
    "title": "Steam user asks devs to fix game, gets blasted for pirating it",
    "description": "One bold Farthest Frontier fan thought they could complain about the city builder to Crate Entertainment, only to be met with a harsh reality",
    "link": "https://www.polygon.com/steam-game-piracy-farthest-frontier-city-builder-fan/",
    "thumbnail": "https://static0.polygonimages.com/wordpress/wp-content/uploads/2025/12/farthest_frontier_key_art_1080px.jpg?w=1600&h=900&fit=crop",
    "pubDate": "2025-12-22T20:00:14+00:00"
  },
  {
    "title": "CoD, Battlefield Boss Vince Zampella Dies In Car Crash",
    "description": "Vince Zampella, the co-founder of Infinity Ward and one of the leading figures behind the first Call of Duty game, has passed away. Zampella was reportedly in a single-car accident on Sunday, December 21 in the San Gabriel Mountains when the vehicle went off the road and hit a concrete barrier. According to NBC4 Los Angeles, the driver of the vehicle perished in a car fire while the passenger was ejected and died at the hospital. The report didn't share any further specifics about the incident. Zampella got his start in the video game industry in the late '90s with stints at GameTek, Atari, Interactive Media/Ripcord Games, and SegaSoft. In 1999, he joined 2015 Inc and became the lead designer of the third Medal of Honor game, Medal of Honor: Allied Assault, which was published by EA. Continue Reading at GameSpot",
    "link": "https://www.gamespot.com/articles/cod-battlefield-boss-vince-zampella-dies-in-car-crash/1100-6537144/?ftag=CAD-01-10abi2f",
    "thumbnail": "https://www.gamespot.com/a/uploads/screen_kubrick/1837/18375603/4627287-vincezampella.jpg",
    "pubDate": "2025-12-22T20:00:00+00:00"
  },
  {
    "title": "130 Nigerian schoolchildren freed after mass abduction",
    "description": "A group of 130 Nigerian schoolchildren abducted last month were freed, ending a mass abduction that drew global concern.",
    "link": "https://www.aljazeera.com/video/newsfeed/2025/12/22/130-nigerian-schoolchildren-freed-after-mass-abduction?traffic_source=rss",
    "thumbnail": "https://www.aljazeera.com/wp-content/uploads/2025/12/image-1766433183.jpg?resize=1440%2C1080&quality=80",
    "pubDate": "2025-12-22T19:53:29+00:00"
  },
  {
    "title": "This Popular Game Is Having Its Servers Shut Off Soon, Will Also Be Delisted",
    "description": "2K Sports has confirmed that WWE 2K24 will be delisted as of January 31, 2026, with servers shutting down on March 31, 2026. This information was disclosed on the game's Steam page, but also applies to the console editions. Once the servers go dark, \"all game functions requiring online servers will no longer function.\" 2K Sports actually first confirmed the server shutdown on December 8, but it wasn't widely reported on until more recently. The game's offline modes like Play Now and Showcase will remain available after the servers go dark. Continue Reading at GameSpot",
    "link": "https://www.gamespot.com/articles/this-popular-game-is-having-its-servers-shut-off-soon-will-also-be-delisted/1100-6537143/?ftag=CAD-01-10abi2f",
    "thumbnail": "https://www.gamespot.com/a/uploads/screen_kubrick/1179/11799911/4627285-2k.jpg",
    "pubDate": "2025-12-22T19:45:00+00:00"
  },
  {
    "title": "Epstein Files: Schumer to force Senate vote on suing DOJ over partial release",
    "description": "President Donald Trump signed a law compelling the full release of the Jeffrey Epstein files. But the DOJ has released just a fraction.",
    "link": "https://www.cnbc.com/2025/12/22/epstein-files-doj-schumer-trump-democrats.html",
    "thumbnail": "https://image.cnbcfm.com/api/v1/image/108244757-1766419957113-gettyimages-2252543897-senate_dems_1_123_121725.jpeg?v=1766431688&w=1920&h=1080",
    "pubDate": "2025-12-22T19:42:15+00:00"
  },
  {
    "title": "Assad, Ousted Syrian Ruler, Leads Life of Luxury in Russia",
    "description": "Bashar al-Assad’s long, brutal reign ended swiftly, but he and his close circle have had a soft landing in Russia.",
    "link": "https://www.nytimes.com/2025/12/22/world/middleeast/assad-syria-exile-luxury.html",
    "thumbnail": "https://static01.nyt.com/images/2025/12/20/video/xxvi-assads-cover-square/xxvi-assads-cover-square-facebookJumbo.png",
    "pubDate": "2025-12-22T19:36:01+00:00"
  },
  {
    "title": "Ex-C.I.A. Chief Wants to Block Judge Cannon From Inquiry Pushed by Trump’s Allies",
    "description": "The request, addressed to the top federal judge in Miami, sought to block a U.S. attorney from pursuing a politically charged inquiry before Judge Aileen Cannon, who has repeatedly decided in President Trump’s favor.",
    "link": "https://www.nytimes.com/2025/12/22/us/politics/trump-doj-investigation-judge-cannon-brennan-cia.html",
    "thumbnail": "https://static01.nyt.com/images/2025/12/22/multimedia/22dc-brennan01-photo-qgzh/22dc-brennan01-photo-qgzh-facebookJumbo.jpg",
    "pubDate": "2025-12-22T19:31:45+00:00"
  },
  {
    "title": "Crypto laments loss of key ally on Capitol Hill after Lummis announces retirement",
    "description": "Sen. Cynthia Lummis’ retirement tees up a Republican primary in Wyoming, where the victor will be heavily favored in November.",
    "link": "https://www.cnbc.com/2025/12/22/crypto-lummis-retirement-key-ally-capitol-hill.html",
    "thumbnail": "https://image.cnbcfm.com/api/v1/image/107094109-16588539972022-07-26t164134z_1172648673_rc2rjv9s61hk_rtrmadp_0_usa-trump.jpeg?v=1766430525&w=1920&h=1080",
    "pubDate": "2025-12-22T19:25:15+00:00"
  },
  {
    "title": "Expedition 33's GOTY retraction signals a messy AI debate in 2026",
    "description": "The controversy around Clair Obscur's generative AI usage signals that a murky debate is only going to get messier in 2026.",
    "link": "https://www.polygon.com/clair-obscur-expedition-33-indie-game-awards-controvsery-gen-ai-explained/",
    "thumbnail": "https://static0.polygonimages.com/wordpress/wp-content/uploads/2025/04/clairobscur-fight.jpg?w=1600&h=900&fit=crop",
    "pubDate": "2025-12-22T19:24:06+00:00"
  },
  {
    "title": "Can diplomacy end the conflict between Thailand and Cambodia?",
    "description": "The neighbouring countries hold their first direct meeting in regional push for peace.",
    "link": "https://www.aljazeera.com/video/inside-story/2025/12/22/can-diplomacy-end-the-conflict-between-thailand-and-cambodia?traffic_source=rss",
    "thumbnail": "https://www.aljazeera.com/wp-content/uploads/2025/12/image-1766429300.jpg?resize=1920%2C1061&quality=80",
    "pubDate": "2025-12-22T19:04:35+00:00"
  },
  {
    "title": "30 years later, Mel Brooks' Dracula satire is still his weirdest misfire",
    "description": "Polygon looks back on Dracula: Dead and Loving It, a vampire spoof that probably should have stayed dead.",
    "link": "https://www.polygon.com/dracula-dead-and-loving-it-mel-brooks-worst-comedy-retropective/",
    "thumbnail": "https://static0.polygonimages.com/wordpress/wp-content/uploads/2025/12/dracula-header.jpg?w=1600&h=900&fit=crop",
    "pubDate": "2025-12-22T19:01:14+00:00"
  },
  {
    "title": "David Sacks calls CFTC, SEC picks a crypto regulation ‘dream team‘",
    "description": "Following Michael Selig's confirmation, White House official David Sacks said the SEC and CFTC were set to offer \"clear regulatory guidelines\" for digital assets.",
    "link": "https://cointelegraph.com/news/david-sacks-cftc-sec-crypto-dream-team-regulation?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
    "thumbnail": "https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjUtMTIvMDE5YjMzNzYtMzNiMC03YjRjLWI3MDktZDg4MjdhMjEwYzhlLmpwZw==.jpg",
    "pubDate": "2025-12-22T18:19:07+00:00"
  },
  {
    "title": "Nintendo's holiday sale on Switch and Switch 2 games has some great deals",
    "description": "Switch and Switch 2 games are on sale in Nintendo's holiday hits sale, including Minecraft, Super Mario Odyssey, and Hades 2.",
    "link": "https://www.polygon.com/nintendo-switch-2-holiday-sale-games-discounts/",
    "thumbnail": "https://static0.polygonimages.com/wordpress/wp-content/uploads/2025/12/mario-christmas.jpg?w=1600&h=900&fit=crop",
    "pubDate": "2025-12-22T18:17:43+00:00"
  },
  {
    "title": "Why Warner Bros. Discovery shareholders might opt for Paramount's offer — and why they might not",
    "description": "WBD shareholders must weigh pros and cons of tendering their shares to Paramount for $30 per share. CNBC lays out the arguments on both sides.",
    "link": "https://www.cnbc.com/2025/12/22/paramount-wbd-tender-offer-arguments.html",
    "thumbnail": "https://image.cnbcfm.com/api/v1/image/108244454-1766185236909-Side_by_Side_template.jpg?v=1766425031&w=1920&h=1080",
    "pubDate": "2025-12-22T18:09:08+00:00"
  },
  {
    "title": "Crypto prices again muted as gold surges to new record, U.S. stocks advance",
    "description": "Bitcoin for the moment was unable to hold the $90,000 level reached prior to the U.S. market open.",
    "link": "https://www.coindesk.com/markets/2025/12/22/crypto-prices-again-muted-as-gold-surges-to-new-record-u-s-stocks-advance",
    "thumbnail": "https://cdn.sanity.io/images/s3y3vcno/production/3fefd4274e66ebe6fa9b269e9039d7f0e3e7896d-5000x3111.jpg?auto=format&w=960&h=540&crop=focalpoint&fit=clip&q=75&fm=jpg",
    "pubDate": "2025-12-22T17:45:30+00:00"
  },
  {
    "title": "The Great Flood is Netflix's newest K-brand top movie",
    "description": "The Great Flood is Netflix’s top movie thanks to its gripping sci-fi disaster plot, believable stakes, and shocking twist ending.",
    "link": "https://www.polygon.com/netflix-the-great-flood-korean-sci-fi-disaster-movie/",
    "thumbnail": "https://static0.polygonimages.com/wordpress/wp-content/uploads/2025/12/greatflood_firstlook_1.jpg?w=1600&h=900&fit=crop",
    "pubDate": "2025-12-22T17:40:36+00:00"
  },
  {
    "title": "After the Assad Regime’s Fall, His Enforcers Are Lying Low and Living Large",
    "description": "A Times investigation into the whereabouts of top Syrian officials who fled after the regime’s fall shows many remain free — shielded by wealth and accommodating host nations.",
    "link": "https://www.nytimes.com/2025/12/22/world/middleeast/assad-syria-enforcers-lives-now.html",
    "thumbnail": "https://static01.nyt.com/images/2025/12/20/video/xxvi-enforcers-HTLN-NEW/xxvi-enforcers-HTLN-NEW-facebookJumbo.png",
    "pubDate": "2025-12-22T17:40:24+00:00"
  },
  {
    "title": "BNB at $860 lags broader market as scrutiny of Binance grows",
    "description": "An FT report alleged Binance failed to stop suspicious transactions, despite agreeing to pay $4.3 billion to settle a U.S. criminal case in 2023.",
    "link": "https://www.coindesk.com/markets/2025/12/22/bnb-lags-market-despite-break-above-usd860-as-scrutiny-of-binance-grows",
    "thumbnail": "https://cdn.sanity.io/images/s3y3vcno/production/56d1830a3eb04636993db4e0ff7b1a283fe9ba88-700x430.png?auto=format&w=960&h=540&crop=focalpoint&fit=clip&q=75&fm=jpg",
    "pubDate": "2025-12-22T17:32:33+00:00"
  },
  {
    "title": "How US banks are quietly preparing for an onchain future",
    "description": "Behind the scenes, US banks are rebuilding core financial infrastructure so cash, custody and funds can move onchain under regulatory oversight.",
    "link": "https://cointelegraph.com/news/how-us-banks-are-quietly-preparing-for-an-onchain-future?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
    "thumbnail": "https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjUtMDgvMDE5OGFhYzUtMTA4Ni03YTc2LThhNGYtZTFjZTkxYTI5MjY2.jpg",
    "pubDate": "2025-12-22T17:24:10+00:00"
  },
  {
    "title": "Alphabet to acquire data center and energy infrastructure company Intersect",
    "description": "Alphabet said the acquisition will help bring more data center and generation capacity online faster.",
    "link": "https://www.cnbc.com/2025/12/22/alphabet-to-acquire-intersect.html",
    "thumbnail": "https://image.cnbcfm.com/api/v1/image/108226430-1763156552157-gettyimages-2246165387-7texasgov.jpeg?v=1763156676&w=1920&h=1080",
    "pubDate": "2025-12-22T17:20:36+00:00"
  },
  {
    "title": "Best attributes to level up in Clair Obscur Expedition 33",
    "description": "Attributes determine the stats of party members in Clair Obscur: Expedition 33. Here are the best attributes to level up in Clair Obscur: Expedition 33.",
    "link": "https://www.polygon.com/clair-obscur-expedition-33-guides/562119/attributes-best-all/",
    "thumbnail": "https://static0.polygonimages.com/wordpress/wp-content/uploads/2025/04/maelle-expedition-33.jpeg?w=1600&h=900&fit=crop",
    "pubDate": "2025-12-22T17:15:49+00:00"
  },
  {
    "title": "Coinbase agrees to buy The Clearing Company to deepen prediction markets push",
    "description": "The deal brings a team with specialized experience building event-based trading systems, including veterans from Polymarket and Kalshi.",
    "link": "https://www.coindesk.com/business/2025/12/22/coinbase-agrees-to-buy-the-clearing-company-to-deepen-prediction-markets-push",
    "thumbnail": "https://cdn.sanity.io/images/s3y3vcno/production/2f3568ba988df704ac0fc97e2593677bdcbf178e-1920x1080.jpg?auto=format&w=960&h=540&crop=focalpoint&fit=clip&q=75&fm=jpg",
    "pubDate": "2025-12-22T17:01:27+00:00"
  },
  {
    "title": "The 10 best adventure games of 2025",
    "description": "2025 was a standout year for adventure games that pushed the boundaries of what the genre can be",
    "link": "https://www.polygon.com/best-adventure-games-2025/",
    "thumbnail": "https://static0.polygonimages.com/wordpress/wp-content/uploads/2025/12/best-adventure-games-2025.jpg?w=1600&h=900&fit=crop",
    "pubDate": "2025-12-22T17:00:15+00:00"
  },
  {
    "title": "ETHZilla sells $74.5 million of ether in effort to trim debt load",
    "description": "This is the company's second sale of part of its ETH treasury, following a $40 million sale in October to fund share repurchases.",
    "link": "https://www.coindesk.com/business/2025/12/22/ethzilla-sells-usd74-5-million-of-ether-in-effort-to-trim-debt-load",
    "thumbnail": "https://cdn.sanity.io/images/s3y3vcno/production/4853dd74c80fc2679cc738a259a38b305149f867-3840x2160.png?auto=format&w=960&h=540&crop=focalpoint&fit=clip&q=75&fm=jpg",
    "pubDate": "2025-12-22T16:53:44+00:00"
  },
  {
    "title": "U.S. bipartisan lawmakers draw up tax bill with stablecoin and staking relief",
    "description": "New House proposal would exempt some stablecoin payments from capital gains taxes and allow stakers to defer income recognition for up to five years.",
    "link": "https://www.coindesk.com/policy/2025/12/22/u-s-bipartisan-lawmakers-draw-up-tax-bill-with-stablecoin-and-staking-relief",
    "thumbnail": "https://cdn.sanity.io/images/s3y3vcno/production/11d38e96067e18f4d9e1e0057cdf51ebefe2cca9-1920x1080.jpg?auto=format&w=960&h=540&crop=focalpoint&fit=clip&q=75&fm=jpg",
    "pubDate": "2025-12-22T16:18:14+00:00"
  },
  {
    "title": "BlackRock names bitcoin ETF a top 2025 theme despite price slump",
    "description": "The world's largest asset manager is promoting its underperforming bitcoin fund over higher-fee winners, signaling long-term commitment.",
    "link": "https://www.coindesk.com/markets/2025/12/22/blackrock-names-bitcoin-etf-a-top-2025-theme-despite-price-slump",
    "thumbnail": "https://cdn.sanity.io/images/s3y3vcno/production/41cbb7ee40d94b98973687037c93204cb2d611a6-1920x1080.jpg?auto=format&w=960&h=540&crop=focalpoint&fit=clip&q=75&fm=jpg",
    "pubDate": "2025-12-22T16:01:13+00:00"
  },
  {
    "title": "CME loses top spot to Binance in bitcoin futures open interest as institutional demand wanes",
    "description": "Behind the move is a sharp narrowing in the profitability of the basis trade, in which traders attempt to capture a spread by buying spot bitcoin while selling BTC futures.",
    "link": "https://www.coindesk.com/markets/2025/12/22/cme-loses-top-spot-to-binance-in-bitcoin-futures-open-interest-as-institutional-demand-wanes",
    "thumbnail": "https://cdn.sanity.io/images/s3y3vcno/production/1bcf4c0f104cf5c93e93443baef20058cd93c32a-3200x1800.png?auto=format&w=960&h=540&crop=focalpoint&fit=clip&q=75&fm=jpg",
    "pubDate": "2025-12-22T15:46:19+00:00"
  },
  {
    "title": "Filecoin climbs after breaking above $1.29 resistance zone",
    "description": "Technical momentum built as institutional flows drove price through key resistance levels amid an 87% volume surge above average.",
    "link": "https://www.coindesk.com/markets/2025/12/22/filecoin-climbs-after-breaking-above-usd1-29-resistance-zone",
    "thumbnail": "https://cdn.sanity.io/images/s3y3vcno/production/8d5d441f4d5317c073228483f261397bbdedbac7-700x430.png?auto=format&w=960&h=540&crop=focalpoint&fit=clip&q=75&fm=jpg",
    "pubDate": "2025-12-22T15:07:14+00:00"
  },
  {
    "title": "Chris Rea: The car enthusiast whose love of driving inspired his songs",
    "description": "The rock and blues singer's love of cars and driving was the inspiration for many of his songs.",
    "link": "https://www.bbc.com/news/articles/c51y93wqv5po?at_medium=RSS&at_campaign=rss",
    "thumbnail": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/4109/live/6ec31250-df49-11f0-b67b-690eb873de1b.jpg",
    "pubDate": "2025-12-22T15:05:31+00:00"
  },
  {
    "title": "The clock is ticking for crypto tax loss harvesting",
    "description": "Investors might be able to take advantage of the recent crypto market downturn in order to lower their taxable income.",
    "link": "https://www.coindesk.com/opinion/2025/12/22/the-clock-is-ticking-for-crypto-tax-loss-harvesting",
    "thumbnail": "https://cdn.sanity.io/images/s3y3vcno/production/5c7143f754bd073deb1cd2283317f351a0c34727-1920x1080.jpg?auto=format",
    "pubDate": "2025-12-22T14:35:59+00:00"
  },
  {
    "title": "Brick trophies, a life-size pink Cadillac and a team sponsorship: Why Lego is going all in on F1",
    "description": "Lego and Formula 1 kicked off a multiyear partnership in 2025. Here's how that collaboration is providing value to the toy company and the racing organization.",
    "link": "https://www.cnbc.com/2025/12/22/lego-formula-1-partnership-fan-base.html",
    "thumbnail": "https://image.cnbcfm.com/api/v1/image/108243077-1765992210577-gettyimages-2247578026-hv3_6895_f2d8u6s2.jpeg?v=1766162524&w=1920&h=1080",
    "pubDate": "2025-12-22T13:30:01+00:00"
  },
  {
    "title": "As Trump Clings to Tariffs, His Argentine Ally Is Opening Up to Trade",
    "description": "President Javier Milei is eliminating barriers to what had been a closed-off economy, moving in the opposite direction of his main political ally, President Trump.",
    "link": "https://www.nytimes.com/2025/12/22/world/americas/argentina-trade.html",
    "thumbnail": "https://static01.nyt.com/images/2025/12/22/multimedia/22int-argentina-consumption-promo/22int-argentina-consumption-jczq-facebookJumbo.jpg",
    "pubDate": "2025-12-22T12:59:57+00:00"
  },
  {
    "title": "Artists We Lost in 2025, in Their Words",
    "description": "Robert Redford, Roberta Flack, Diane Keaton and Brian Wilson are among the cultural luminaries who died this year.",
    "link": "https://www.nytimes.com/2025/12/22/arts/artists-who-died-in-2025.html",
    "thumbnail": "https://static01.nyt.com/images/2025/12/22/arts/22cul-artists-we-lost-promo/22cul-artists-we-lost-promo-facebookJumbo.jpg",
    "pubDate": "2025-12-22T10:02:31+00:00"
  },
  {
    "title": "Upstart Holdings (UPST): Firm Announces New Castlelake Deal",
    "description": "",
    "link": "https://finance.yahoo.com/news/upstart-holdings-upst-firm-announces-135907143.html",
    "thumbnail": "https://s.yimg.com/ny/api/res/1.2/NpOokCLt9vz0R1.0yvt7hQ--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyMDA7aD02NzM-/https://media.zenfs.com/en/insidermonkey.com/e480daa5fdabbe22c18ded0fa6c0e9a8",
    "pubDate": "2025-12-21T13:59:07+00:00"
  },
  {
    "title": "Corcept Therapeutics (CORT): Analyst Says Shares Pricing in Growth, New Launch",
    "description": "",
    "link": "https://finance.yahoo.com/news/corcept-therapeutics-cort-analyst-says-135633384.html",
    "thumbnail": "https://s.yimg.com/ny/api/res/1.2/_xfrR9igRsX0eBYubC69DA--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyMDA7aD02NzM-/https://media.zenfs.com/en/insidermonkey.com/78ab86785c75d97be3745dfccc6a7b6a",
    "pubDate": "2025-12-21T13:56:33+00:00"
  },
  {
    "title": "Clearwater Analytics Holdings (CWAN): Activist Investor Wants Share Price Boost",
    "description": "",
    "link": "https://finance.yahoo.com/news/clearwater-analytics-holdings-cwan-activist-135609361.html",
    "thumbnail": "https://s.yimg.com/ny/api/res/1.2/ZCvTUjX_h7aq8U.aoehoIQ--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyMDA7aD04MDE-/https://media.zenfs.com/en/insidermonkey.com/b682effc3adb08bae339f99ce68be88b",
    "pubDate": "2025-12-21T13:56:09+00:00"
  },
  {
    "title": "Wingstop (WING): RBC Highlights Growth, Long US Runway",
    "description": "",
    "link": "https://finance.yahoo.com/news/wingstop-wing-rbc-highlights-growth-135428834.html",
    "thumbnail": "https://s.yimg.com/ny/api/res/1.2/NQUawO_tXCgOibqSWfCAdQ--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyMDA7aD02NzM-/https://media.zenfs.com/en/insidermonkey.com/5c231b38bc4aca5c07d84e81f8b874c2",
    "pubDate": "2025-12-21T13:54:28+00:00"
  },
  {
    "title": "ADMA Biologics (ADMA): Firm Updates 2025 Revenue Guidance",
    "description": "",
    "link": "https://finance.yahoo.com/news/adma-biologics-adma-firm-updates-135405002.html",
    "thumbnail": "https://media.zenfs.com/en/insidermonkey.com/65a5717a42757539d7cbd4f916b5721f",
    "pubDate": "2025-12-21T13:54:05+00:00"
  },
  {
    "title": "Dutch Bros (BROS): KeyBanc Highlights Compelling Growth Story",
    "description": "",
    "link": "https://finance.yahoo.com/news/dutch-bros-bros-keybanc-highlights-135348384.html",
    "thumbnail": "https://s.yimg.com/ny/api/res/1.2/AF59y1_4WOSaHkOSZ9Vxjg--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyMDA7aD04MDA-/https://media.zenfs.com/en/insidermonkey.com/f7b3d5bf0b3c5442141341e739eacff5",
    "pubDate": "2025-12-21T13:53:48+00:00"
  },
  {
    "title": "VOO vs. MGK: Is S&amp;P 500 Diversification or Mega-Cap Growth the Better Buy for Investors?",
    "description": "",
    "link": "https://finance.yahoo.com/news/voo-vs-mgk-p-500-133501708.html",
    "thumbnail": "https://s.yimg.com/ny/api/res/1.2/Husy1gO1TQyUkfDYXmhUnQ--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyMDA7aD0xMDcy/https://media.zenfs.com/en/motleyfool.com/6b28a065be0b5031477267afbc8e62a9",
    "pubDate": "2025-12-21T13:35:01+00:00"
  },
  {
    "title": "The Stock Market Is Doing Something It's Only Done Twice Since 1871 -- Should You Be Worried for 2026?",
    "description": "",
    "link": "https://finance.yahoo.com/news/stock-market-doing-something-only-133500587.html",
    "thumbnail": "https://s.yimg.com/ny/api/res/1.2/DUbvE3_ZyTVle4e__SmOCA--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyMDA7aD04MDE-/https://media.zenfs.com/en/motleyfool.com/0fb40435d7b3b857391f622d8d1cf6d6",
    "pubDate": "2025-12-21T13:35:00+00:00"
  },
  {
    "title": "Jeff Bezos warned Americans not to buy a new 'refrigerator, or whatever.’ Fearmongering, or good advice for 2026?",
    "description": "",
    "link": "https://finance.yahoo.com/news/jeff-bezos-warned-americans-not-133300541.html",
    "thumbnail": "https://media.zenfs.com/en/moneywise_ecomm_711/f654e77ec69b2999a7bf0c69403917da",
    "pubDate": "2025-12-21T13:33:00+00:00"
  },
  {
    "title": "Here's your big free reminder on AI stocks for 2026",
    "description": "",
    "link": "https://finance.yahoo.com/news/heres-your-big-free-reminder-on-ai-stocks-for-2026-133036552.html",
    "thumbnail": "https://s.yimg.com/ny/api/res/1.2/U2r6.IjquVcth3677uPeUg--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyMDA7aD04MDA-/https://s.yimg.com/os/creatr-uploaded-images/2025-12/0d318710-dd05-11f0-9faf-6e529c4493ea",
    "pubDate": "2025-12-21T13:30:36+00:00"
  }
]