[
  {
    "title": "‘No work’: India’s Alang, the world’s largest graveyard of ships, is dying",
    "description": "The Gujarati town accounts for nearly 98 percent of India’s total and about a third of the global ship recycling volume.",
    "link": "https://www.aljazeera.com/news/2025/12/15/no-work-indias-alang-the-worlds-largest-graveyard-of-ships-is-dying?traffic_source=rss",
    "thumbnail": "https://www.aljazeera.com/wp-content/uploads/2025/12/Unused-ships-quickly-become-a-financial-drain-forcing-owners-to-offload-them-even-if-that-means-dismantling-them-long-before-their-intended-lifespan_-1765196942.jpg?resize=1200%2C630",
    "pubDate": "2025-12-15T05:20:49+00:00"
  },
  {
    "title": "LA police investigate 'apparent homicide' at Rob Reiner's home",
    "description": "Authorities were called the storied Hollywood director's home on Sunday and found the bodies of a man, 78, and a woman, 68.",
    "link": "https://www.bbc.com/news/articles/cz0np02znezo?at_medium=RSS&at_campaign=rss",
    "thumbnail": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/e453/live/cf9107e0-d968-11f0-b67b-690eb873de1b.jpg",
    "pubDate": "2025-12-15T04:45:46+00:00"
  },
  {
    "title": "Hong Kong court convicts democracy activist Jimmy Lai on conspiracy charges",
    "description": "Advocates have described the verdict as an 'unlawful' decision based on 'trumped-up national security charges'.",
    "link": "https://www.aljazeera.com/news/2025/12/15/hong-kong-court-convicts-democracy-activist-jimmy-lai-on-conspiracy-charges?traffic_source=rss",
    "thumbnail": "https://www.aljazeera.com/wp-content/uploads/2025/12/AP25348133895375-1765768888.jpg?resize=1920%2C1440",
    "pubDate": "2025-12-15T04:31:06+00:00"
  },
  {
    "title": "XRP Fails to Clear $2.00 for Third Time, Setting Up Near-Term Inflection Point",
    "description": "Despite positive institutional developments, XRP's price remains disconnected from broader market improvements.",
    "link": "https://www.coindesk.com/markets/2025/12/15/xrp-fails-to-clear-usd2-00-for-third-time-setting-up-near-term-inflection-point",
    "thumbnail": "https://cdn.sanity.io/images/s3y3vcno/production/78cd770b3be0f39de16936d1aa7a7a30bbac7558-1920x1080.jpg?auto=format&w=960&h=540&crop=focalpoint&fit=clip&q=75&fm=jpg",
    "pubDate": "2025-12-15T04:29:36+00:00"
  },
  {
    "title": "BBC reports from Bondi gunmen's suburban house",
    "description": "BBC News Australia correspondent Katy Watson visited the house in the Sydney suburb of Bonnyrigg.",
    "link": "https://www.bbc.com/news/videos/cqxqyxxgzr4o?at_medium=RSS&at_campaign=rss",
    "thumbnail": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/68ba/live/83091030-d96c-11f0-a8dc-93c15fe68710.jpg",
    "pubDate": "2025-12-15T04:19:17+00:00"
  },
  {
    "title": "Hong Kong court finds pro-democracy activist Jimmy Lai guilty of sedition and collusion with foreign forces",
    "description": "The 78-year-old was charged under Hong Kong's controversial national security law, enacted by Beijing in 2020.",
    "link": "https://www.cnbc.com/2025/12/15/hong-kong-court-finds-pro-democracy-activist-jimmy-lai-guilty-of-collusion-with-foreign-forces.html",
    "thumbnail": "https://image.cnbcfm.com/api/v1/image/108241609-1765758501740-gettyimages-1231052375-HK_JIMMY_LAI.jpeg?v=1765758540&w=1920&h=1080",
    "pubDate": "2025-12-15T04:07:18+00:00"
  },
  {
    "title": "Pokemon TCG Mega Charizard Ultra-Premium Collection Restocked With $50 Price Cut At Amazon",
    "description": "Pokemon TCG: Mega Charizard X ex Ultra-Premium Collection $165 (was $250) See at Amazon Mega Kangaskhan ex Box $44 (was $44.75) See at Amazon Amazon has restocked the recently released Pokemon TCG Ultra-Premium Collection with a lower price point than it originally. The Mega Charizard X ex Ultra-Premium Collection is available for $165 (was $250) as of December 14. Released alongside the Mega Evolution - Phantasmal Flames expansion set, the Mega Charizard Ultra-Premium Collection had sold for as high as $250 and was $211 on launch day (November 14). For more context, the price was $200 when it sold out a few weeks ago, so the large bundle is unlikely to stay in stock for too long. Pokemon TCG: Mega Charizard X ex Ultra-Premium Collection $165 (was $250) The Mega Charizard-themed Ultra-Premium Collection comes with multiple promo cards, 18 Booster Packs, and a bunch of accessories, including a stylish Charizard X ex playmat and deck box. Here's the full list of what's in the box: 1 Foil Promo Card - Mega Charizard X ex 1 Foil Promo Card - Oricorio ex 18 Pokemon TCG Booster Packs Playmat with Mega Charizard X artwork Metal Coin featuring Mega Charizard X 6 Damage-Counter Dice Pokemon TCG Live Code Card The 18 Booster Packs are from a mix of expansion sets, including Phantasmal Flames, Mega Evolution, Destined Rivals, Journey Together, and more. See at Amazon Pokemon Trading Card Game: New Releases (December 2025) Mega Kangaskhan ex Box / Mega Venusaur ex Premium CollectionAmazon has also added a few new Pokemon Trading Card Game products to its storefront this month. The Lugia ex &amp; Latias ex Premium Collection just popped up on Amazon December 12. The listing shows an image of an old Charizard ex Special Collection, but this is the new Premium Collection with Lugia ex and Latias ex promo cards, an oversized Lugia ex card, and 10 Pokemon TCG Booster Packs. Other new listings include the Pokemon TCG Fall 2025 Collector Chest, Mega Kangaskhan ex Box, Team Rocket's Mewtwo ex League Battle Deck, and Mega Venusaur ex Premium Collection. All of those are in stock at the time of writing with the exception of Mega Venusaur, which has been going in and out of stock. Lugia ex &amp; Latias ex Premium Collection $99.16 See at Amazon Mega Venusaur ex Premium Collection $60 (was $78) Check stock at Amazon Pokemon Trading Card Game: What's in stock? We've included a list of all of the Pokemon Trading Card Game products that are in stock--sold and shipped by Amazon--below. Pokemon TCG stock fluctuates frequently each week, both in terms of availability and price. Several Phantasmal Flames products are available, including the Booster Bundle and Booster Blister. Amazon also has Prismatic Evolutions Booster Bundles and Destined Rivals Booster Bundles in stock for the first time in a while. Continue Reading at GameSpot",
    "link": "https://www.gamespot.com/articles/pokemon-trading-card-game-mega-charizard-x-ultra-premium-collection-amazon-best-price/1100-6536074/?ftag=CAD-01-10abi2f",
    "thumbnail": "https://www.gamespot.com/a/uploads/screen_kubrick/1595/15950357/4622644-4600144-megacharizardpokemontcgthumbnail.jpg",
    "pubDate": "2025-12-15T04:01:00+00:00"
  },
  {
    "title": "China's retail sales growth sharply misses estimates in November, deepening consumption worries",
    "description": "China's retail sales growth and industrial production missed estimates in November while investment declined more than expected.",
    "link": "https://www.cnbc.com/2025/12/15/chinas-november-retail-sales-industrial-production-fixed-asset-investment.html",
    "thumbnail": "https://image.cnbcfm.com/api/v1/image/108241556-1765610729588-gettyimages-2246895310-20090101251119-99-688196.jpeg?v=1765610763&w=1920&h=1080",
    "pubDate": "2025-12-15T03:45:59+00:00"
  },
  {
    "title": "Jimmy Lai’s Life, in Photos and Video",
    "description": "He attributed his rags-to-riches ascent to the freedoms of Hong Kong, and has paid a hefty price for defending them.",
    "link": "https://www.nytimes.com/2025/12/14/world/asia/jimmy-lai-photos-video.html",
    "thumbnail": "https://static01.nyt.com/images/2025/12/15/multimedia/15int-HK-jimmy-lai-visual-wlkq/15int-HK-jimmy-lai-visual-wlkq-facebookJumbo.jpg",
    "pubDate": "2025-12-15T03:42:14+00:00"
  },
  {
    "title": "José Antonio Kast Elected President of Chile",
    "description": "José Antonio Kast has promised to reverse Chile’s recent surge in violent crime. He also says he will deport undocumented migrants.",
    "link": "https://www.nytimes.com/2025/12/14/world/americas/chile-election-kast.html",
    "thumbnail": "https://static01.nyt.com/images/2025/12/14/multimedia/14int-chile-election-wtk01-photo-czjb/14int-chile-election-wtk01-photo-czjb-facebookJumbo.jpg",
    "pubDate": "2025-12-15T03:20:18+00:00"
  },
  {
    "title": "It: Welcome to Derry season 2: Cast, plot, timeline, and release date theories",
    "description": "Get the latest on It: Welcome to Derry Season 2—release date, returning cast, plot hints, and all the updates fans are waiting for.",
    "link": "https://www.polygon.com/it-welcome-to-derry-season-2-everything-we-know-so-far/",
    "thumbnail": "https://static0.polygonimages.com/wordpress/wp-content/uploads/2025/12/bill-skarsgard_4.jpg?w=1600&h=900&fit=crop",
    "pubDate": "2025-12-15T03:00:26+00:00"
  },
  {
    "title": "Oxfam chief forced to step down over 'serious issues' with conduct, charity says",
    "description": "The charity's trustees say Dr Halima Begum's position was \"untenable\" following an independent review of her behaviour.",
    "link": "https://www.bbc.com/news/articles/cvgjp6y13q0o?at_medium=RSS&at_campaign=rss",
    "thumbnail": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/319d/live/c135ff20-d95e-11f0-a8a9-5322ff02ea00.jpg",
    "pubDate": "2025-12-15T02:38:52+00:00"
  },
  {
    "title": "Asia Morning Briefing: Bitcoin Drifts Near $89K as Traders Step Back and Balance Sheets Step In",
    "description": "FlowDesk sees fading post-Fed demand and low leverage, while Glassnode data show digital asset treasuries quietly resuming bitcoin accumulation in a range-bound market.",
    "link": "https://www.coindesk.com/markets/2025/12/15/asia-morning-briefing-bitcoin-drifts-near-usd89k-as-traders-step-back-and-balance-sheets-step-in",
    "thumbnail": "https://cdn.sanity.io/images/s3y3vcno/production/56985dd3c86975489de193049979987f113266f0-1920x1080.jpg?auto=format&w=960&h=540&crop=focalpoint&fit=clip&q=75&fm=jpg",
    "pubDate": "2025-12-15T02:28:26+00:00"
  },
  {
    "title": "South Korea stocks lead losses in Asia-Pacific as investors parse key data from China",
    "description": "China will release its November retail sales, fixed asset investment and industrial output numbers.",
    "link": "https://www.cnbc.com/2025/12/15/asia-markets-live-nikkei-kospi-hang-seng.html",
    "thumbnail": "https://image.cnbcfm.com/api/v1/image/108189952-1755938264412-gettyimages-1288284423-vcg111308320551.jpeg?v=1764545862&w=1920&h=1080",
    "pubDate": "2025-12-15T02:22:51+00:00"
  },
  {
    "title": "Hospitalized Brown Student Describes Hiding from Shooter",
    "description": "The student, in his first year at Brown, described helping others who were more seriously injured than he was as they hid in their classroom.",
    "link": "https://www.nytimes.com/2025/12/14/us/brown-shooting-witness-spencer-yang.html",
    "thumbnail": "https://static01.nyt.com/images/2025/12/14/multimedia/14brown-shooting-hospital-victim--tvfw/14brown-shooting-hospital-victim--tvfw-facebookJumbo.jpg",
    "pubDate": "2025-12-15T01:38:10+00:00"
  },
  {
    "title": "California Hires Former C.D.C. Officials Who Criticized Trump Administration",
    "description": "A former director of the Centers for Disease Control and Prevention and a former chief medical officer of the agency will advise the state on public health issues.",
    "link": "https://www.nytimes.com/2025/12/14/us/california-newsom-cdc-trump.html",
    "thumbnail": "https://static01.nyt.com/newsgraphics/images/icons/defaultPromoCrop.png",
    "pubDate": "2025-12-15T00:58:27+00:00"
  },
  {
    "title": "Paramedic 'sent flying' in Liverpool parade attack",
    "description": "James Vernon said \"adrenaline kicked in\" allowing him to help the stricken victims of Paul Doyle.",
    "link": "https://www.bbc.com/news/articles/cze88rzxy4jo?at_medium=RSS&at_campaign=rss",
    "thumbnail": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/bf2b/live/9f39cc00-d786-11f0-b0ee-a9375724f730.jpg",
    "pubDate": "2025-12-15T00:41:12+00:00"
  },
  {
    "title": "Can I just check - are my emails holding me back at work?! Xx",
    "description": "What impact is my email etiquette having on how I'm perceived, evaluated and promoted at work?",
    "link": "https://www.bbc.com/news/articles/cvg118dqj2no?at_medium=RSS&at_campaign=rss",
    "thumbnail": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/ecc8/live/79528f30-d773-11f0-a2f6-d1a7a2bd5458.jpg",
    "pubDate": "2025-12-15T00:38:09+00:00"
  },
  {
    "title": "The difficult question of what it would take to stop Putin fighting in Ukraine",
    "description": "As peace talks continue in Berlin, what - if anything - could potentially change Putin's mind? And could Europe do anything differently?",
    "link": "https://www.bbc.com/news/articles/clyzzxggl7go?at_medium=RSS&at_campaign=rss",
    "thumbnail": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/3768/live/54458190-d767-11f0-a892-01d657345866.jpg",
    "pubDate": "2025-12-15T00:21:59+00:00"
  },
  {
    "title": "Russia poses acute threat, new MI6 chief to warn",
    "description": "Blaise Metreweli will say the threat is posed by \"an aggressive, expansionist and revisionist Russia\".",
    "link": "https://www.bbc.com/news/articles/cgqzed1vjw5o?at_medium=RSS&at_campaign=rss",
    "thumbnail": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/7ca2/live/81cdf9a0-4a89-11f0-9471-e380f647874e.jpg",
    "pubDate": "2025-12-15T00:18:40+00:00"
  },
  {
    "title": "Chile elects far-right José Antonio Kast as next president",
    "description": "Many believe Kast will be the most right-wing president since Augusto Pinochet, who oversaw a 17-year dictatorship in Chile from 1973.",
    "link": "https://www.bbc.com/news/articles/c0kde07lvvro?at_medium=RSS&at_campaign=rss",
    "thumbnail": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/e136/live/2fdd79e0-d945-11f0-a3ee-1fa9ed21642f.jpg",
    "pubDate": "2025-12-15T00:15:01+00:00"
  },
  {
    "title": "Mbappe returns at Alaves to ease Real pressure on Madrid coach Alonso",
    "description": "French superstar Kylian Mbappe scores on his return from injury to help Real Madrid to a crucial 2-1 win at Alaves.",
    "link": "https://www.aljazeera.com/sports/2025/12/14/mbappe-returns-at-alaves-to-ease-real-pressure-on-madrid-coach-alonso?traffic_source=rss",
    "thumbnail": "https://www.aljazeera.com/wp-content/uploads/2025/12/GettyImages-2251899786-1765744242.jpg?resize=1200%2C675",
    "pubDate": "2025-12-14T22:54:13+00:00"
  },
  {
    "title": "What We Know About the Bondi Beach Shooting in Australia",
    "description": "Two gunmen opened fire at dozens of people who were at a Jewish holiday event. At least 15 people were killed in the attack, and so was one of the shooters, the police said.",
    "link": "https://www.nytimes.com/2025/12/14/world/australia/what-we-know-bondi-shooting.html",
    "thumbnail": "https://static01.nyt.com/images/2025/12/14/multimedia/14sydney-shooting-wwk01-bfzq/14sydney-shooting-wwk01-bfzq-facebookJumbo.jpg",
    "pubDate": "2025-12-14T22:46:39+00:00"
  },
  {
    "title": "Inside the Clintons’ Fight to Avoid Testifying in the House Epstein Inquiry",
    "description": "Bill and Hillary Clinton have repeatedly offered to provide sworn statements, but Representative James R. Comer has threatened to hold them in contempt of Congress if they fail to appear.",
    "link": "https://www.nytimes.com/2025/12/14/us/politics/clintons-epstein-inquiry.html",
    "thumbnail": "https://static01.nyt.com/images/2025/12/14/multimedia/14dc-Clintons-wpfk/14dc-Clintons-wpfk-facebookJumbo-v2.jpg",
    "pubDate": "2025-12-14T22:43:57+00:00"
  },
  {
    "title": "Far-right candidate Jose Antonio Kast wins Chile’s presidential election",
    "description": "Kast's victory is seen as part of a trend of right-wing victories across Latin America, including in Argentina.",
    "link": "https://www.aljazeera.com/news/2025/12/14/far-right-candidate-jose-antonio-kast-wins-chiles-presidential-election?traffic_source=rss",
    "thumbnail": "https://www.aljazeera.com/wp-content/uploads/2025/12/AP25348490560209-1765753904.jpg?resize=1920%2C1440",
    "pubDate": "2025-12-14T22:42:17+00:00"
  },
  {
    "title": "Dragon Quest I &amp; II HD-2D Remake Drops To $40 For Switch And Switch 2",
    "description": "Dragon Quest I &amp; II HD-2D Remake (Switch 1/2, PS5, Xbox) $40 (was $60) See at Amazon See at Target See at Walmart Dragon Quest III HD-2D Remake (Switch 1/2, PS5, Xbox) $35 (was $60) See at Amazon See at Walmart See at Target Dragon Quest Illustrations by Akira Toriyama $17.68 (was $35) See at Amazon Dragon Quest fans can get Square Enix's HD-2D Remakes of the first three mainline games in the iconic RPG series for the best prices yet. Dragon Quest I &amp; II HD-2D Remake is discounted to $40 (was $60) on Nintendo Switch and Switch 2 at Amazon and Target. The PS5 and Xbox editions are up for grabs for $50, which is the all-time low for those platforms, too. Considering the two-game collection launched October 30, we wouldn't expect the $40 deals to remain in stock for long. You can complete the original trilogy by picking up Dragon Quest III HD-2D Remake for $35 on Switch 1/2 or PS5; the Xbox edition is a few bucks cheaper at Amazon. The $35 deal matches Amazon's Black Friday price. Fans should also check out Amazon's 50% discount on the hardcover art book Dragon Quest Illustrations. Dragon Quest I &amp; II HD-2D Remake (Switch 1/2, PS5, Xbox) $40 (was $60) Like all Square Enix games for Switch 2 so far, the Nintendo Switch 2 version is a Game-Key Card that requires a 17GB download. If this bothers you, the Nintendo Switch version has the full game on the card and is fully playable on Nintendo's new console. Dragon Quest I &amp; II HD-2D Remake earned favorable reviews from critics; it holds an 84 Metascore on GameSpot sister site Metacritic. Just like Square's other HD-2D remakes, the first two Dragon Quest games look and run beautifully on all platforms. The updated visuals are bolstered by the new orchestral soundtrack. Square Enix implemented a bevy of welcome gameplay changes to give players more customization options. You'll also find new dungeons, meet new characters, and watch a more cohesive story unfold between the two games and DQIII. The first game is still a solo adventure for the Hero, but a new playable character in the sequel gives you the chance to have a \"modern four-member party. If you're in the mood for a couple of thoroughly retro turn-based RPGs that don't feel like a full-time job, this collection is well-worth checking out. Dragon Quest I can be completed in 10-15 hours, and the sequel is roughly 20 hours. Amazon Deals: Nintendo Switch -- $40 ($60) Nintendo Switch 2 -- $40 ($60) PS5 -- $50 ($60) Xbox Series X -- $50 ($60) Target Deals: Nintendo Switch -- $40 ($60) Nintendo Switch 2 -- $40 ($60) See at Amazon See at Target See at Walmart Dragon Quest III HD-2D Remake (Switch 1/2, PS5, Xbox) $35 (was $60) The Nintendo Switch and PS5 editions of Dragon Quest III HD-2D Remake are on sale for only $35 at Amazon. The Xbox version is available for $32. The PS5 edition is also available for $35 at Walmart, and the Xbox edition is $35 at Target. Walmart and Target are sold out of copies on the other platforms. Unlike Dragon Quest I &amp; II, this one has a Nintendo Switch 2 upgrade that enhances visuals and improves overall performance. The Switch 2 upgrade can be downloaded for free from the eShop. Dragon Quest I &amp; II HD-2D Remake completed Square Enix's Erdrick Trilogy--also known as Roto/Loto Trilogy--remake project that started last year with Dragon Quest III. The remakes were released in this order, because the third numbered entry actually takes place before DQ1. So if you're interested in trying classic Dragon Quest for the first time, Dragon Quest III HD-2D Remake is a great place to start. Dragon Quest III was the first entry in the series to feature a job system and emphasize working alongside your companions as a true party. It's also a much larger game, with more places to explore and longer runtime; it takes roughly as long to beat DQIII as it does to clear the first two games combined. Amazon Deals: Nintendo Switch -- $35 ($60) PS5 -- $35 ($60) Xbox Series X -- $32 ($60) Walmart Deals: PS5 -- $35 ($60) Target Deals: Xbox -- $35 ($60) See at Amazon See at Walmart See at Target Dragon Quest Illustrations by Akira Toriyama $17.68 (was $35) If you don't own it, we'd highly recommend this lovely Dragon Quest art book. Dragon Quest Illustrations: 30th Anniversary Edition features 240 pages of artwork by the late Akira Toriyama, the legendary lead artist for the franchise from 1986-2023. Dragon Quest Illustrations is on sale for only $17.68 (was $35) at Amazon. The hardcover book includes over 500 illustrations and a fold-out poster of the franchise timeline. See at Amazon Dragon Quest fans have yet another classic to look forward to in the coming months. As announced during the Nintendo Direct in September, Dragon Quest VII Reimagined launches February 5, 2026, for Switch 2, Switch, PS5, and Xbox Series X. Preorders are available now for $60 at Amazon. Continue Reading at GameSpot",
    "link": "https://www.gamespot.com/articles/dragon-quest-hd-2d-remake-trilogy-square-enix-amazon-game-deals/1100-6530455/?ftag=CAD-01-10abi2f",
    "thumbnail": "https://www.gamespot.com/a/uploads/screen_kubrick/1595/15950357/4622625-dragonquestgamesthumbnail.jpg",
    "pubDate": "2025-12-14T22:25:00+00:00"
  },
  {
    "title": "What is the significance of Trump’s deal with Belarus?",
    "description": "The US has eased sanctions on Belarus after the close Russian ally freed more than 100 prisoners.",
    "link": "https://www.aljazeera.com/video/inside-story/2025/12/14/what-is-the-significance-of-trumps-deal-with-belarus?traffic_source=rss",
    "thumbnail": "https://www.aljazeera.com/wp-content/uploads/2025/12/image-1765749756.jpg?resize=1920%2C1061&quality=80",
    "pubDate": "2025-12-14T22:24:23+00:00"
  },
  {
    "title": "Man Tackled and Disarmed One of the Bondi Beach Gunmen, Video Shows",
    "description": "The video, verified by The New York Times, shows a man sneaking up on one of the shooters who targeted a Hanukkah celebration in Sydney on Sunday.",
    "link": "https://www.nytimes.com/2025/12/14/world/australia/bondi-beach-gunman-tackled-video.html",
    "thumbnail": "https://static01.nyt.com/images/2025/12/14/14vid-australia-shooting-56181-cover/14vid-australia-shooting-56181-cover-facebookJumbo-v4.jpg",
    "pubDate": "2025-12-14T22:17:07+00:00"
  },
  {
    "title": "Australia look to seal Ashes series in third Test against England",
    "description": "Al Jazeera takes a look at the third Ashes Test between Australia and England, which is being played in Adelaide.",
    "link": "https://www.aljazeera.com/video/2025/12/14/australia-look-to-seal-ashes-series-in-third-test-against-england?traffic_source=rss",
    "thumbnail": "https://www.aljazeera.com/wp-content/uploads/2025/12/image-1765749265.jpg?resize=1920%2C1061&quality=80",
    "pubDate": "2025-12-14T22:16:31+00:00"
  },
  {
    "title": "JetBlue flight near Venezuela avoids ‘midair collision’ with US tanker",
    "description": "The incident involved JetBlue Flight 1112 from Curacao, which is just off the coast of Venezuela, en route to New York.",
    "link": "https://www.aljazeera.com/news/2025/12/14/jetblue-flight-near-venezuela-avoids-midair-collision-with-us-tanker?traffic_source=rss",
    "thumbnail": "https://www.aljazeera.com/wp-content/uploads/2025/12/ap_693f2dc63afbd-1765748166.jpg?resize=1920%2C1440",
    "pubDate": "2025-12-14T22:16:14+00:00"
  },
  {
    "title": "France calls to delay vote on EU-Mercosur trade deal",
    "description": "Paris says EU member states cannot vote on the trade agreement in its current state.",
    "link": "https://www.aljazeera.com/news/2025/12/14/france-calls-to-delay-vote-on-eu-mercosur-trade-deal?traffic_source=rss",
    "thumbnail": "https://www.aljazeera.com/wp-content/uploads/2025/12/AFP__20251210__87N79D2__v1__HighRes__FrancePoliticsGovernment-1765740638.jpg?resize=1920%2C1440",
    "pubDate": "2025-12-14T21:32:22+00:00"
  },
  {
    "title": "'Everyone says it'll never be me' - Brown University student on surviving two mass shootings",
    "description": "Mia Tretta was shot in the 2019 mass shooting at Saugus High School in California.",
    "link": "https://www.bbc.com/news/articles/crrknvqn97no?at_medium=RSS&at_campaign=rss",
    "thumbnail": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/1eba/live/fc2594d0-d939-11f0-a8dc-93c15fe68710.jpg",
    "pubDate": "2025-12-14T21:13:22+00:00"
  },
  {
    "title": "Zelensky Offers Compromise for New Round of Ukraine Peace Talks",
    "description": "Ukraine’s president met with U.S. negotiators about plans to end the war with Russia. He said he would give up hopes of joining NATO in exchange for security guarantees.",
    "link": "https://www.nytimes.com/2025/12/14/world/europe/zelensky-ukraine-peace-talks.html",
    "thumbnail": "https://static01.nyt.com/images/2025/12/14/multimedia/14int-ukraine-talks-sub-photo-pvmw/14int-ukraine-talks-sub-photo-pvmw-facebookJumbo.jpg",
    "pubDate": "2025-12-14T20:28:35+00:00"
  },
  {
    "title": "Strictly finalists confirmed after dance-off decider",
    "description": "The three remaining couples will compete for the glitterball trophy in the final next weekend.",
    "link": "https://www.bbc.com/news/articles/ckglkklj03zo?at_medium=RSS&at_campaign=rss",
    "thumbnail": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/cd71/live/44ed0d40-d8e2-11f0-b984-9fd1b9193e69.jpg",
    "pubDate": "2025-12-14T20:27:37+00:00"
  },
  {
    "title": "Memecoins will rise from the dead, but in a new form: Crypto exec",
    "description": "Memecoins were never about memes, jokes, or financial nihilism; it is the underlying technology and its implications that are promising.",
    "link": "https://cointelegraph.com/news/memecoins-not-dead-will-return-new-form?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
    "thumbnail": "https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=1200/https://s3.cointelegraph.com/uploads/2025-12/019b1e63-7a21-73a4-9c17-5eedfe3aa72e.jpg",
    "pubDate": "2025-12-14T19:58:25+00:00"
  },
  {
    "title": "His Job Is to Make the Subway Accessible. His Own Life Fuels His Work.",
    "description": "Quemuel Arroyo, the New York transit system’s chief accessibility officer, has used a wheelchair for half his life. He understands how difficult it is to navigate the subway.",
    "link": "https://www.nytimes.com/2025/12/14/nyregion/q-arroyo-subway-accessible.html",
    "thumbnail": "https://static01.nyt.com/images/2025/12/21/nyregion/21met-arroyo-gtkb/21met-arroyo-gtkb-facebookJumbo.jpg",
    "pubDate": "2025-12-14T19:48:19+00:00"
  },
  {
    "title": "Jimmy Lai supporters queue outside Hong Kong court ahead of verdict",
    "description": "Media mogul Lai was arrested in 2020 under a national security law imposed by China.",
    "link": "https://www.aljazeera.com/news/2025/12/14/jimmy-lai-supporters-queue-outside-hong-kong-court-ahead-of-verdict?traffic_source=rss",
    "thumbnail": "https://www.aljazeera.com/wp-content/uploads/2025/12/2025-09-15T095329Z_515236731_RC29SGAOOEC7_RTRMADP_3_HONGKONG-SECURITY-BRITAIN-1765735648.jpg?resize=1920%2C1440",
    "pubDate": "2025-12-14T19:40:37+00:00"
  },
  {
    "title": "Firestorm erupts in Aave governance forum over CoW Swap fees",
    "description": "Members of the Aave DAO clashed with Aave Labs, with some arguing that the company was not acting in the best interests of token holders.",
    "link": "https://cointelegraph.com/news/firestorm-erupts-aave-governance-cowswap-fees?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
    "thumbnail": "https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=1200/https://s3.cointelegraph.com/uploads/2025-12/019b1e05-abd3-7945-b57e-49c2f2ccf7e4.jpg",
    "pubDate": "2025-12-14T18:14:15+00:00"
  },
  {
    "title": "Why the US is targeting Venezuela",
    "description": "Historian Alan McPherson tells Marc Lamont Hill how the US is carrying out a regime change campaign in Venezuela.",
    "link": "https://www.aljazeera.com/video/upfront/2025/12/14/why-the-us-is-targeting-venezuela?traffic_source=rss",
    "thumbnail": "https://www.aljazeera.com/wp-content/uploads/2025/12/image-1765735779.jpg?resize=1919%2C1080&quality=80",
    "pubDate": "2025-12-14T18:09:57+00:00"
  },
  {
    "title": "Angeline Era feels like a long-lost PlayStation classic",
    "description": "Angeline Era captures the spirit of the PS1 age by doing something totally new, rather than copying old games' notes.",
    "link": "https://www.polygon.com/angeline-era-impressions/",
    "thumbnail": "https://static0.polygonimages.com/wordpress/wp-content/uploads/2025/12/angeline-era-overworld.jpg?w=1200&h=675&fit=crop",
    "pubDate": "2025-12-14T18:00:15+00:00"
  },
  {
    "title": "Chile Poised for Right-Wing Victory as Crime Fears Sweep Latin America",
    "description": "Security has become a top concern for voters across the region who are calling for iron-fisted measures. In Chile, the issue is pushing the country to the right.",
    "link": "https://www.nytimes.com/2025/12/13/world/americas/chile-election-latin-america-crime.html",
    "thumbnail": "https://static01.nyt.com/images/2025/12/13/multimedia/13int-chile-latam-crime-promo/13int-chile-latam-crime-fcvt-facebookJumbo.jpg",
    "pubDate": "2025-12-14T17:12:07+00:00"
  },
  {
    "title": "The Silent Night, Deadly Night remake is better than the original, but more nice than naughty",
    "description": "This version of the killer Santa is far more justified, which erases some of the original's transgression.",
    "link": "https://www.polygon.com/silent-night-deadly-night-2025-reboot/",
    "thumbnail": "https://static0.polygonimages.com/wordpress/wp-content/uploads/2025/12/silent-night-deadly-night-2025.jpg?w=1600&h=900&fit=crop",
    "pubDate": "2025-12-14T17:00:16+00:00"
  },
  {
    "title": "Compliance, Credibility, and Consumer Trust in the New Age of Crypto ATMs",
    "description": "Bitcoin Depot’s Scott Buchanan argues that crypto ATM operators must continually strengthen their safeguards and make things safer and more transparent for users — protective actions that not only benefit individual crypto users but also bolster the market’s integrity and support its long-term growth.",
    "link": "https://www.coindesk.com/opinion/2025/12/14/compliance-credibility-and-consumer-trust-in-the-new-age-of-crypto-atms",
    "thumbnail": "https://cdn.sanity.io/images/s3y3vcno/production/136b43290b73ecfae362fc9c757b4d1d2ff999a0-1920x1080.jpg?auto=format&w=960&h=540&crop=focalpoint&fit=clip&q=75&fm=jpg",
    "pubDate": "2025-12-14T17:00:00+00:00"
  },
  {
    "title": "Where Welcome to Derry ends, this Pennywise game expansion begins",
    "description": "With Welcome to Derry season 1 ending, the perfect gift for fans is the Betrayal at House on the Hill expansion The Evil of Pennywise.",
    "link": "https://www.polygon.com/welcome-to-derry-betrayal-house-on-hill-evil-of-pennywise-review/",
    "thumbnail": "https://static0.polygonimages.com/wordpress/wp-content/uploads/2025/12/g0166uu00_pkg_25_300dpi.jpg?w=1600&h=900&fit=crop",
    "pubDate": "2025-12-14T16:02:16+00:00"
  },
  {
    "title": "AI tools could drive $263 billion in holiday sales. Walmart and Target are racing to get in",
    "description": "Consumers are turning to AI chatbots like ChatGPT for gift discovery, reviews and price matching, potentially driving billions in sales this holiday season.",
    "link": "https://www.cnbc.com/2025/12/12/ai-chatgpt-holiday-shopping-sales-walmart-target.html",
    "thumbnail": "https://image.cnbcfm.com/api/v1/image/108238638-1765229445203-gettyimages-2202389346-rpmga1a2xrobotd25_rbcpmg040_pt035.jpeg?v=1765229576&w=1920&h=1080",
    "pubDate": "2025-12-14T15:53:25+00:00"
  },
  {
    "title": "Why oil-rich investors are fueling Bitcoin’s next liquidity wave",
    "description": "From petrodollars to ETFs, oil-rich investors are entering Bitcoin via regulated rails, deepening liquidity while reshaping market structure.",
    "link": "https://cointelegraph.com/news/why-oil-rich-investors-are-fueling-bitcoin-s-next-liquidity-wave?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
    "thumbnail": "https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=1200/https://s3.cointelegraph.com/uploads/2025-12/019b1c3e-7030-7fa3-9a4e-7d4de2463f3b.jpg",
    "pubDate": "2025-12-14T15:45:00+00:00"
  },
  {
    "title": "ServiceNow in talks to acquire cybersecurity startup Armis in potential $7 billion deal, Bloomberg reports",
    "description": "Software company ServiceNow is in advanced discussions to acquire Armis, a cybersecurity startup last valued at $6.1 billion.",
    "link": "https://www.cnbc.com/2025/12/14/servicenow-reportedly-in-talks-to-acquire-cybersecurity-startup-armis.html",
    "thumbnail": "https://image.cnbcfm.com/api/v1/image/108194579-1757019770569-gettyimages-2233043798-SERVICENOW_HQ.jpeg?v=1757019790&w=1920&h=1080",
    "pubDate": "2025-12-14T15:11:33+00:00"
  },
  {
    "title": "Peter Jackson’s King Kong is the only Kong film you need",
    "description": "There's plenty of movies out there that include King Kong, but only one film truly matters if you want a standalone epic.",
    "link": "https://www.polygon.com/peter-jacksons-king-kong-is-the-only-kong-film-you-need/",
    "thumbnail": "https://static0.polygonimages.com/wordpress/wp-content/uploads/2025/12/king-kong-2005-film.jpg?w=1600&h=900&fit=crop",
    "pubDate": "2025-12-14T15:00:16+00:00"
  },
  {
    "title": "YO Labs Raises $10M to Scale Cross-Chain Crypto Yield Optimization Protocol",
    "description": "The protocol automates yield generation by rebalancing capital across DeFi protocols, factoring in risk, and offers access to various assets.",
    "link": "https://www.coindesk.com/web3/2025/12/13/yo-labs-raises-usd10m-to-scale-cross-chain-crypto-yield-optimization-protocol",
    "thumbnail": "https://cdn.sanity.io/images/s3y3vcno/production/aad1ffb508271a6adb94a8bc7d91764ae64ed854-1920x1080.jpg?auto=format&w=960&h=540&crop=focalpoint&fit=clip&q=75&fm=jpg",
    "pubDate": "2025-12-14T15:00:00+00:00"
  },
  {
    "title": "Barclays Sees ‘Down-Year’ for Crypto in 2026 Without Big Catalysts",
    "description": "Spot trading volumes are cooling, and investor enthusiasm is fading amid a lack of structural growth drivers, analysts wrote in a new report.",
    "link": "https://www.coindesk.com/markets/2025/12/12/barclays-sees-down-year-for-crypto-in-2026-without-big-catalysts",
    "thumbnail": "https://cdn.sanity.io/images/s3y3vcno/production/07a61643ff3fa3ea40f1d00fc20d38e859d277bb-1920x1080.jpg?auto=format",
    "pubDate": "2025-12-14T15:00:00+00:00"
  },
  {
    "title": "Trump wants the U.S. shipbuilding industry to be great again. Here's what it will take, and what's at stake",
    "description": "President Donald Trump is promising a U.S. shipbuilding renaissance to rival China, but it will not happen overnight and will require allies.",
    "link": "https://www.cnbc.com/2025/12/14/trump-america-shipbuilding-china-competition.html",
    "thumbnail": "https://image.cnbcfm.com/api/v1/image/108238428-1765214831387-IMG_0055.jpeg?v=1765215090&w=1920&h=1080",
    "pubDate": "2025-12-14T14:41:47+00:00"
  },
  {
    "title": "Bitcoin ‘extreme low volatility’ to end amid new $50K BTC price target",
    "description": "Bitcoin traders braced for a major move “around the corner” after days of BTC price action sticking to a tight range around $90,000.",
    "link": "https://cointelegraph.com/news/bitcoin-extreme-low-volatility-end-new-50k-btc-price-target?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
    "thumbnail": "https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=1200/https://s3.cointelegraph.com/uploads/2025-12/019b1c67-e86c-7234-ae1a-cad4bae9e0a3.jpg",
    "pubDate": "2025-12-14T14:20:00+00:00"
  },
  {
    "title": "Beastro preview: a delicious roguelite riff on cozy gaming",
    "description": "Sporadic bursts of deck-building combat mix up the predictable pacing of a farm-life sim.",
    "link": "https://www.polygon.com/beastro-preview-roguelite-cozy-game/",
    "thumbnail": "https://static0.polygonimages.com/wordpress/wp-content/uploads/2025/12/beastro_screenshot_chop-chop.jpg?w=1600&h=900&fit=crop",
    "pubDate": "2025-12-14T14:00:16+00:00"
  },
  {
    "title": "From Wall Street to the World Cup: How Football Became Crypto’s Biggest Gateway Drug",
    "description": "As institutions are laying the groundwork for wider crypto adoption from the top down, it’s being met by rising interest from football fans from the ground up.",
    "link": "https://www.coindesk.com/business/2025/12/12/from-wall-street-to-the-world-cup-how-football-became-crypto-s-biggest-gateway-drug",
    "thumbnail": "https://cdn.sanity.io/images/s3y3vcno/production/b7c6170a718ca8857a7ce0b2314a151cdd81e2fd-1920x1080.jpg?auto=format",
    "pubDate": "2025-12-14T14:00:00+00:00"
  },
  {
    "title": "Star Wars Lego Millennium Falcon &amp; Dark Falcon Ships Get Nice Discounts At Amazon",
    "description": "Lego Star Wars: Millennium Falcon (921 Pieces) $68 (was $85) See at Amazon See at Walmart Lego Star Wars: The Dark Falcon (1,579 Pieces) $149 (was $180) See at Amazon See at Walmart The incredibly popular 25th Anniversary Lego Star Wars: Millennium Falcon is on sale for $68 (was $85) at Amazon. The 20% discount matches the all-time low for the 921-piece display model for adult Star Wars fans. It would make a great gift this holiday--just make sure they don't already have it, because it's frequently the most-bought Star Wars Lego set on Amazon each month. Amazon also has the 1,579-piece Lego Star Wars: Dark Falcon playset for $149 (was $180). The Dark Falcon is the alternate-reality Millennium Falcon from the Rebuild the Galaxy animated miniseries. Check out both Lego Star Wars ships below. If you're looking for more deals on Star Wars Lego sets before the holidays, take a look at GameSpot's Lego Star Wars Amazon hub. Notable deals include The Phantom Menace: Mos Espa Podrace Diorama for $53.85 (was $80), the Brick-Built Star Wars Logo for $48 (was $60), the Darth Maul Mech for $11.30 (was $18), the 1,050-piece R2-D2 for $80 (was $100), and the Amazon-exclusive Phantom Menace BrickHeadz Figure 5-Pack for $44 (was $55). Lego Star Wars: Millennium Falcon (921 Pieces) $68 (was $85) One of the most popular Star Wars building sets since its launch in March 2024, the 921-piece Millennium Falcon is part of the Lego Star Wars 25th Anniversary Collection. Based on the iconic light freighter's appearance in Episode IV: A New Hope, this well-designed display model measures 9.5 x 7.5 x 5 inches and comes with an adjustable display stand that lets you pose the ship at different angles. A nameplate attaches to the front of the stand, and the 25th Anniversary logo brick featuring R2-D2 connects to the stand's base. The Millennium Falcon is one six Lego Star Wars midi-scale ships released so far. Lego's midi-scale ships are designed for adults and experienced builders due to the number of small pieces and densely packed details. All of the mid-scale ships are priced under $100, but the Millennium Falcon offers the best value--even at full price--from a piece to price ratio. The authentic design includes all of the exterior trappings found on the Millennium Falcon in the movies, including the rectenna dish, quad laser cannon, exhaust vents, the fuel lines, and more. The build process also includes intricate engine and cockpit sections. We've listed all six mid-scale Star Wars starships below. Executor Super Star Destroyer is exclusive to Walmart, and Invisible Hand is exclusive to Target and retiring soon. Amazon has deals on the Home One Starcruiser and Acclamator-Class Assault Ship, and Walmart has the Tantive IV for $60. Lego Star Wars Mid-Scale Starship Collection Millennium Falcon (921 pieces) -- $68 ($85) Tantive IV Starship (654 pieces) -- $60 ($80) | Retiring soon Home One Starcruiser (559 pieces) -- $56 ($70) Acclamator-Class Assault Ship (450 pieces) -- $40 ($50) Executor Super Star Destroyer (630 pieces) -- $70 | $14 Walmart Cash Invisible Hand Carrier/Destroyer (557 pieces) -- $50 | Retiring soon See at Amazon See at Walmart Lego Star Wars: The Dark Falcon (1,579 Pieces) $149 (was $180) Lego Star Wars: Rebuild the Galaxy cleverly altered well-known characters, starships, and planets by making the shakeup the central problem. The Star Wars universe is rearranged when a reality-altering Jedi relic is moved. Heroes and villains swap allegiances, leading to characters such as Darth Jar Jar and Bounty Hunter C-3PO and reskinned starships like the Dark Falcon. The 1,579-piece Dark Falcon playset has a number of interactive features, including spring-loaded shooters, rotating cannons, a removable cockpit, gunner post, and more. The set includes six minifigures: Darth Jar Jar Bounty Hunter C-3PO Darth Dev Darth Rey Beach Luke Jedi Vader All six minifigures have their own accessories, four of which are lightsabers. Notably, Darth Jar Jar, the galaxy's new Sith Lord, wields the double-sided red lightsaber that Darth Maul has in The Phantom Menace. There's even a removable throne for Darth Jar Jar. The gunner post and cockpit can fit two minifigures each. The Dark Falcon building set is 17 x 12.5 x 5 inches. It's classified as a playset and is suitable for builders ages 10 and up, but it makes for a nice display piece. Plus, every Lego Star Wars minifigure collection is improved by Darth Jar Jar and Bounty Hunter C-3PO. See at Amazon See at Walmart Lego Star Wars Deals at Amazon See every notable discount in one place. See at Amazon Sign up for GameSpot's Weekly Deals Newsletter: Continue Reading at GameSpot",
    "link": "https://www.gamespot.com/articles/star-wars-lego-millennium-falcon-dark-falcon-ships-get-nice-discounts-at-amazon/1100-6536954/?ftag=CAD-01-10abi2f",
    "thumbnail": "https://www.gamespot.com/a/uploads/screen_kubrick/1595/15950357/4622515-starwarsmillenniumfalcon%2Bdarkfalconthumbnails.png",
    "pubDate": "2025-12-14T14:00:00+00:00"
  },
  {
    "title": "Bitcoin Drops Below $89K Amid Fading Risk Appetite Ahead of Key Macro Events",
    "description": "Bitcoin dipped below $89,000 on Sunday as low liquidity, altcoin weakness and imminent U.S. and global data releases kept traders cautious.",
    "link": "https://www.coindesk.com/markets/2025/12/14/bitcoin-dips-below-usd90k-amid-fading-risk-appetite-ahead-of-key-macro-events",
    "thumbnail": "https://cdn.sanity.io/images/s3y3vcno/production/cea9f4fef04e3ac91c879f25c3304b72561be4c9-1920x1080.jpg?auto=format&w=960&h=540&crop=focalpoint&fit=clip&q=75&fm=jpg",
    "pubDate": "2025-12-14T13:50:18+00:00"
  },
  {
    "title": "Watch the only live-action Transformer film worth revisiting before it leaves Netflix",
    "description": "Relive the magic of Bay’s 2007 Transformers, a thrilling coming-of-age blockbuster with standout performances. Stream it on Netflix while you can.",
    "link": "https://www.polygon.com/transformer-2007-live-action-film-leaving-netflix/",
    "thumbnail": "https://static0.polygonimages.com/wordpress/wp-content/uploads/2024/12/Transformers_2007_01.webp?w=1600&h=900&fit=crop",
    "pubDate": "2025-12-14T13:00:16+00:00"
  },
  {
    "title": "Spanish Authorities Bust Crypto Kidnapping Ring After Deadly Attack",
    "description": "The case highlights a growing trend of physical attacks aimed at extracting access to crypto wallets, known as \"wrench attacks.\"",
    "link": "https://www.coindesk.com/coindesk-news/2025/12/14/spanish-authorities-bust-crypto-kidnapping-ring-after-deadly-attack",
    "thumbnail": "https://cdn.sanity.io/images/s3y3vcno/production/ff381a4e7c2b01c6eb315eb3ca7e995c8033e6a1-1920x1080.jpg?auto=format&w=960&h=540&crop=focalpoint&fit=clip&q=75&fm=jpg",
    "pubDate": "2025-12-14T13:00:00+00:00"
  },
  {
    "title": "How HashKey plans to become Hong Kong’s first crypto IPO",
    "description": "HashKey’s IPO bid puts Hong Kong’s virtual asset regime on display, testing whether compliance-first crypto platforms can win investors.",
    "link": "https://cointelegraph.com/news/how-hashkey-plans-to-become-hong-kong-s-first-crypto-ipo?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
    "thumbnail": "https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=1200/https://s3.cointelegraph.com/uploads/2025-12/019b1c35-45cb-71aa-ac6a-e76087550f57.jpg",
    "pubDate": "2025-12-14T12:05:00+00:00"
  },
  {
    "title": "Bitcoin’s four-year cycle is intact, but driven by politics and liquidity: Analyst",
    "description": "10x Research’s Markus Thielen says Bitcoin’s four-year cycle still exists but is now driven by politics, liquidity and elections rather than the halving.",
    "link": "https://cointelegraph.com/news/bitcoin-four-year-cycle-politics-liquidity-10x-research?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
    "thumbnail": "https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=1200/https://s3.cointelegraph.com/uploads/2025-09/01999508-4d1e-7c61-958a-1e4fd5ab0031",
    "pubDate": "2025-12-14T10:36:34+00:00"
  },
  {
    "title": "Bitcoin will ‘dump below $70K’ thanks to hawkish Japan: Macro analysts",
    "description": "The Bank of Japan is expected to increase its benchmark interest rates on Friday, a historically bearish signal for riskier assets like Bitcoin.",
    "link": "https://cointelegraph.com/news/bitcoin-dump-below-70k-hawkish-japan-macro-analyst?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
    "thumbnail": "https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=1200/https://s3.cointelegraph.com/uploads/2025-12/019af483-f2b0-7eaa-9be5-a4555dcf1532",
    "pubDate": "2025-12-14T10:29:23+00:00"
  },
  {
    "title": "Final Fantasy I-VI Pixel Remaster Collection Is Back On Sale For Black Friday Price",
    "description": "Final Fantasy I-VI Collection Anniversary Edition $40 (was $75) for Nintendo Switch 1/2 See at Amazon Final Fantasy I-VI Collection Anniversary Edition $40 (was $75) for PS4/PS5 See at Amazon Final Fantasy I-VI Collection Anniversary Edition is back on sale for its Black Friday price at Amazon. Nintendo and PlayStation Final Fantasy fans can get the six-game retro collection for $40 (was $75) for Switch and PS4. This is a true physical edition with all six games on the Switch cartridge or PS4 disc, and the collection is fully compatible with Switch 2 and PS5. The Pixel Remasters of the first six mainline Final Fantasy games look and sound great on both platforms, but they feel especially at home on a portable console like the Switch 1/2. The Anniversary Edition come with a Final Fantasy character sprite sticker sheet. Amazon has deals on other remasters and remakes of classic Square Enix RPGs, including the publisher's two biggest retro releases in recent months: Final Fantasy Tactics: The Ivalice Chronicles is discounted to $40 (was $50) for Switch 1/2 and PS5, and Dragon Quest I &amp; II HD-2D Remake is down to $40 (was $60) for Switch and Switch 2; the PS5 and Xbox editions are discounted to $50. Final Fantasy I-VI Collection Anniversary Edition $40 (was $75) for Nintendo Switch &amp; PS4 Final Fantasy I-VI Collection Anniversary Edition includes the Pixel Remasters of the following games: Final Fantasy I (NES, 1987) Final Fantasy II (NES, 1988) Final Fantasy III (Famicom, 1990) Final Fantasy IV (SNES, 1991) Final Fantasy V (SNES, 1992) Final Fantasy VI (SNES, 1994) All six games received comprehensive graphical and audio overhauls for the Pixel Remaster series. Square Enix remodeled the sprites using the original pixel art as a foundation. Series composer Nobuo Uematsu supervised the creation of the rearranged soundtracks. You can also play the games with the original soundtracks, but the rearranged versions are great. Numerous quality-of-life features were added, including quick save, customizable text fonts, experience multipliers, auto-battling, the ability to turn off random encounters, and more. You can also browse the in-game bestiary and illustration gallery as well as listen to classic tunes with a music player. The original collection launched in 2023 as a Square Enix Store exclusive, but it sold out incredibly fast. The Anniversary Edition brought the Final Fantasy Pixel Remaster Collection to major retailers for the first time last October. See at Amazon More Final Fantasy Games on Switch 1/2 Final Fantasy Tactics: The Ivalice Chronicles (Switch, PS5) $40 (was $50) | Amazon Exclusive Edition See at Amazon With the exception of the MMO Final Fantasy IX, the first 12 mainline Final Fantasy games are available in physical format on Nintendo Switch 1/2. Square Enix just released physical editions of Final Fantasy VII &amp; VIII Remastered Dual Pack and Final Fantasy IX in North America on December 9. Final Fantasy X|X-2 HD Remaster and Final Fantasy XII: The Zodiac Age are $25 each at Amazon, which is half the price of the eShop versions. Several spin-offs have also received physical editions, including the long-awaited remake of Final Fantasy Tactics, which is on sale for the first time. Looking ahead, Final Fantasy VII: Remake Intergrade launches on Switch 2 in January. Continue Reading at GameSpot",
    "link": "https://www.gamespot.com/articles/final-fantasy-i-vi-collection-anniversary-edition-pixel-remasters-nintendo-switch-playstation-best-amazon-deal/1100-6527670/?ftag=CAD-01-10abi2f",
    "thumbnail": "https://www.gamespot.com/a/uploads/screen_kubrick/1595/15950357/4622518-4498843-finalfantasypixelremaster.jpg",
    "pubDate": "2025-12-14T09:43:00+00:00"
  },
  {
    "title": "Twenty One’s first-day slide highlights investor caution toward BTC-backed stocks",
    "description": "Twenty One Capital’s NYSE listing showed how tightly markets now price Bitcoin-heavy firms, with investors refusing to pay much beyond the underlying BTC value.",
    "link": "https://cointelegraph.com/news/twenty-one-s-first-day-slide-highlights-investor-caution-toward-btc-backed-stocks?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
    "thumbnail": "https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=1200/https://s3.cointelegraph.com/uploads/2025-08/019877d0-3ec2-77b0-b500-3a0b67903945",
    "pubDate": "2025-12-14T09:10:00+00:00"
  },
  {
    "title": "Why Michael Saylor wants nations to build Bitcoin banks",
    "description": "Michael Saylor explains why governments should consider Bitcoin-backed digital banks. It is time to examine the potential benefits and risks of Bitcoin banks.",
    "link": "https://cointelegraph.com/explained/why-michael-saylor-wants-nations-to-build-bitcoin-banks?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
    "thumbnail": "https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=1200/https://s3.cointelegraph.com/uploads/2025-12/019b1eb2-23d2-7bc9-ad29-55337b0ad567.jpg",
    "pubDate": "2025-12-14T07:45:32+00:00"
  },
  {
    "title": "Standard Chartered, Coinbase deepen alliance to build institutional crypto infrastructure",
    "description": "Standard Chartered and Coinbase are expanding their partnership to develop trading, custody and financing services aimed at institutional crypto clients.",
    "link": "https://cointelegraph.com/news/standard-chartered-coinbase-expand-institutional-crypto-partnership?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
    "thumbnail": "https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=1200/https://s3.cointelegraph.com/uploads/2025-12/019b1b98-4130-7df9-808a-9e6b8d6320d5.jpg",
    "pubDate": "2025-12-14T06:59:14+00:00"
  },
  {
    "title": "Saint Young Men is one of the best Christmas anime you can't watch legally",
    "description": "Saint Young Men’s brilliant antics follow Jesus and Buddha as they live together in Tokyo, but fans in the U.S. still can’t watch it legally.",
    "link": "https://www.polygon.com/saint-young-men-ova-film-christmastime-anime-cant-watch-legally/",
    "thumbnail": "https://static0.polygonimages.com/wordpress/wp-content/uploads/2025/12/saint-young-men-2.jpg?w=1200&h=675&fit=crop",
    "pubDate": "2025-12-13T19:00:14+00:00"
  },
  {
    "title": "These Three Metrics Show Bitcoin Found Strong Support Near $80,000",
    "description": "Onchain data shows multiple cost basis metrics confirm heavy demand and investor conviction around the $80,000 price level.",
    "link": "https://www.coindesk.com/markets/2025/12/12/these-three-metrics-show-bitcoin-found-strong-support-near-usd80-000",
    "thumbnail": "https://cdn.sanity.io/images/s3y3vcno/production/ed4dc0b3b2e0a3846177caa6059270fededd3583-3200x1800.png?auto=format&w=960&h=540&crop=focalpoint&fit=clip&q=75&fm=jpg",
    "pubDate": "2025-12-13T19:00:00+00:00"
  },
  {
    "title": "End of 'The Berkshire Way'? Combs' departure isn't only big change as Buffett transition nears",
    "description": "There were several additional personnel changes in Monday's three-page news release that signal the company is moving toward a more conventional structure.",
    "link": "https://www.cnbc.com/2025/12/13/end-of-the-berkshire-way-combs-departure-isnt-only-big-change-as-buffett-transition-nears-.html",
    "thumbnail": "https://image.cnbcfm.com/api/v1/image/108140490-1746283733049-BUFFETT_3.jpg?v=1747341825&w=1920&h=1080",
    "pubDate": "2025-12-13T18:24:36+00:00"
  },
  {
    "title": "Morgan Stanley Maintains An Equal Weight Rating On The Travelers Companies, Inc. (TRV)",
    "description": "",
    "link": "https://finance.yahoo.com/news/morgan-stanley-maintains-equal-weight-174218711.html",
    "thumbnail": "https://s.yimg.com/ny/api/res/1.2/4GYK.xQX1wzMRHLfW4Hfqg--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyMDA7aD02NzM-/https://media.zenfs.com/en/insidermonkey.com/8fb48c2b7c10399cbde85ad4dd7ed615",
    "pubDate": "2025-12-13T17:42:18+00:00"
  },
  {
    "title": "Goldman Sachs Is Bullish On The Boeing Company (BA)",
    "description": "",
    "link": "https://finance.yahoo.com/news/goldman-sachs-bullish-boeing-company-174159465.html",
    "thumbnail": "https://s.yimg.com/ny/api/res/1.2/EwW6MgettQv3.gNoe7CGkg--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyMDA7aD02NzM-/https://media.zenfs.com/en/insidermonkey.com/281b7bd3cd729ba58c01ccc8bd1acc77",
    "pubDate": "2025-12-13T17:41:59+00:00"
  },
  {
    "title": "Walmart Inc. Common Stock (WMT) Formally Relocates On NASDAQ",
    "description": "",
    "link": "https://finance.yahoo.com/news/walmart-inc-common-stock-wmt-174137958.html",
    "thumbnail": "https://s.yimg.com/ny/api/res/1.2/4c9Fit3RMaEYV4hUZDJ55w--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyMDA7aD02NzM-/https://media.zenfs.com/en/insidermonkey.com/572eff25f62bb4543c0e05d4966360af",
    "pubDate": "2025-12-13T17:41:37+00:00"
  },
  {
    "title": "Morgan Stanley Maintains An Equal Weight Rating On JPMorgan Chase &amp; Co. (JPM)",
    "description": "",
    "link": "https://finance.yahoo.com/news/morgan-stanley-maintains-equal-weight-174116438.html",
    "thumbnail": "https://s.yimg.com/ny/api/res/1.2/0BwlrHHssSozZHQNtMcVwA--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyMDA7aD02NzM-/https://media.zenfs.com/en/insidermonkey.com/f82652d0e7c350dea8b9d7c85e94e30e",
    "pubDate": "2025-12-13T17:41:16+00:00"
  },
  {
    "title": "Cisco Systems, Inc. (CSCO) Shares Hit a record high For The First Time In Over 25 Years, Bloomberg Reports",
    "description": "",
    "link": "https://finance.yahoo.com/news/cisco-systems-inc-csco-shares-174059535.html",
    "thumbnail": "https://s.yimg.com/ny/api/res/1.2/gj1z3I2b24hNm6RMHqDh5w--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyMDA7aD02NzM-/https://media.zenfs.com/en/insidermonkey.com/d25b3866bc1552f975e750324a887a7e",
    "pubDate": "2025-12-13T17:40:59+00:00"
  },
  {
    "title": "SpaceX Is Worth $800 Billion, Report Says. It’s Only the Beginning.",
    "description": "",
    "link": "https://www.barrons.com/articles/spacex-ipo-elon-musk-tesla-xai-0e4a0731?siteid=yhoof2&yptr=yahoo",
    "thumbnail": "",
    "pubDate": "2025-12-13T17:32:00+00:00"
  },
  {
    "title": "Michael Saylor's Strategy Hangs on to Spot in Nasdaq 100 Index",
    "description": "The annual Nasdaq 100 rebalance saw six companies dropped and three new additions, with changes taking effect on December 22, but bitcoin treasury company Strategy hung onto its spot.",
    "link": "https://www.coindesk.com/business/2025/12/13/michael-saylor-s-strategy-hangs-on-to-spot-in-nasdaq-100-index",
    "thumbnail": "https://cdn.sanity.io/images/s3y3vcno/production/be2481990e55316ea6740925190a484e9d44efba-1920x1080.jpg?auto=format&w=960&h=540&crop=focalpoint&fit=clip&q=75&fm=jpg",
    "pubDate": "2025-12-13T17:23:19+00:00"
  },
  {
    "title": "3 No-Brainer Ways to Supercharge Your Retirement Savings in 2026",
    "description": "",
    "link": "https://finance.yahoo.com/news/3-no-brainer-ways-supercharge-172200796.html",
    "thumbnail": "https://s.yimg.com/ny/api/res/1.2/kTrHQ69YMhpj9al12nfZ1g--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyMDA7aD03MTA-/https://media.zenfs.com/en/motleyfool.com/f773701fac4cd7ef46abff6cfad100b0",
    "pubDate": "2025-12-13T17:22:00+00:00"
  },
  {
    "title": "Vanguard Exec Likens Bitcoin to ‘Digital Labubu’ Even as Firm Opens ETF Trading Access",
    "description": "",
    "link": "https://finance.yahoo.com/news/vanguard-exec-likens-bitcoin-digital-171949894.html",
    "thumbnail": "https://s.yimg.com/ny/api/res/1.2/.twXkP3HAPJ2JHjyy999nw--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyMDA7aD02NzU-/https://media.zenfs.com/en/coindesk_75/00cfe4bf1de63673f17d53e5bff444e5",
    "pubDate": "2025-12-13T17:19:49+00:00"
  },
  {
    "title": "4 ways to watch Supernatural before it leaves Netflix next week",
    "description": "Let us help you figure out how to stream Supernatural, while you still can",
    "link": "https://www.polygon.com/supernatural-leaving-netflix-how-to-watch/",
    "thumbnail": "https://static0.polygonimages.com/wordpress/wp-content/uploads/2025/12/supernatural-1.jpg?w=1600&h=900&fit=crop",
    "pubDate": "2025-12-13T17:00:15+00:00"
  },
  {
    "title": "JPMorgan Says This 1 Chip Stock Is a Strong Buy Now... And It’s Not What You Think It Is",
    "description": "",
    "link": "https://finance.yahoo.com/news/jpmorgan-says-1-chip-stock-170002450.html",
    "thumbnail": "https://s.yimg.com/ny/api/res/1.2/B4sTq12jzCLHumRuglVD3Q--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyMDA7aD04MDA-/https://media.zenfs.com/en/barchart_com_477/7bd8b0c092b25932643cb1d74951dc96",
    "pubDate": "2025-12-13T17:00:02+00:00"
  },
  {
    "title": "Trump’s Surprise Answer to Vehicle Affordability: ‘Cute’ Tiny Cars",
    "description": "",
    "link": "https://www.wsj.com/business/autos/trumps-surprise-answer-to-vehicle-affordability-cute-tiny-cars-b6b482d1?siteid=yhoof2&yptr=yahoo",
    "thumbnail": "",
    "pubDate": "2025-12-13T17:00:00+00:00"
  },
  {
    "title": "Wake Up Dead Man proves a Knives Out Muppets movie could work — here’s why",
    "description": "Rian Johnson recently explained why a Knives Out Muppets movie wouldn't work. Here's why he's wrong.",
    "link": "https://www.polygon.com/we-deserve-a-knives-out-muppets-movie-and-wake-up-dead-man-proves-it-could-work/",
    "thumbnail": "https://static0.polygonimages.com/wordpress/wp-content/uploads/2025/12/mcdmumo_ec005.jpg?w=1600&h=900&fit=crop",
    "pubDate": "2025-12-13T15:00:14+00:00"
  },
  {
    "title": "MacKenzie Scott announced another $7.1 billion in 2025 charitable donations—she's now given away $26.3 billion since 2019",
    "description": "Billionaire philanthropist MacKenzie Scott's 2025 donations went to a wide range of nonprofits, including several historically Black colleges and universities.",
    "link": "https://www.cnbc.com/2025/12/13/mackenzie-scott-revealed-her-total-charitable-donations-for-2025.html",
    "thumbnail": "https://image.cnbcfm.com/api/v1/image/108105888-1740168765345-gettyimages-2100039841-927403324_scott2.jpeg?v=1740168819&w=1920&h=1080",
    "pubDate": "2025-12-13T14:15:01+00:00"
  },
  {
    "title": "Today is Dick Van Dyke’s 100th birthday: His tips for a long, healthy life—'sometimes I feel like I'm 15 again'",
    "description": "Dick Van Dyke is officially a centenarian! Here are three research-backed staples in his routine that he credits for his 100 years of life.",
    "link": "https://www.cnbc.com/2025/12/13/dick-van-dykes-100th-birthday-his-tips-for-a-long-healthy-life.html",
    "thumbnail": "https://image.cnbcfm.com/api/v1/image/108241272-1765556072029-gettyimages-2156569513-re__2151_9yvpbndn.jpeg?v=1765556124&w=1920&h=1080",
    "pubDate": "2025-12-13T13:00:01+00:00"
  },
  {
    "title": "Exclusive Halloween 4K Steelbooks And Box Sets On Sale For Lowest Prices Yet",
    "description": "Halloween (1978): Limited Edition Steelbook (4K) $39.49 (was $45) See at Amazon Halloween II (1981): Limited Edition Steelbook (4K) $37 (was $45) See at Amazon Halloween III: Season of the Witch (1982): Limited Edition Steelbook (4K) $40 (was $45) See at Amazon Amazon's weekly catalog of movie and TV deals features a wide selection of contemporary and classic horror, including numerous 4K Blu-rays with steelbook cases you can only find on Amazon. The retailer's new 4K Steelbook Editions of the first three Halloween movies are on sale for their best prices yet. The discounts aren't massive, but Amazon-exclusive editions aren't discounted very often. Halloween (1978) Steelbook Edition is on sale for $39.49 (was $45), and Halloween II's Steelbook Edition is discounted to $37 (was $45). Both of these editions released in September and were followed in late October by Halloween III: Season of the Witch Steelbook Edition, which is on sale for the first time. Continue Reading at GameSpot",
    "link": "https://www.gamespot.com/articles/halloween-michael-myers-4k-blu-ray-steelbook-editions-movie-box-sets/1100-6532830/?ftag=CAD-01-10abi2f",
    "thumbnail": "https://www.gamespot.com/a/uploads/screen_kubrick/1595/15950357/4570560-halloween1-3steelbookeditions.jpg",
    "pubDate": "2025-12-13T05:25:00+00:00"
  },
  {
    "title": "Fatal Frame II: Crimson Butterfly Remake Is Up For Preorder",
    "description": "Fatal Frame II: Crimson Butterfly Remake $50 | Releases March 12, 2026 Preorder at Amazon Preorder at Walmart Preorder at Target Preorder at GameStop The cult-favorite survival horror series Fatal Frame returns next year when Fatal Frame II: Crimson Butterfly Remake launches for PlayStation 5, Nintendo Switch 2, Xbox Series X|S, and PC on March 12, 2026. As the name implies, this is a remake of the original PS2 game with upgraded visuals, quality-of-life adjustments, and other tweaks one would expect from this era of remakes. Preorders for the game are now live, and grabbing the game early gets you a few in-game bonuses. Physical edition preorders are available for $50 from Amazon, GameStop, Target, and Walmart. Digital preorders are also available with the same perks, and there's a Digital Deluxe Edition that comes with even more bonuses going for $70--that is, unless you're on PC, in which case you can grab the Fatal Frame II: Crimson Butterfly Remake standard edition for just $42.49 (was $50) or the Deluxe Edition for $59.49 (was $70). Fatal Frame II: Crimson Butterfly Remake Preorder Bonuses Fatal Frame II: Crimson Butterfly Remake preorder bonuses. By preordering any version of Fatal Frame II: Crimson Butterfly Remake, you'll get a handful of in-game cosmetic rewards for your characters. Here's what's included: Crimson Butterfly Mayu skin Crimson Butterfly Mio skin Spirit Charm Cat Ears (Black) Cat Ears (White) These bonuses are only available if you secure your copy before launch. Continue Reading at GameSpot",
    "link": "https://www.gamespot.com/articles/fatal-frame-ii-crimson-butterfly-remake-is-up-for-preorder/1100-6536848/?ftag=CAD-01-10abi2f",
    "thumbnail": "https://www.gamespot.com/a/uploads/screen_kubrick/1701/17013431/4622160-ffhed.jpg",
    "pubDate": "2025-12-13T02:07:00+00:00"
  },
  {
    "title": "Dark Horse's New Tomb Raider Comic Omnibuses Are 40% Off At Amazon",
    "description": "Tomb Raider Colossal Collection Vol. 1 (888 Pages) $59.14 (was $100) See at Amazon Tomb Raider Colossal Collection Vol. 2 (944 Pages) $59.59 (was $100) See at Amazon If you're looking for a way to pass the time until the newly announced Tomb Raider: Legacy of Atlantis arrives next year, you can revisit more of Lara Croft's classic adventures by picking up the newly reissued comic book series. Amazon has terrific deals on Dark Horse's appropriately titled Tomb Raider Colossal Collections right now. The 888-page Colossal Collection Volume 1 is discounted to $59.14 (was $100), which is the best price we've seen since the hardcover comic omnibus hit stores in July. The 944-page Colossal Collection Volume 2 released November 25, but it's already on sale for only $59.59 (was $100). Together, the two books collect Top Cow Productions' 50-issue series published from 1999-2003 as well as Tomb Raider: Journeys and several one-shots. Continue Reading at GameSpot",
    "link": "https://www.gamespot.com/articles/tomb-raider-comic-books-colossal-collection-dark-horse-volumes-1-3/1100-6527680/?ftag=CAD-01-10abi2f",
    "thumbnail": "https://www.gamespot.com/a/uploads/screen_kubrick/1595/15950357/4622144-tombraidercolossalcollectionthumbnail.jpg",
    "pubDate": "2025-12-12T22:51:00+00:00"
  },
  {
    "title": "Trump says Kevin Warsh is at top of Fed chair candidate list, president should be consulted on rates",
    "description": "Trump said Friday that Kevin Warsh has moved to the top of his list as the next Federal Reserve chair, though others remain in contention.",
    "link": "https://www.cnbc.com/2025/12/12/trump-kevin-warsh-fed-chair-rates.html",
    "thumbnail": "https://image.cnbcfm.com/api/v1/image/108173286-1752755185354-Kevin4.jpg?v=1765577367&w=1920&h=1080",
    "pubDate": "2025-12-12T22:10:15+00:00"
  },
  {
    "title": "Marvel's Spider-Man Magic: The Gathering Booster Box Is Nearly 50% Off At Amazon",
    "description": "Marvel's Spider-Man Gift Bundle $64 (was $90) See at Amazon Marvel's Spider-Man Play Booster Box (30 Packs) $114 (was $209.70) See at Amazon Spidey's Spectacular Showdown Scene Box $28 (was $42) See at Amazon Magic: The Gathering's Spider-Man set is discounted to surprisingly low prices at Amazon. Multiple products from the relatively new Universes Beyond crossover have never been this cheap before. It's not easy to pick which deal is the best, but the product with the largest discount is the Marvel's Spider-Man Play Booster Box. Launched in late September for $210, the Spider-Man Booster Box is on sale for only $114. The nearly $100 discount means each of the 30 Booster Packs will cost you an average of $3.80. The Spider-Man Gift Bundle is discounted to only $64 (was $90). Featuring comic book-inspired collector's packaging, the Gift Bundle includes one Collector Booster with 15 cards, nine standard Boosters (14 cards each), an Alternate-Art Foil Promo Card, and numerous accessories, including a Spider-Man themed card storage box. Collector Boosters are going for $39 on their own, so this is an incredible deal. If you don't yet own any Marvel's Spider-Man MTG cards, you may be most interested in the Spidey's Spectacular Showdown Scene Box, which includes six Art-Only Cards for display on an included easel, six playable Traditional Foil Borderless Scene Cards, and three Marvel's Spider-Man Play Boosters. Normally $42, the Spider-Man Scene Box is discounted to only $28. Check out the full Marvel's Spider-Man MTG lineup below. The Spider-Man Play Booster Box is the cheapest of the 2025 Universes Beyond sets, but Amazon also has superb deals on Avatar: The Last Airbender's Booster Box ($125) and the newly restocked Final Fantasy Booster Box ($140). Even the upcoming Teenage Mutant Ninja Turtles Booster Box is on sale for $160. Continue Reading at GameSpot",
    "link": "https://www.gamespot.com/articles/marvel-spider-man-magic-the-gathering-universes-beyond-best-amazon-deals-in-stock-now/1100-6529819/?ftag=CAD-01-10abi2f",
    "thumbnail": "https://www.gamespot.com/a/uploads/screen_kubrick/1595/15950357/4622140-spider-manmagicthegatheringthumbnail.jpg",
    "pubDate": "2025-12-12T21:55:00+00:00"
  },
  {
    "title": "Want A Bunch Of Free eShop Games This Holiday Season? Here's How",
    "description": "If you want to get your hands on nearly a dozen free Switch games this holiday season, now's your chance. Starting today, No Gravity Games is giving away one Switch title per day through December 19, on which day there will be three free games. However, there is a catch that works out in your favor. To claim a free game on Switch, players need to have claimed the previous day's title and maintained it in their library. You must also have at least one No Gravity title prior to claiming the first freebie, but there's a trick you can use to get that for free, too. Just visit No Gravity Games' official site and sign up for the newsletter, and you'll receive a free game. If you do this first, it will count as a \"purchased\" game from No Gravity and you're able to then claim the other games for free. If players do miss a day, they can rejoin the giveaway chain by purchasing the previous day's game, which will be available at a greatly reduced price. Each title becomes available for free at midnight PT and they will be available to claim on Nintendo's eShop until 11:59pm PT on the same day. Continue Reading at GameSpot",
    "link": "https://www.gamespot.com/articles/want-a-bunch-of-free-eshop-games-this-holiday-season-heres-how/1100-6536951/?ftag=CAD-01-10abi2f",
    "thumbnail": "https://www.gamespot.com/a/uploads/screen_kubrick/1837/18375603/4622063-bullets%26brains.jpg",
    "pubDate": "2025-12-12T21:06:00+00:00"
  },
  {
    "title": "Fortnite's Harry Potter Collab Revealed, Lets You Dress Up Like A Wizard",
    "description": "Epic Games has announced the latest major collab in Fortnite, and it's Harry Potter. Warner Bros. Interactive Entertainment and Epic are bringing \"the world of Harry Potter\" to Epic's platform this month, including Fortnite and Rocket League. The Fortnite Shop will be updated later this month with outfits and accessories based on all things Harry Potter and the wider wizarding world. The outfits can be tailored to specific houses, including Gryffindor, Slytherin, Ravenclaw, and Hufflepuff. Dress up like Harry Potter in Fortnite this month.In Rocket League, the game's Frosty Fest event will include a new Hogwarts House Rivalry event, during which players can earn points for their specific Hogwarts house. There will be Harry Potter-themed in-game shop items, too, and Epic said it will reveal them later this month. Continue Reading at GameSpot",
    "link": "https://www.gamespot.com/articles/fortnites-harry-potter-collab-revealed-lets-you-dress-up-like-a-wizard/1100-6536950/?ftag=CAD-01-10abi2f",
    "thumbnail": "https://www.gamespot.com/a/uploads/screen_kubrick/1179/11799911/4622060-screenshot2025-12-12at3.06.50%E2%80%AFpm.png",
    "pubDate": "2025-12-12T20:06:00+00:00"
  }
]