[
  {
    "title": "Viola Ford Fletcher, survivor of 1921 Tulsa Massacre, dies age 111",
    "description": "Fletcher fought for greater recognition of one of the deadliest incidents of race violence in US history.",
    "link": "https://www.aljazeera.com/news/2025/11/25/viola-ford-fletcher-survivor-of-1921-tulsa-massacre-dies-age-111?traffic_source=rss",
    "thumbnail": "https://www.aljazeera.com/wp-content/uploads/2025/11/AP25328780756178-1764038143.jpg?resize=1920%2C1440",
    "pubDate": "2025-11-25T04:11:55+00:00"
  },
  {
    "title": "‘Everyone was startled’: Thai woman due for cremation found alive in coffin",
    "description": "Reports say doctors diagnosed the woman with critically low blood sugar likely leading to her weakened condition.",
    "link": "https://www.aljazeera.com/news/2025/11/25/everyone-was-startled-thai-woman-due-for-cremation-found-alive-in-coffin?traffic_source=rss",
    "thumbnail": "https://www.aljazeera.com/wp-content/uploads/2025/11/AP25328450390304-1764039921.jpg?resize=1440%2C1080&quality=80",
    "pubDate": "2025-11-25T04:10:57+00:00"
  },
  {
    "title": "BBC chairman survives MPs' questions – but crisis at corporation is not over",
    "description": "BBC chairman Samir Shah appears to strengthen his position during questioning by MPs, our media editor says.",
    "link": "https://www.bbc.com/news/articles/c0l9pp61xr5o?at_medium=RSS&at_campaign=rss",
    "thumbnail": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/e9fe/live/ec2cbfd0-c9b3-11f0-9fb5-5f3a3703a365.jpg",
    "pubDate": "2025-11-25T04:07:14+00:00"
  },
  {
    "title": "BitMine, Strategy, SharpLink stocks outpace crypto market recovery",
    "description": "Digital asset treasury stocks surged on Monday, led by BitMine, even outpacing the broader crypto market’s gains as institutional ownership increased.",
    "link": "https://cointelegraph.com/news/bitmine-strategy-sharplink-are-outpacing-crypto-market-recovery?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
    "thumbnail": "https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=1200/https://s3.cointelegraph.com/uploads/2025-11/019a7760-6720-7cd2-877a-25579a324bfc",
    "pubDate": "2025-11-25T04:07:06+00:00"
  },
  {
    "title": "BBC may not be in 'safe hands' under its chair, says committee head",
    "description": "The most senior MP on the culture select committee says Samir Shah's evidence to MPs was \"wishy-washy\".",
    "link": "https://www.bbc.com/news/articles/cd74ne84lqdo?at_medium=RSS&at_campaign=rss",
    "thumbnail": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/9aec/live/613a2c60-c9a3-11f0-8725-893df8030bfc.jpg",
    "pubDate": "2025-11-25T04:05:56+00:00"
  },
  {
    "title": "At a Congressional Hearing, Residents Detail the Trauma of the L.A. Raids",
    "description": "More than two dozen people described the upheaval the raids had caused in immigrant communities and aired accusations of mistreatment by agents.",
    "link": "https://www.nytimes.com/2025/11/24/us/ice-raids-congressional-hearing.html",
    "thumbnail": "https://static01.nyt.com/images/2025/11/24/multimedia/24NAT-LA-CITIZENS-zkqg/24NAT-LA-CITIZENS-zkqg-facebookJumbo-v2.jpg",
    "pubDate": "2025-11-25T03:54:59+00:00"
  },
  {
    "title": "Trump launches ‘Genesis Mission’ to harness AI for scientific breakthroughs",
    "description": "Trump signs order to integrate supercomputers and data assets in order to create 'AI experimentation platform'.",
    "link": "https://www.aljazeera.com/economy/2025/11/25/trump-launches-genesis-mission-to-harness-ai-for-scientific-breakthroughs?traffic_source=rss",
    "thumbnail": "https://www.aljazeera.com/wp-content/uploads/2025/11/AP25309552803727-1764030466_7ebdec-1764030956.jpg?resize=1200%2C630&quality=80",
    "pubDate": "2025-11-25T03:48:28+00:00"
  },
  {
    "title": "U.S. sues Sen. Jim Justice, wife for $5.1 million in unpaid taxes dating to 2009 as legal woes mount",
    "description": "A federal judge recently ruled the coal mining heir owed more than $29 million in damages for breaching a contract with a bond-surety company.",
    "link": "https://www.cnbc.com/2025/11/24/jim-justice-sued-taxes-west-virginia-coal.html",
    "thumbnail": "https://image.cnbcfm.com/api/v1/image/107232403-1682632158127-AP22028096038632.jpg?v=1682632367&w=1920&h=1080",
    "pubDate": "2025-11-25T03:44:44+00:00"
  },
  {
    "title": "SEC issues ‘rare’ no-action letter for Solana DePIN project token FUSE",
    "description": "It comes several months after the SEC issued a similar no-action letter to DoubleZero, seen as a significant regulatory milestone for DePIN projects.",
    "link": "https://cointelegraph.com/news/sec-no-action-letter-fuse-depin-project?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
    "thumbnail": "https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=1200/https://s3.cointelegraph.com/uploads/2025-02/0194d7d6-b2af-7b04-bc83-277885cc3c97",
    "pubDate": "2025-11-25T03:40:37+00:00"
  },
  {
    "title": "Controversial US-backed Gaza Humanitarian Foundation ends aid operations",
    "description": "Hundreds of Palestinians were killed while seeking food amid chaotic scenes near GHF's sites.",
    "link": "https://www.bbc.com/news/articles/cj01jr13277o?at_medium=RSS&at_campaign=rss",
    "thumbnail": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/0fa2/live/e9bc6140-c9a1-11f0-a892-01d657345866.jpg",
    "pubDate": "2025-11-25T03:21:27+00:00"
  },
  {
    "title": "‘Elite capture’: How Pakistan is losing 6 percent of its GDP to corruption",
    "description": "New IMF report prompts calls for corruption reforms. But experts say that needs political will, not technical tinkering.",
    "link": "https://www.aljazeera.com/economy/2025/11/25/elite-capture-how-pakistan-is-losing-6-percent-of-its-gdp-to-corruption?traffic_source=rss",
    "thumbnail": "https://www.aljazeera.com/wp-content/uploads/2025/11/AP23181233722483-1763683048.jpg?resize=1920%2C1440",
    "pubDate": "2025-11-25T03:20:09+00:00"
  },
  {
    "title": "Sudan’s RSF committing war crimes in Darfur, says Amnesty",
    "description": "The latest report came hours after the RSF agreed to a three-month humanitarian truce.",
    "link": "https://www.aljazeera.com/news/2025/11/25/sudans-rsf-committing-war-crimes-in-darfur-says-amnesty?traffic_source=rss",
    "thumbnail": "https://www.aljazeera.com/wp-content/uploads/2025/10/afp_69051a46e21d-1761942086.jpg?resize=1920%2C1440",
    "pubDate": "2025-11-25T03:11:32+00:00"
  },
  {
    "title": "Afghanistan says Pakistan bombed Khost, killing nine children and a woman",
    "description": "Government spokesman says the attack in Khost destroyed a civilian home, killing five boys, four girls and a woman.",
    "link": "https://www.aljazeera.com/news/2025/11/25/taliban-says-pakistan-bombed-afghanistan-killing-nine-children-and-a-woman?traffic_source=rss",
    "thumbnail": "https://www.aljazeera.com/wp-content/uploads/2025/11/AFGHANISTAN-KUNAR-KHOST-PAKTIKA-1764040813.jpg?resize=1920%2C1080&quality=80",
    "pubDate": "2025-11-25T02:51:46+00:00"
  },
  {
    "title": "South Korea’s Upbit parent plans US IPO after Naver merger: Report",
    "description": "US investors could soon get exposure to South Korea’s active crypto market, as crypto exchange Upbit’s parent company, Dunamu, reportedly eyes a Nasdaq listing.",
    "link": "https://cointelegraph.com/news/south-korea-upbit-parent-dunamu-plans-nasdaq-ipo?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
    "thumbnail": "https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=1200/https://s3.cointelegraph.com/uploads/2025-11/019ab84b-ec7f-7bee-bcc0-5f346435353d",
    "pubDate": "2025-11-25T02:42:17+00:00"
  },
  {
    "title": "Family reunited after a decade – now a Trump clampdown could tear them apart",
    "description": "Marven's mother and sister could be sent back to gang-ravaged Haiti as a US protection scheme ends.",
    "link": "https://www.bbc.com/news/articles/cly481gxwr8o?at_medium=RSS&at_campaign=rss",
    "thumbnail": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/895f/live/a9b3c8e0-c0b9-11f0-8a6c-bdcd4bb2f081.jpg",
    "pubDate": "2025-11-25T02:40:30+00:00"
  },
  {
    "title": "Asia Morning Briefing: BTC Steadies as Polymarket Traders Lean Toward December Rate Cut",
    "description": "Rising odds of a Fed pivot helped calm crypto markets, while QCP and Glassnode point to a reset in leverage, fading sell pressure, and early signs of a bottoming structure as traders hedge both downside and late-year upside.",
    "link": "https://www.coindesk.com/markets/2025/11/25/asia-morning-briefing-btc-steadies-as-polymarket-traders-lean-toward-december-rate-cut",
    "thumbnail": "",
    "pubDate": "2025-11-25T02:18:16+00:00"
  },
  {
    "title": "How Rubio Tried to Bring a Pro-Russia Peace Plan to Middle Ground",
    "description": "While President Trump attacked the Ukrainians, Secretary of State Marco Rubio flew to Geneva to seize control of negotiations that were going off the rails.",
    "link": "https://www.nytimes.com/2025/11/24/us/politics/trump-russia-ukraine-peace-plan-middle-ground.html",
    "thumbnail": "https://static01.nyt.com/images/2025/11/24/multimedia/24dc-PREXY-kfwq/24dc-PREXY-kfwq-facebookJumbo.jpg",
    "pubDate": "2025-11-25T02:15:01+00:00"
  },
  {
    "title": "Wall Street need not be squeamish about Bitcoin’s ups and downs: Pomp",
    "description": "Bitcoiners aren’t new to 30% drawdowns, but it could be a first for many Wall Street investors, said crypto commentator Anthony Pompliano.",
    "link": "https://cointelegraph.com/news/bitcoin-volatility-drawdowns-pompliano-wall-street-analysis?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
    "thumbnail": "https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=1200/https://s3.cointelegraph.com/uploads/2025-04/01960404-70ee-75dc-abec-e5b91d23d508",
    "pubDate": "2025-11-25T02:06:52+00:00"
  },
  {
    "title": "Judge Tosses Criminal Charges Against James Comey and Letitia James",
    "description": "The decision is a setback for the president’s efforts to wield the criminal justice system against his perceived enemies.",
    "link": "https://www.nytimes.com/2025/11/24/nyregion/james-comey-case-dismissed.html",
    "thumbnail": "https://static01.nyt.com/images/2025/11/24/multimedia/00dc-comey-dismiss-bzlf/00dc-comey-dismiss-bzlf-facebookJumbo.jpg",
    "pubDate": "2025-11-25T02:00:09+00:00"
  },
  {
    "title": "Russia-Ukraine war: List of key events, day 1,370",
    "description": "Here are the key events from day 1,370 of Russia’s war on Ukraine.",
    "link": "https://www.aljazeera.com/news/2025/11/25/russia-ukraine-war-list-of-key-events-day-1370?traffic_source=rss",
    "thumbnail": "https://www.aljazeera.com/wp-content/uploads/2025/11/13530254-1764029746.jpg?resize=1200%2C675",
    "pubDate": "2025-11-25T01:42:20+00:00"
  },
  {
    "title": "The 5 Best Gaming Laptop Deals In Amazon's Black Friday 2025 Sale",
    "description": "Gaming Laptops on sale at Amazon Get a portable powerhouse in these early Black Friday deals See at Amazon Several early Black Friday deals are live, and if you're looking to upgrade to a gaming laptop, Amazon is offering steep discounts on models from top brands like Asus, MSI, and Acer. While there are dozens of great models listed, we've gone ahead and selected five of the best gaming laptop deals in Amazon's sale in case you're looking for recommendations on where to start. Some of the standout deals include the Asus ROG Strix G16 laptops. Amazon has two different configurations on sale, starting at $1,200 (was $1,500). The second model is on sale for and $1,424 (was $1,900). It has a Nebula Display with a 240Hz refresh rate. Both laptops are designed to make potential RAM and SSD upgrades simple with their easy-access shells. The MSI Katana can handle a wide variety of games using its Intel Core i9 processor, Nvidia GeForce RTX 5070 Laptop GPU, and 32GB of RAM. On sale for $1,370 (was $1,680), this is one of the powerhouse laptops on sale, and it features a rebuilt thermal system to help keep the hardware cooled during intense gaming sessions. Continue Reading at GameSpot",
    "link": "https://www.gamespot.com/articles/best-gaming-laptop-deals-at-amazon-bf2025/1100-6536451/?ftag=CAD-01-10abi2f",
    "thumbnail": "https://www.gamespot.com/a/uploads/screen_kubrick/1601/16018044/4609391-laptops-bf.jpg",
    "pubDate": "2025-11-25T01:39:00+00:00"
  },
  {
    "title": "Asia-Pacific markets track Wall Street's tech recovery after Alphabet leads AI rally",
    "description": "Asia-Pacific markets opened higher Tuesday, tracking Wall Street's tech rebound on Fed rate-cut hopes.",
    "link": "https://www.cnbc.com/2025/11/25/asia-pacific-markets-tuesday-today-ai-tech-recovery-nikkei-225-hang-seng-index-kospi.html",
    "thumbnail": "https://image.cnbcfm.com/api/v1/image/107177543-1673480128200-gettyimages-1383294273-vcg111372468131.jpeg?v=1764028930&w=1920&h=1080",
    "pubDate": "2025-11-25T01:38:53+00:00"
  },
  {
    "title": "Get One Of 2025's Best Horror Games For As Low As $40",
    "description": "Cronos: The New Dawn (PS5) $40 (was $60) See at Amazon Cronos: The New Dawn (Switch 2) $45 (was $60) See at Amazon This year has been a strong one for survival horror games, and one of the highlights has been Cronos: The New Dawn, an original horror game from Bloober Team, the studio behind last year's critically acclaimed Silent Hill 2 remake. The sci-fi horror adventure launched just a few weeks ago back in September, but thanks to Amazon's Black Friday sale, you can grab Cronos: The New Dawn for up to 30% off. The discount varies between platforms--the PS5 version is just $40 (was $60), while the Switch 2 edition is discounted to $45 (was $60). This is the biggest price cut we've seen for the physical edition, but it will only be available for a limited time. Cronos: The New Dawn (PS5) $40 (was $60) Set in a futuristic rendition of Eastern Europe that has been radically altered due to a mysterious event, players step into the boots of the Traveler. Using time travel, the Traveler journeys back to 1980s Poland on behalf of a group known as The Collective to rescue key people before they die in the coming cataclysm. The Traveler has an arsenal of weapons to keep mutants at bay, but failing to dispose of their remains properly will result in surviving enemies fusing with the corpses to create a tougher and more dangerous creature. See at Amazon Cronos: The New Dawn (Switch 2) $45 (was $60) The Switch 2 version of Cronos: The New Dawn runs at a mostly stable 30fps. Some graphical concessions have been made, but the overall tone and atmosphere have been retained. This is a Game Key card version of the game, and it requires 25GB of storage space on the Switch 2. See at Amazon \"While it doesn't achieve the incredible heights of the Silent Hill 2 remake, Cronos earns its own name in the genre with an intense sci-fi horror story that will do well to satisfy anyone's horror fix, provided they can stomach its sometimes brutal enemy encounters,\" Mark Delaney wrote in GameSpot's review, scoring the game 8/10. If you're looking for more early Black Friday video game deals, check out the links below to see all the discounts for PS5, Nintendo Switch, and Xbox Series X games available now. We've also compiled roundups for discounted Blu-rays, Lego sets, graphic novels, and more at GameSpot's Black Friday Deals Hub. Continue Reading at GameSpot",
    "link": "https://www.gamespot.com/articles/cronos-the-new-dawn-deals-bf2025/1100-6536448/?ftag=CAD-01-10abi2f",
    "thumbnail": "https://www.gamespot.com/a/uploads/screen_kubrick/1601/16018044/4609363-cronos-1.jpg",
    "pubDate": "2025-11-25T01:25:00+00:00"
  },
  {
    "title": "'Gang in balaclavas targeted our combine harvester': Farmers welcome rural crime crackdown",
    "description": "Police launch a new nationwide strategy to crack down on organised crime gangs in the countryside.",
    "link": "https://www.bbc.com/news/articles/cm2895pgm99o?at_medium=RSS&at_campaign=rss",
    "thumbnail": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/b817/live/07abaf20-c93f-11f0-9fb5-5f3a3703a365.jpg",
    "pubDate": "2025-11-25T01:23:21+00:00"
  },
  {
    "title": "Trump Is Considering a Push to Extend Obamacare Subsidies",
    "description": "President Trump has not made a final decision. But he is under pressure to address the cost of health care, which for many Americans will jump if the subsidies expire.",
    "link": "https://www.nytimes.com/2025/11/24/us/politics/trump-obamacare-subsidies-health-care.html",
    "thumbnail": "https://static01.nyt.com/images/2025/11/24/multimedia/24dc-health-gtpc/24dc-health-gtpc-facebookJumbo.jpg",
    "pubDate": "2025-11-25T01:21:43+00:00"
  },
  {
    "title": "Get Sony's Belt Drive Turntable For Cheap During Black Friday",
    "description": "Sony PS-LX310BT Turntable $200 (was $450) See at Amazon See at Best Buy See at Sony Store Music streaming might be convenient, but it lacks the quality of physical media. You can find out for yourself just how good vinyl can sound in the modern era with this Black Friday deal on the Sony PS-LX310BT turntable, which is just $200 (normally $450) at Amazon, Best Buy, and the Sony store. This belt-driven turntable was introduced several years ago, and it blends classic audio technology with a few high-tech features, like Bluetooth connectivity. It's a great, user-friendly turntable choice, especially while it's nearly 60% off right now. Sony PS-LX310BT Turntable $200 (was $450) Designed to be a plug-and-play turntable, the PS-LX310BT is a user-friendly option for anyone looking to purchase their first device in this category. It has a fully automatic design and setting up the drive belt can easily be done in a few minutes. While the body is mostly plastic, the Sony turntable does have an aluminum die-cast platter and pipe tonearm. The included RCA cables let you plug it directly into a stereo system, but for wireless listening, you can connect Bluetooth-enabled devices like speakers and headphones. Other features include two speeds--33 1/3 rpm and 45 rpm--a built-in switchable phono/line-out phono preamp, three gain settings, a vibration-dampening slip mat, and a removable dust cover. See at Amazon See at Best Buy See at Sony Store Sony WH-1000XM5 Headphones $248 (was $400) Since you can connect a wireless headset to the turntable, we'd recommend grabbing one of Sony's popular noise-canceling headphones to go with this. Normally $400, the Sony WH-1000XM5 headphones are on sale for $248, and they come in four distinct colors. The big draw is the noise-canceling features, which use what Sony calls \"Auto NC Optimizer\" to automatically adjust the function based on your environment. The headphones also feature a lightweight design with soft leather, a battery life of up to 30 hours, and a selection of touch-control settings for media playback and communication. Black Midnight Blue Silver Smoky Pink See at Amazon We've also included several Bluetooth speakers below from Bose, Sony, and JBL that are on sale for Black Friday. While a stereo system is preferred for turntables, you can still get a high-quality audio experience from these devices, and their wireless nature helps reduce cable management. The other benefit is that this also makes it easier to transport your turntable to a function or a party, and there is a wide variety of speakers to choose from. JBL has pocket-friendly devices like the JBL Go, while Sony's range includes multi-function speakers with a similar design aesthetic to the turntable. Check out these and other audio gear deals in the list below. And once you've browsed those, head over to GameSpot's Black Friday Deals Hub for more of the latest discounts. More Black Friday Audio Gear Deals Bose Bose Soundlink+ -- $190 ($270) Bose Soundlink Micro -- $89 ($119) Bose Soundlink Flex -- $120 ($150) Bose Soundlink Revolve+ -- $180 ($300) Sony Sony SRS-XB100 -- 443 ($65) Sony SRS-XP700 Party Speaker -- $348 ($550) Sony ULT Field 5 Bluetooth Speaker -- $195 ($350) Sony HT-S2000 3.1 channel Dolby Atmos soundbar -- $298 ($500) JBL JBL Go 3 (Black) -- $30 ($40) JBL Go 3 (Blue) -- $30 ($40) JBL Xtreme 2 -- $150 ($200) JBL Extreme 3 -- $200 ($330) Amazon Black Friday Gaming Deals Check out all of the video game and hardware discounts. See at Amazon Sign up for GameSpot's Weekly Deals Newsletter: Continue Reading at GameSpot",
    "link": "https://www.gamespot.com/articles/sony-belt-drive-turntable-is-over-50-off/1100-6536455/?ftag=CAD-01-10abi2f",
    "thumbnail": "https://www.gamespot.com/a/uploads/screen_kubrick/1601/16018044/4609539-sony-turntable.jpg",
    "pubDate": "2025-11-25T01:15:00+00:00"
  },
  {
    "title": "Schumer Faces Pushback From ‘Fight Club’ Group of Senate Democrats",
    "description": "A group of liberal senators is quietly challenging the minority leader over his approach to the midterms and President Trump, in a sign of the party’s deep frustration.",
    "link": "https://www.nytimes.com/2025/11/24/us/politics/schumer-democrats-senate-fight-club.html",
    "thumbnail": "https://static01.nyt.com/images/2025/11/24/multimedia/pol-dem-senators-cjgk/pol-dem-senators-cjgk-facebookJumbo.jpg",
    "pubDate": "2025-11-25T01:07:27+00:00"
  },
  {
    "title": "Suit Up For The Racetrack With These Mario Kart Racing Jackets",
    "description": "Mario Kart Canvas Racing Jacket Kids (Red) $50 See at Target Mario Kart Canvas Racing Jacket Kids (White) $50 See at Target Mario Kart Canvas Racing Jacket Adults (White) $70 See at Target Discounts on Blu-rays, video games, and TVs are par for the course during Black Friday, but Target is also offering some limited-edition fashion during this time of the year, including limited-edition Mart Kart Canvas Racing Jackers. These jackets look like authentic racing attire you'd seen worn by drivers and pit crew in real-world racing events, but they sport logos, emblems, and other details inspired by the Mario Kart series. The Jacket is available in red and white kid sizes for $50, or $70 for Adu for adult sizes. Mario Kart Canvas Racing Jacket Kids (Red) $50 The first jacket design in stock at Target is a bold red racing jacket. It has the Mario Kart logo embroidered on the right sleeve and on the shoulders, a fully embroidered back emblem celebrating the game's 1992 debut, and badges on the chest that pay tribute to the classic game. It's complemented by black and white accents, and this jacket is tailored for kids. See at Target Mario Kart Canvas Racing Jacket Kids (White) $50 The white canvas jacket is a vintage-inspired piece of clothing. Made from 100% cotton heavyweight canvas, it has the Mario Kart logo on the right sleeve and shoulders, black and red accents, and the back is full of adverts found in classic Mario Kart games. You'll find several in-game companies here, like Bowser Oil, Bob-Omb Plugs, and more. This jacket is also sized for kids. See at Target Mario Kart Canvas Racing Jacket Adults (White) $70 For grown-ups looking to wear Mario Kart-inspired clothing, the white canvas jacket is also available in general adult sizes. See at Target If you're looking for more gifts for the Nintendo fan in your life, you're in luck. Nintendo's official Black Friday deals are now live, with plenty of games, Amiibo figures, and other official merch on sale while supplies last. Switch and Switch 2 owners can check out our guide on a the over 150 games on sale, or check the links below for even more Nintendo Black Friday deals. And for deals on other video games, Blu-rays, collecitbles, and more, check out GameSpot's Black Friday Deals Hub. Nintendo Black Friday Deals See Switch deals at Amazon See Switch 2 deals at Amazon See all gaming deals at Amazon See Switch game deals at Best Buy Nintendo Black Friday 2025 Game Sale Save up to 50% on Nintendo Switch exclusives. See at Walmart See at Amazon See at Best Buy See at Target Amazon Black Friday Gaming Deals Check out all of the video game and hardware discounts. See at Amazon Sign up for GameSpot's Weekly Deals Newsletter: Continue Reading at GameSpot",
    "link": "https://www.gamespot.com/articles/mario-kart-racing-jackets-bf2025/1100-6536452/?ftag=CAD-01-10abi2f",
    "thumbnail": "https://www.gamespot.com/a/uploads/screen_kubrick/1601/16018044/4609397-mario-kart-jacket.jpg",
    "pubDate": "2025-11-25T01:01:00+00:00"
  },
  {
    "title": "What to Know About Trump’s Peace Plan for Russia and Ukraine",
    "description": "U.S. officials have responded to a storm of criticism about the plan by insisting that it is still a work in progress.",
    "link": "https://www.nytimes.com/2025/11/24/us/politics/trump-peace-plan-russia-ukraine.html",
    "thumbnail": "https://static01.nyt.com/images/2025/11/24/multimedia/24dc-explainer-hjcb/24dc-explainer-hjcb-facebookJumbo.jpg",
    "pubDate": "2025-11-25T00:42:05+00:00"
  },
  {
    "title": "Far Cry TV Series Heading To Hulu, Will Star Always Sunny Creator",
    "description": "Earlier this year, Ubisoft accidentally leaked the first word that a Far Cry TV series was in development with It's Always Sunny in Philadelphia star Rob Mac and Alien: Earth creator Noah Hawley. Now, it's official. Far Cry is going forward as television show on FX and Hulu. According to The Hollywood Reporter, Far Cry will be an anthology similar to Fargo, the series that Hawley brought to FX over a decade ago. FX notes that each season of Far Cry will have a new setting and a new cast of characters. Mac--who was formerly known as Rob McElhenney--will executive produce and star in the first season of the series. Ubisoft's official account for Far Cry quickly shared the news as well. Continue Reading at GameSpot",
    "link": "https://www.gamespot.com/articles/far-cry-tv-series-heading-to-hulu-will-star-always-sunny-creator/1100-6536483/?ftag=CAD-01-10abi2f",
    "thumbnail": "https://www.gamespot.com/a/uploads/screen_kubrick/1837/18375603/4611661-farcry.jpg",
    "pubDate": "2025-11-25T00:42:00+00:00"
  },
  {
    "title": "As Ukraine Sets ‘Red Lines,’ a U.S. Peace Plan Is Slimmed Down",
    "description": "Washington and Kyiv said that “highly productive” discussions over a proposal to end the war between Russia and Ukraine would continue.",
    "link": "https://www.nytimes.com/2025/11/24/world/europe/ukraine-zelensky-rubio-russia-peace-plan.html",
    "thumbnail": "https://static01.nyt.com/images/2025/11/24/multimedia/24int-ukraine-diplo-sub-01-cphv/24int-ukraine-diplo-sub-01-cphv-facebookJumbo.jpg",
    "pubDate": "2025-11-25T00:34:34+00:00"
  },
  {
    "title": "SOL rebounds alongside wider crypto market bounce: Is $160 possible?",
    "description": "SOL price rallied to $140, but weak derivatives market metrics and stagnate network fees show limited investor confidence. Is a retest of the $160 possible?",
    "link": "https://cointelegraph.com/news/sol-rebounds-as-crypto-market-recovers-is-dollar160-next?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
    "thumbnail": "https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=1200/https://s3.cointelegraph.com/uploads/2025-11/019ab810-6904-7f53-af66-099afee2daad",
    "pubDate": "2025-11-25T00:30:06+00:00"
  },
  {
    "title": "Blackrock's iShares bitcoin fund sees record exodus as crypto heads for worst month since 2022",
    "description": "Blackrock's spot bitcoin ETF has so far seen $2.2 billion worth of outflows in November as its underlying crypto continues to crater.",
    "link": "https://www.cnbc.com/2025/11/24/blackrocks-ishares-bitcoin-fund-sees-record-exodus-as-crypto-heads-for-worst-month-since-2022.html",
    "thumbnail": "https://image.cnbcfm.com/api/v1/image/108182561-1754505738635-gettyimages-2225439721-img_8850.jpeg?v=1764026732&w=1920&h=1080",
    "pubDate": "2025-11-25T00:23:01+00:00"
  },
  {
    "title": "How the Coast Guard Revised Its Policy on Swastikas, Nooses and Bullying",
    "description": "After days of backlash, the Homeland Security Department said hateful and violent behavior would not be tolerated.",
    "link": "https://www.nytimes.com/2025/11/24/us/coast-guard-hate-policy.html",
    "thumbnail": "https://static01.nyt.com/images/2025/11/24/multimedia/24dc-coast-guard-gfbp/24dc-coast-guard-gfbp-facebookJumbo.jpg",
    "pubDate": "2025-11-25T00:21:14+00:00"
  },
  {
    "title": "New Details Emerge About Fired Rockstar Devs And The Messages They Shared",
    "description": "Near the end of October, Rockstar Games fired more than 30 employees across offices in the United Kingdom and Canada. At the time, Rockstar and its parent company, Take-Two Interactive, said that the employees had been terminated over \"gross misconduct.\" But now People Make Games has reported that these employees' dismissal didn't have anything to do with spilling secrets from Grand Theft Auto 6 or any other Rockstar projects. According to People Make Games, the issue at hand arose over internal company messages that were shared on a Discord server used by staff members and representatives of the Independent Workers' Union of Great Britain. However, the messages shared were about changes to Rockstar's Slack policy, which eliminated channels where workers could chat about topics outside of the office. The report notes that Rockstar has such tight security that employees can't even check their email unless they're physically in the office. One of the employees apparently posted the Slack changes to the Discord server at a time when most of the other devs hadn't received any correspondence about it yet. Continue Reading at GameSpot",
    "link": "https://www.gamespot.com/articles/new-details-emerge-about-fired-rockstar-devs-and-the-messages-they-shared/1100-6536482/?ftag=CAD-01-10abi2f",
    "thumbnail": "https://www.gamespot.com/a/uploads/screen_kubrick/1837/18375603/4611579-grandtheftauto6.jpg",
    "pubDate": "2025-11-25T00:19:00+00:00"
  },
  {
    "title": "Six Flags' turnaround could take a while, Jim Cramer says",
    "description": "CNBC's Jim Cramer on Monday reviewed Six Flags' prospects.",
    "link": "https://www.cnbc.com/2025/11/24/jim-cramer-six-flags-turnaround.html",
    "thumbnail": "https://image.cnbcfm.com/api/v1/image/107363777-1706107823459-gettyimages-1764881092-CEDAR_FAIR_SIX_FLAGS.jpeg?v=1761263704&w=1920&h=1080",
    "pubDate": "2025-11-25T00:11:46+00:00"
  },
  {
    "title": "Video Game Remakes Shouldn't Be Exact Remakes",
    "description": "Looking at my past few years of reviews for GameSpot, I've noticed a trend: I've looked at a lot of remakes and remasters. A lot of them have been good--great, even. It makes me happy to see games that had a big impact in Japan in their heyday, like Live A Live and Romancing SaGa 2, finally make the journey overseas. But lately, I've been feeling like these remakes specifically are lacking something. While I enjoyed many of these titles, there was just something I couldn't put my finger on that felt off. I thought that maybe I was experiencing a sort of odd fatigue from having gone through so many of them over the past few years, but when I played through Dragon Quest I and II HD recently, I was finally able to figure out exactly what's irking me. So many remakes lack ambition. Continue Reading at GameSpot",
    "link": "https://www.gamespot.com/articles/video-game-remakes-shouldnt-be-exact-remakes/1100-6536411/?ftag=CAD-01-10abi2f",
    "thumbnail": "https://www.gamespot.com/a/uploads/screen_kubrick/1532/15327795/4608239-0837747090-ff7-r.jpg",
    "pubDate": "2025-11-25T00:05:00+00:00"
  },
  {
    "title": "Has Britain's budget watchdog become too all-powerful?",
    "description": "Ahead of this week's Budget, some have accused the Office for Budget Responsibility of being a \"straitjacket on growth\"",
    "link": "https://www.bbc.com/news/articles/clyx9n5p7v7o?at_medium=RSS&at_campaign=rss",
    "thumbnail": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/10b0/live/c2f81410-c950-11f0-8c06-f5d460985095.jpg",
    "pubDate": "2025-11-25T00:00:03+00:00"
  },
  {
    "title": "Alphabet's Gemini poses a serious threat to OpenAI's ChatGPT, Jim Cramer says",
    "description": "CNBC's Jim Cramer explained why he thinks Gemini could be ChatGPT's biggest challenger.",
    "link": "https://www.cnbc.com/2025/11/24/alphabets-gemini-poses-a-serious-threat-to-openais-chatgpt-jim-cramer-says.html",
    "thumbnail": "https://image.cnbcfm.com/api/v1/image/106598386-1593554406183img_3354rr.jpg?v=1694561360&w=1920&h=1080",
    "pubDate": "2025-11-24T23:29:47+00:00"
  },
  {
    "title": "Sandisk joins S&amp;P 500 following Western Digital spinoff, replacing Interpublic",
    "description": "Sandisk will join competitor Micron in the S&amp;P 500 after getting spun out of Western Digital earlier this year.",
    "link": "https://www.cnbc.com/2025/11/24/sandisk-will-replace-interpublic-in-sp-500-after-western-digital-spin.html",
    "thumbnail": "https://image.cnbcfm.com/api/v1/image/108231346-1764025720485-gettyimages-2228242640-Variety_2025_Power_of_Young_Hollywood_Party_Presented_by_SANDISK.jpeg?v=1764027017&w=1920&h=1080",
    "pubDate": "2025-11-24T23:28:39+00:00"
  },
  {
    "title": "Judge dismisses James Comey and Letitia James cases over 'unlawful' prosecutor appointment",
    "description": "Senior U.S. District Judge Cameron Currie ruled that Lindsey Halligan, the interim U.S. attorney who brought both indictments, was invalidly appointed.",
    "link": "https://www.cnbc.com/2025/11/24/trump-comey-james-indictments-halligan.html",
    "thumbnail": "https://image.cnbcfm.com/api/v1/image/108210819-1760126029633-James_Comey.jpg?v=1764006481&w=1920&h=1080",
    "pubDate": "2025-11-24T23:21:36+00:00"
  },
  {
    "title": "Mark Kelly Under Pentagon Investigation for ‘Illegal Orders’ Video",
    "description": "The defense secretary called the senator’s remarks urging troops not to follow illegal orders “despicable, reckless, and false.”",
    "link": "https://www.nytimes.com/2025/11/24/us/politics/mark-kelly-pentagon-investigation.html",
    "thumbnail": "https://static01.nyt.com/images/2025/11/24/multimedia/24dc-kelly-lmwj/24dc-kelly-lmwj-facebookJumbo.jpg",
    "pubDate": "2025-11-24T23:10:26+00:00"
  },
  {
    "title": "Trump orders blacklisting Muslim Brotherhood branches as ‘terrorist’ groups",
    "description": "White House cites groups' alleged support for Hamas, accusing them of waging campaign against US interests and allies.",
    "link": "https://www.aljazeera.com/news/2025/11/24/trump-orders-blacklisting-muslim-brotherhood-branches-as-terrorist-groups?traffic_source=rss",
    "thumbnail": "https://www.aljazeera.com/wp-content/uploads/2025/11/2025-11-22T170417Z_924680305_RC2R1IAYKGWL_RTRMADP_3_USA-TRUMP-1764024330.jpg?resize=1920%2C1440",
    "pubDate": "2025-11-24T23:02:45+00:00"
  },
  {
    "title": "Israel kills four Palestinians in Gaza; fighters recover body of captive",
    "description": "Palestinians face renewed killings, raids and settler attacks as Israel pushes past agreed ceasefire lines.",
    "link": "https://www.aljazeera.com/news/2025/11/24/israel-kills-four-palestinians-as-attacks-continue-despite-gaza-ceasefire?traffic_source=rss",
    "thumbnail": "https://www.aljazeera.com/wp-content/uploads/2025/11/13528820-1763903520.jpg?resize=1920%2C1440",
    "pubDate": "2025-11-24T22:52:49+00:00"
  },
  {
    "title": "Here’s what happened in crypto today",
    "description": "Need to know what happened in crypto today? Here is the latest news on daily trends and events impacting Bitcoin price, blockchain, DeFi, NFTs, Web3 and crypto regulation.",
    "link": "https://cointelegraph.com/news/what-happened-in-crypto-today?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
    "thumbnail": "https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=1200/https://s3.cointelegraph.com/uploads/2025-06/01979423-ef8e-7c60-b937-b9ddf75fe8ad",
    "pubDate": "2025-11-24T22:37:53+00:00"
  },
  {
    "title": "Everton beat Man Utd despite Gueye seeing red for slapping teammate",
    "description": "Kiernan Dewsbury-Hall's superb first-half goal seals 1-0 win for the visitors, who had 10 players for most of the game.",
    "link": "https://www.aljazeera.com/sports/2025/11/24/everton-beat-man-utd-despite-gueye-seeing-red-for-slapping-teammate?traffic_source=rss",
    "thumbnail": "https://www.aljazeera.com/wp-content/uploads/2025/11/ap_6924c260dc4c2-1764016736_da1f94-1764022846.jpg?resize=1200%2C630&quality=80",
    "pubDate": "2025-11-24T22:25:15+00:00"
  },
  {
    "title": "How X's new location feature exposed big US politics accounts",
    "description": "Dozens of pro-Trump accounts are being accused of misleading followers after the social media site began showing user locations.",
    "link": "https://www.bbc.com/news/articles/cj38m11218xo?at_medium=RSS&at_campaign=rss",
    "thumbnail": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/515e/live/58e51790-c954-11f0-9fb5-5f3a3703a365.png",
    "pubDate": "2025-11-24T22:21:37+00:00"
  },
  {
    "title": "JFK's granddaughter raises awareness of rare leukaemia with poignant essay",
    "description": "Doctors say Tatiana Schlossberg's struggle - even with the best care as a member of a prominent family - emphasises the need for more research.",
    "link": "https://www.bbc.com/news/articles/cj9ynjg3zy0o?at_medium=RSS&at_campaign=rss",
    "thumbnail": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/404c/live/339002a0-c983-11f0-84b0-85226717c3ac.jpg",
    "pubDate": "2025-11-24T22:18:53+00:00"
  },
  {
    "title": "Mining economics tighten as record hashrate meets falling Bitcoin price: Report",
    "description": "Mining margins weaken as hash price declines and rig payback periods stretch, even as listed miners rally on analyst upgrades and new HPC agreements.",
    "link": "https://cointelegraph.com/news/mining-economics-hashrate-bitcoin-price-report?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
    "thumbnail": "https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=1200/https://s3.cointelegraph.com/uploads/2025-11/019ab7b5-e4d3-7810-8f71-adfaa887400b",
    "pubDate": "2025-11-24T22:14:36+00:00"
  },
  {
    "title": "XRP, SUI Lead Crypto Rebound as Bitcoin Tops $89K; Relief Rally Faces $100K Wall, Trader Says",
    "description": "Traders now see a December rate cut increasingly likely, following fresh comments from San Francisco Fed President Mary Daly.",
    "link": "https://www.coindesk.com/markets/2025/11/24/xrp-sui-lead-crypto-rebound-as-bitcoin-tops-usd89k-relief-rally-faces-usd100k-wall-trader-says",
    "thumbnail": "",
    "pubDate": "2025-11-24T22:14:08+00:00"
  },
  {
    "title": "Japanese watchdog to require exchanges to hold liability reserves: Report",
    "description": "An advisory body to Japan's FSA will reportedly release a report recommending crypto companies hold reserves to compensate users for events such as hacks.",
    "link": "https://cointelegraph.com/news/japan-fsa-crypto-exchanges-liability-reserves-report?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
    "thumbnail": "https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=1200/https://s3.cointelegraph.com/uploads/2025-07/019846be-7bfe-79cf-9e14-61ba38f88114",
    "pubDate": "2025-11-24T21:45:50+00:00"
  },
  {
    "title": "Farage says he's 'never directly racially abused anybody' after school racism claims",
    "description": "The Reform UK leader was responding to reports he made racist remarks to his peers in school in the 1970s.",
    "link": "https://www.bbc.com/news/articles/c87lx0981nro?at_medium=RSS&at_campaign=rss",
    "thumbnail": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/fc1c/live/95764220-c999-11f0-9fb5-5f3a3703a365.png",
    "pubDate": "2025-11-24T21:37:18+00:00"
  },
  {
    "title": "Titmouse's Drunkards, Druggies, &amp; Delinquents drinking game is a rowdy but robust TTRPG",
    "description": "The studio's founder and CEO Chris Prynoski reveals how a gag gift evolved into Titmouse's first-ever board game.",
    "link": "https://www.polygon.com/titmouse-board-game-drunkards-druggies-delinquents/",
    "thumbnail": "https://static0.polygonimages.com/wordpress/wp-content/uploads/2025/11/l4l06h68j2ymse0h1271psxaezwe.jpeg?w=1600&h=900&fit=crop",
    "pubDate": "2025-11-24T21:30:15+00:00"
  },
  {
    "title": "Final Fantasy MTG Commander deck gets major price drop on Amazon",
    "description": "One precon from Magic's biggest set ever just hit an all-time low price",
    "link": "https://www.polygon.com/magic-final-fantasy-commander-deck-mtg-sale-amazon/",
    "thumbnail": "https://static0.polygonimages.com/wordpress/wp-content/uploads/2025/11/fin_lgp_key_24x36.jpg?w=1600&h=900&fit=crop",
    "pubDate": "2025-11-24T21:23:37+00:00"
  },
  {
    "title": "Filecoin Rises 2% After Breaking $1.63 Resistance",
    "description": "FIL broke out on heavy volume as technical momentum accelerated past critical threshold levels.",
    "link": "https://www.coindesk.com/markets/2025/11/24/filecoin-rises-2-after-breaking-usd1-63-resistance",
    "thumbnail": "",
    "pubDate": "2025-11-24T21:17:38+00:00"
  },
  {
    "title": "Army Chief Says France Must ‘Accept Losing Our Children,’ Igniting Uproar",
    "description": "The furor erupted as President Emmanuel Macron is expected to present a plan for paid, voluntary military service to bolster the armed forces against the threat from Russia.",
    "link": "https://www.nytimes.com/2025/11/24/world/europe/france-voluntary-military-service.html",
    "thumbnail": "https://static01.nyt.com/images/2025/11/24/multimedia/24int-France-Army-01-zmcj/24int-France-Army-01-zmcj-facebookJumbo.jpg",
    "pubDate": "2025-11-24T21:10:41+00:00"
  },
  {
    "title": "Revolut hits $75B valuation following share sale, global push",
    "description": "Revolut has completed a private share sale with participation from major investment firms. The transaction also allowed employees to sell shares.",
    "link": "https://cointelegraph.com/news/revolut-75b-valuation-share-sale?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
    "thumbnail": "https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=1200/https://s3.cointelegraph.com/uploads/2025-11/019ab73c-3263-7d3c-943b-6a689985c2a1",
    "pubDate": "2025-11-24T21:04:54+00:00"
  },
  {
    "title": "Crypto Wallet Firm Exodus Buys Baanx and Monavate for $175M",
    "description": "The U.S.-listed wallet provider is acquiring W3C Corp, the parent company of crypto card and payments firms Baanx and Monavate.",
    "link": "https://www.coindesk.com/business/2025/11/24/crypto-wallet-firm-exodus-buys-baanx-and-monavate-for-usd175m",
    "thumbnail": "",
    "pubDate": "2025-11-24T21:00:00+00:00"
  },
  {
    "title": "After Xbox Bodywash Comes The Inevitable Next Step: Xbox Crocs",
    "description": "Microsoft's next product category has emerged. No, it's not more Xbox bodywash. It's shoes. More specifically, Microsoft is teaming up with Crocs, Inc. for a new line of Xbox-branded Crocs and themed Jibbitz. The shoes go on sale tomorrow, November 25, so you don't have to wait very long to get your feet into them. The $80 shoes have been \"designed with gamers in mind,\" the company said. The individual black-and-green shoes are labeled \"Player Left\" and \"Player Right,\" and include fixed joysticks and buttons on them, replicating the Xbox controller. Crocs will also sell a five-pack of Jibbitz charms, focused on Xbox franchises like Halo, Doom, Fallout, World of Warcraft, and Sea of Thieves. Continue Reading at GameSpot",
    "link": "https://www.gamespot.com/articles/xbox-crocs-are-real-and-they-look-amazing/1100-6536475/?ftag=CAD-01-10abi2f",
    "thumbnail": "https://www.gamespot.com/a/uploads/screen_kubrick/1179/11799911/4611527-screenshot2025-11-24at3.51.51%E2%80%AFpm.png",
    "pubDate": "2025-11-24T20:54:00+00:00"
  },
  {
    "title": "Even Charlie Cox thinks his Game Awards nomination for Expedition 33 is misplaced",
    "description": "While he's \"thrilled\" to be nominated, Cox deflected praise onto one of his Expedition 33 co-stars — something The Game Awards should do itself.",
    "link": "https://www.polygon.com/clair-obscur-expedition-33-charlie-cox-gustave-game-awards-nomination/",
    "thumbnail": "https://static0.polygonimages.com/wordpress/wp-content/uploads/2025/10/clair-obscur-expedition-33-lune-and-gustave-in-front-of-the-monolith.jpg?w=1600&h=900&fit=crop",
    "pubDate": "2025-11-24T20:53:12+00:00"
  },
  {
    "title": "What it's like to work from home in Skyrim VR",
    "description": "YouTuber habie147 spent the day organizing spreadsheets, fielding calls, and fighting dragons in Skyrim VR",
    "link": "https://www.polygon.com/skyrim-vr-working-from-home/",
    "thumbnail": "https://static0.polygonimages.com/wordpress/wp-content/uploads/2025/11/skyrimvr.jpg?w=1600&h=900&fit=crop",
    "pubDate": "2025-11-24T20:48:32+00:00"
  },
  {
    "title": "Steam Awards' GOTY nominations are live and really fun",
    "description": "You can vote for games you're bad at, and games with cool innovations, among other inventive categories for the Steam's 2025 awards",
    "link": "https://www.polygon.com/steam-goty-awards-nominations-fan-votes-troll-winter-sale/",
    "thumbnail": "https://static0.polygonimages.com/wordpress/wp-content/uploads/chorus/uploads/chorus_asset/file/24347729/steam_stock_art.jpg?w=1600&h=900&fit=crop",
    "pubDate": "2025-11-24T20:36:34+00:00"
  },
  {
    "title": "HBO Max Black Friday deal is a cheap way to watch Game of Thrones, DCU",
    "description": "Black Friday 2025's best streaming deal may be HBO Max's 70% off deal for 12 months.",
    "link": "https://www.polygon.com/hbo-maxs-black-friday-deal/",
    "thumbnail": "https://static0.polygonimages.com/wordpress/wp-content/uploads/chorus/uploads/chorus_asset/file/25127131/Matt_Smith_HOTD.jpg?w=1600&h=900&fit=crop",
    "pubDate": "2025-11-24T20:30:30+00:00"
  },
  {
    "title": "XRP jumps 8% as Franklin Templeton, Grayscale ETFs begin trading",
    "description": "The investment vehicle tied to XRP launched amid other offerings from Grayscale, Bitwise Asset Management and Canary Capital.",
    "link": "https://cointelegraph.com/news/franklin-templeton-xrp-etf-nyse?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
    "thumbnail": "https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=1200/https://s3.cointelegraph.com/uploads/2025-01/01947798-c7f7-70e4-929e-00bf82848ce2",
    "pubDate": "2025-11-24T20:22:33+00:00"
  },
  {
    "title": "Ex-GTA Boss Dan Houser Thinks AI Is Overrated",
    "description": "Rockstar Games co-founder Dan Houser may have included an advanced AI as a plot in his new novel, A Better Paradise: Volume One - An Aftermath, but he's not as impressed with the current state of the technology. During a recent appearance, Houser didn't completely downplay AI, but he noted that the technology isn't everything some of its proponents have made it out to be. While making a guest appearance on Channel 4's Sunday Brunch, Houser acknowledged that his upcoming video game based on A Better Paradise may have some AI. But he also warned that the technology behind AI can't live up to its biggest promises yet. \"We are dabbling in using AI, but the truth is a lot of it's not as useful as some of the companies would have you believe yet,\" said Houser. \"It's not going to solve all of the problems, you know. We have a whole field of areas we need technology for and AI is great at some of the tasks and can't do the other tasks yet.\" Continue Reading at GameSpot",
    "link": "https://www.gamespot.com/articles/ex-gta-boss-dan-houser-thinks-ai-is-overrated/1100-6536480/?ftag=CAD-01-10abi2f",
    "thumbnail": "https://www.gamespot.com/a/uploads/screen_kubrick/1837/18375603/4611491-grandtheftautov.jpg",
    "pubDate": "2025-11-24T19:59:00+00:00"
  },
  {
    "title": "TON Rallies 8% as Telegram Ecosystem Expands With AI Launch, Tokenized Stocks",
    "description": "Recent developments include the launch of Confidential Compute Open Network (COCOON) and the integration of tokenized US stocks and digital collectibles.",
    "link": "https://www.coindesk.com/markets/2025/11/24/ton-rallies-8-as-telegram-ecosystem-expands-with-ai-launch-tokenized-stocks",
    "thumbnail": "",
    "pubDate": "2025-11-24T19:57:16+00:00"
  },
  {
    "title": "How Pluribus pulled off its biggest stunt yet",
    "description": "Pluribus' Nito Larioza goes behind the scenes on episode 4, \"Please, Carol. Here's why bird movement and \"Think of chocolate\" are his go-to tips.",
    "link": "https://www.polygon.com/pluribus-hivemind-interview-episode-4-please-carol-nito-larioza/",
    "thumbnail": "https://static0.polygonimages.com/wordpress/wp-content/uploads/2025/11/chocolate.jpg?w=1600&h=900&fit=crop",
    "pubDate": "2025-11-24T19:29:25+00:00"
  },
  {
    "title": "Updated peace plan could be a deal Ukraine will take - eventually",
    "description": "The proposed plan is said to have been significantly changed since Sunday - but key sticking points are likely to remain.",
    "link": "https://www.bbc.com/news/articles/cn4d27dx80no?at_medium=RSS&at_campaign=rss",
    "thumbnail": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/0aee/live/7be5d510-c94d-11f0-abcf-97df5562f205.jpg",
    "pubDate": "2025-11-24T19:23:14+00:00"
  },
  {
    "title": "CME Crypto Futures Volume Hits Record 795K Contracts Amid Volatility",
    "description": "A surge in institutional and retail demand has pushed CME’s crypto average daily volume up 132% year-over-year, with open interest climbing 82%.",
    "link": "https://www.coindesk.com/markets/2025/11/24/cme-crypto-futures-volume-hits-record-795k-contracts-amid-volatility",
    "thumbnail": "",
    "pubDate": "2025-11-24T19:09:44+00:00"
  },
  {
    "title": "Lego Minecraft Crafting Table Diorama Gets Huge Price Cut For Black Friday",
    "description": "Lego Minecraft: The Crafting Table (1,195 Pieces) $63 (was $90) | Retiring Soon See at Amazon See at Walmart See at Best Buy Sold out at Target Lego Minecraft: The Creeper (665 Pieces) $32 (was $40) See at Amazon See at Walmart See at Target If you're shopping for a Minecraft fan this holiday season, check out this awesome Black Friday deal on Lego's Crafting Table diorama. The 1,195-piece building set is on sale for only $63 (was $90) at Amazon, Walmart, and Best Buy. Lego is retiring The Crafting Table soon, so once this deal sells out, there's no guarantee retailers will replenish their inventory. It also happens to be the only Minecraft Lego set in the 18+ display model lineup for adult builders and collectors. The Crafting Table is the best Lego Minecraft deal during Black Friday week (so far), but fans can save on a bunch of other products in the collection, including the exceedingly popular 665-piece Creeper figure. We included a list of the best Lego Minecraft deals available now at the bottom of this article. Continue Reading at GameSpot",
    "link": "https://www.gamespot.com/articles/lego-minecraft-crafting-table-diorama-gets-huge-price-cut-for-black-friday/1100-6535384/?ftag=CAD-01-10abi2f",
    "thumbnail": "https://www.gamespot.com/a/uploads/screen_kubrick/1595/15950357/4611479-minecraftcraftingtableblackfridaydealthumbnaiil.png",
    "pubDate": "2025-11-24T19:06:00+00:00"
  },
  {
    "title": "BNB Rebounds Above $860 After Testing Key Support",
    "description": "The recovery lifted BNB above multiple resistance zones, but the relatively low volume behind the move may limit follow-through as traders watch the $870 level.",
    "link": "https://www.coindesk.com/markets/2025/11/24/bnb-rebounds-above-usd860-after-testing-key-support",
    "thumbnail": "",
    "pubDate": "2025-11-24T19:01:12+00:00"
  },
  {
    "title": "Kirby Air Riders is the best multiplayer game of the fall",
    "description": "Kirby Air Riders' City Trial mode has enough hidden depth to make it a multiplayer obsession, even while games like Arc Raiders dominate the charts.",
    "link": "https://www.polygon.com/kirby-air-riders-city-trial-multiplayer/",
    "thumbnail": "https://static0.polygonimages.com/wordpress/wp-content/uploads/2025/11/kirby-air-riders-attack.png?w=1600&h=900&fit=crop",
    "pubDate": "2025-11-24T19:00:15+00:00"
  },
  {
    "title": "Celestia’s TIA Token Rises as ‘Matcha’ Upgrade Preps Network for Cross-Chain Future",
    "description": "The event is being called its biggest software upgrade yet, which boosts the network’s capacity and improves token economics.",
    "link": "https://www.coindesk.com/tech/2025/11/24/celestia-s-tia-token-rises-as-matcha-upgrade-preps-network-for-cross-chain-future",
    "thumbnail": "",
    "pubDate": "2025-11-24T18:54:57+00:00"
  },
  {
    "title": "Fortnite's \"sweaty\" problem could be its downfall",
    "description": "The Simpsons season has been plagued with complaints from players who are sick of losing, but don't want to play friendlier modes like Delulu",
    "link": "https://www.polygon.com/fortnite-no-sweat-weekend-mode-battle-royale-fun/",
    "thumbnail": "https://static0.polygonimages.com/wordpress/wp-content/uploads/2025/11/fortnite-delulu.jpg?w=1600&h=900&fit=crop",
    "pubDate": "2025-11-24T18:48:10+00:00"
  },
  {
    "title": "Assassin's Creed Shadows is getting an Attack on Titan crossover event",
    "description": "Ubisoft launches a surprise AC Shadows x Attack on Titan holiday event with free story content and exclusive items, available Nov 25 to Dec 22",
    "link": "https://www.polygon.com/assassins-creed-shadows-attack-on-titan-crossover-event/",
    "thumbnail": "https://static0.polygonimages.com/wordpress/wp-content/uploads/2025/11/acsh_tu11_aot_keyart_nov24_6pmcet.jpg?w=1600&h=900&fit=crop",
    "pubDate": "2025-11-24T18:41:25+00:00"
  },
  {
    "title": "Stellar Climbs 3.5% to $0.25 as Technical Recovery Gains Momentum",
    "description": "Network fundamentals improved alongside price action as token demonstrated resilience following recent consolidation period.",
    "link": "https://www.coindesk.com/markets/2025/11/24/stellar-climbs-3-5-to-usd0-25-as-technical-recovery-gains-momentum",
    "thumbnail": "",
    "pubDate": "2025-11-24T18:15:34+00:00"
  },
  {
    "title": "Amazon to spend up to $50 billion on AI infrastructure for U.S. government",
    "description": "The project will add 1.3 gigawatts of capacity across new data centers, with Amazon expected to break ground in 2026.",
    "link": "https://www.cnbc.com/2025/11/24/amazon-to-spend-up-to-50-billion-on-ai-services-for-us-government.html",
    "thumbnail": "https://image.cnbcfm.com/api/v1/image/108214314-17609846542025-10-20t181828z_76548831_rc2ofhahwau7_rtrmadp_0_amazon-outages-aws.jpeg?v=1760984688&w=1920&h=1080",
    "pubDate": "2025-11-24T17:50:47+00:00"
  },
  {
    "title": "HBAR Gains 2.4% From Major Support as Axelar Integration Drives DeFi Activity",
    "description": "Volume surge validates advance despite token's underperformance versus broader crypto market rally.",
    "link": "https://www.coindesk.com/markets/2025/11/24/hbar-gains-2-4-from-major-support-as-axelar-integration-drives-defi-activity",
    "thumbnail": "",
    "pubDate": "2025-11-24T17:35:10+00:00"
  },
  {
    "title": "Michael Burry launches newsletter to lay out his AI bubble views after deregistering hedge fund",
    "description": "\"The Big Short\" investor is capitalizing on the massive audience he's built on X, where 1.6 million followers have long parsed his cryptic posts.",
    "link": "https://www.cnbc.com/2025/11/24/michael-burry-launches-newsletter-to-lay-out-his-ai-bubble-views-after-deregistering-hedge-fund.html",
    "thumbnail": "https://image.cnbcfm.com/api/v1/image/106091765-1566479308096gettyimages-498562218.jpeg?v=1764031869&w=1920&h=1080",
    "pubDate": "2025-11-24T16:30:25+00:00"
  },
  {
    "title": "Many retirees soon must take year-end required withdrawals — and mistakes can be costly",
    "description": "Many retirees soon must take required minimum distributions and mistakes can be costly. Here's how to avoid them.",
    "link": "https://www.cnbc.com/2025/11/24/biggest-required-minimum-distribution-mistakes-.html",
    "thumbnail": "https://image.cnbcfm.com/api/v1/image/108187233-1755529300025-gettyimages-1171931380-5dm41172.jpeg?v=1763740494&w=1920&h=1080",
    "pubDate": "2025-11-24T12:00:01+00:00"
  },
  {
    "title": "Jim Cramer Flutter: “It’s a Really Good Company”",
    "description": "",
    "link": "https://finance.yahoo.com/news/jim-cramer-flutter-really-good-195123618.html",
    "thumbnail": "https://s.yimg.com/ny/api/res/1.2/kHYpzH58CxZP3vxp10BOag--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyMDA7aD04NjE-/https://media.zenfs.com/en/insidermonkey.com/04816330227784e99fa139754a436e25",
    "pubDate": "2025-11-23T19:51:23+00:00"
  },
  {
    "title": "Jim Cramer on fuboTV: “I Like Netflix More, Just Saying”",
    "description": "",
    "link": "https://finance.yahoo.com/news/jim-cramer-fubotv-netflix-more-195122142.html",
    "thumbnail": "https://media.zenfs.com/en/insidermonkey.com/f5aa7b7fa2628207b2118595bb3f6cbf",
    "pubDate": "2025-11-23T19:51:22+00:00"
  },
  {
    "title": "Jim Cramer on Super Group: “It’s Fantastic, I Like It Still”",
    "description": "",
    "link": "https://finance.yahoo.com/news/jim-cramer-super-group-fantastic-195120276.html",
    "thumbnail": "https://s.yimg.com/ny/api/res/1.2/VBbcM6YVUo8EFubW96wkNg--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyMDA7aD04MDA-/https://media.zenfs.com/en/insidermonkey.com/5f241f83ea3e77a50a204217fc3a84bc",
    "pubDate": "2025-11-23T19:51:20+00:00"
  },
  {
    "title": "Jim Cramer on Rocket Companies: “I Got Enough Problems”",
    "description": "",
    "link": "https://finance.yahoo.com/news/jim-cramer-rocket-companies-got-195117451.html",
    "thumbnail": "https://media.zenfs.com/en/insidermonkey.com/dc5a2bcb6b4c16a43cb5b4ba98feb139",
    "pubDate": "2025-11-23T19:51:17+00:00"
  },
  {
    "title": "Jim Cramer on Procter &amp; Gamble: “I Think It’s a Fine Level”",
    "description": "",
    "link": "https://finance.yahoo.com/news/jim-cramer-procter-gamble-think-195115531.html",
    "thumbnail": "https://s.yimg.com/ny/api/res/1.2/p.BDKR7KDy0Dv.qc0k1sUw--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyMDA7aD0xODAw/https://media.zenfs.com/en/insidermonkey.com/ab17cbae959ed841325f2d9cbe730e2f",
    "pubDate": "2025-11-23T19:51:15+00:00"
  },
  {
    "title": "Jim Cramer on Axon: “Motorola is a Powerful Competitor”",
    "description": "",
    "link": "https://finance.yahoo.com/news/jim-cramer-axon-motorola-powerful-195114545.html",
    "thumbnail": "https://s.yimg.com/ny/api/res/1.2/_alTJz2_M_71ZTQTCSjwAw--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyMDA7aD04MDA-/https://media.zenfs.com/en/insidermonkey.com/e7ce02738b547dc513a8196cdef40274",
    "pubDate": "2025-11-23T19:51:14+00:00"
  },
  {
    "title": "Dell, HP Inc., Alibaba, Zoom, Deere, and More Stocks to Watch This Week",
    "description": "",
    "link": "https://www.barrons.com/articles/dell-hp-inc-alibaba-zoom-deere-stocks-to-watch-5967f403?siteid=yhoof2&yptr=yahoo",
    "thumbnail": "",
    "pubDate": "2025-11-23T19:00:00+00:00"
  },
  {
    "title": "GDP, Retail Sales and Other Can't Miss Items this Week",
    "description": "",
    "link": "https://finance.yahoo.com/news/gdp-retail-sales-other-cant-180002788.html",
    "thumbnail": "https://s.yimg.com/ny/api/res/1.2/IHMpg.SuTkOpJxuUGmKwCw--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyMDA7aD03OTc-/https://media.zenfs.com/en/barchart_com_477/a3f8b7b175c2147da9ed22b631b9dee3",
    "pubDate": "2025-11-23T18:00:02+00:00"
  },
  {
    "title": "Bitcoin vs. Ethereum: Which Is More Likely to Be a Millionaire Maker?",
    "description": "",
    "link": "https://finance.yahoo.com/news/bitcoin-vs-ethereum-more-likely-171500913.html",
    "thumbnail": "https://s.yimg.com/ny/api/res/1.2/mL8QYt.1ZfmHOzQozBq1QQ--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyMDA7aD04MDA-/https://media.zenfs.com/en/motleyfool.com/80e3e6dff18e3fdae3620ea8888e4a6e",
    "pubDate": "2025-11-23T17:15:00+00:00"
  },
  {
    "title": "SmartStop Self Storage REIT's (SMA) CEO Buys 6,250 Shares for $198,200",
    "description": "",
    "link": "https://finance.yahoo.com/news/smartstop-self-storage-reits-sma-170829616.html",
    "thumbnail": "https://s.yimg.com/ny/api/res/1.2/V6AdfjZboZPBcVnCdH8MfA--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyMDA7aD0xMDcy/https://media.zenfs.com/en/motleyfool.com/7ec075fe9536bea318d2f65004dd291d",
    "pubDate": "2025-11-23T17:08:29+00:00"
  }
]