[
  {
    "title": "Anxiety of quantum risk to Bitcoin is weighing on its price: Execs",
    "description": "Cypherpunk Adam Back dismissed concerns that quantum computing poses a threat to Bitcoin, arguing the technology is still “ridiculously early.”",
    "link": "https://cointelegraph.com/news/bitcoin-quantum-computing-risk-investor-concerns?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
    "thumbnail": "https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjUtMTIvMDE5YjA4MTItMjkzNS03MjQyLWFiYzktYzA2NTM0ZTc1NDY5.jpg",
    "pubDate": "2025-12-19T01:55:25+00:00"
  },
  {
    "title": "Asia-Pacific markets rise as investors await Bank of Japan decision",
    "description": "Asia-Pacific markets rose as investors on look toward the Bank of Japan decision coming out later in the day.",
    "link": "https://www.cnbc.com/2025/12/19/asia-markets-nikkei-225-kospi-nifty-50-japan-boj-rate-decision.html",
    "thumbnail": "https://image.cnbcfm.com/api/v1/image/108150444-1748310256318-gettyimages-912274822-dsc01512.jpeg?v=1748310279&w=1920&h=1080",
    "pubDate": "2025-12-19T01:47:39+00:00"
  },
  {
    "title": "Drones detect deadly virus in Arctic whales' breath",
    "description": "Whale breath collected by drones is giving clues to the health of wild humpbacks and other whales.",
    "link": "https://www.bbc.com/news/articles/cjdrpkj8111o?at_medium=RSS&at_campaign=rss",
    "thumbnail": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/e2e5/live/12746370-dc4f-11f0-a8dc-93c15fe68710.jpg",
    "pubDate": "2025-12-19T01:44:04+00:00"
  },
  {
    "title": "Democratic State Lawmakers Vow to Unite and Push Back on Trump’s Deportations",
    "description": "Lawmakers from a half-dozen states said Thursday they will use legislation next year to thwart the tactics of federal law enforcement carrying out immigration policies.",
    "link": "https://www.nytimes.com/2025/12/18/us/politics/democrats-trump-deportations.html",
    "thumbnail": "https://static01.nyt.com/images/2025/12/18/multimedia/18nat-states-pushback-1-kjlb/18nat-states-pushback-1-kjlb-facebookJumbo.jpg",
    "pubDate": "2025-12-19T01:39:14+00:00"
  },
  {
    "title": "Police issue arrest warrant for suspect in Brown University attack, sources say",
    "description": "Investigators are also searching for a car they believe was rented by the suspect in the shooting that killed two students and injured nine.",
    "link": "https://www.bbc.com/news/articles/cx2e14z2j9jo?at_medium=RSS&at_campaign=rss",
    "thumbnail": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/9d2f/live/8728c7a0-dc4b-11f0-9440-aba3815b871c.jpg",
    "pubDate": "2025-12-19T01:37:53+00:00"
  },
  {
    "title": "Russia-Ukraine war: List of key events, day 1,394",
    "description": "These are the key developments from day 1,394 of Russia’s war on Ukraine.",
    "link": "https://www.aljazeera.com/news/2025/12/19/russia-ukraine-war-list-of-key-events-day-1394?traffic_source=rss",
    "thumbnail": "https://www.aljazeera.com/wp-content/uploads/2025/12/2025-12-18T095733Z_183837096_RC2XIIAZ4141_RTRMADP_3_UKRAINE-CRISIS-KOSTIANTYNIVKA-1766099777.jpg?resize=1920%2C1440",
    "pubDate": "2025-12-19T01:36:47+00:00"
  },
  {
    "title": "Senate confirms Trump crypto-friendly nominees to take over CFTC, FDIC",
    "description": "In a package of confirmations, the U.S. Senate approved Mike Selig to lead the CFTC and Travis Hill to run the FDIC, both with major potential reach into crypto.",
    "link": "https://www.coindesk.com/policy/2025/12/11/senate-confirms-trump-crypto-friendly-nominees-to-take-over-cftc-fdic",
    "thumbnail": "https://cdn.sanity.io/images/s3y3vcno/production/0aba15d3f3a5517aa5f7bb15e92bfadb3cea4779-907x510.jpg?auto=format&w=960&h=540&crop=focalpoint&fit=clip&q=75&fm=jpg",
    "pubDate": "2025-12-19T01:27:23+00:00"
  },
  {
    "title": "TikTok signs agreement to create new U.S. joint venture, memo says",
    "description": "TikTok's U.S. operations will be housed in a new joint venture, according to a memo sent to employees by CEO Shou Zi Chew.",
    "link": "https://www.cnbc.com/2025/12/18/tik-tok-us-sale-china.html",
    "thumbnail": "https://image.cnbcfm.com/api/v1/image/108202714-1758633533620-gettyimages-2234379353-boivin-notitle250912_npT6m.jpeg?v=1758633559&w=1920&h=1080",
    "pubDate": "2025-12-19T01:12:21+00:00"
  },
  {
    "title": "8BitDo Rare 40th Anniversary Xbox Wireless Controller Is Steeply Discounted",
    "description": "8BitDo Ultimate 3-Mode Wireless Controller: Rare 40th Anniversary Edition $72 (was $90) | For Xbox, PC, Apple, Android See at Amazon Xbox and PC gamers can save big on 8BitDo's first wireless controller for Xbox Series X|S. The 8BitDo Ultimate 3-Mode Rare 40th Anniversary Edition is on sale for $72 (was $90) at Amazon. Officially licensed by Microsoft, this special version of the Ultimate 3-Mode also comes with a matching charging dock, a metal D-pad, Hall Effect sticks, and remappable back buttons. Released in August in celebration of Rare Limited, the controller has a striking blue-and-gold color scheme with symbols and artwork nodding to the Microsoft-owned studio's storied history. Though best known today as the studio behind Sea of Thieves, Rare has a back catalog of classics like Donkey Kong Country, GoldenEye 007, Banjo-Kazooie, Conker, and Perfect Dark. The only other time the controller has been discounted was during Black Friday, and that deal sold out before the sale expired. 8BitDo's Ultimate 3-Mode Rare 40th Anniversary Edition Controller is a great alternative to Microsoft's Xbox Elite Series 2 Controller, which is on sale for $135 (was $200). The controller works wirelessly on Xbox consoles, PC, Apple devices, Android, and Steam Deck. Continue Reading at GameSpot",
    "link": "https://www.gamespot.com/articles/8bitdo-ultimate-3-mode-xbox-wireless-controller-rare-40th-anniversary-edition/1100-6533654/?ftag=CAD-01-10abi2f",
    "thumbnail": "https://www.gamespot.com/a/uploads/square_avatar/1595/15950357/4542490-8bitdorare.png",
    "pubDate": "2025-12-19T01:12:00+00:00"
  },
  {
    "title": "Australia announces gun buyback scheme in wake of Bondi attack",
    "description": "It is the largest scheme since the Port Arthur massacre in 1996, which prompted massive gun law reform.",
    "link": "https://www.bbc.com/news/articles/cn09p4kjj4wo?at_medium=RSS&at_campaign=rss",
    "thumbnail": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/b5fc/live/dae43db0-dc79-11f0-aae2-2191c0e48a3b.jpg",
    "pubDate": "2025-12-19T01:10:15+00:00"
  },
  {
    "title": "Trump Announces $1,776 ‘Warrior Dividend’ for Military",
    "description": "President Trump promised active duty troops a $1,776 check, citing increased revenue raised by tariffs, but the funding is coming from money for the military included in this year’s domestic spending law.",
    "link": "https://www.nytimes.com/2025/12/18/us/trump-address-warrior-dividend-military-check-1776.html",
    "thumbnail": "https://static01.nyt.com/images/2025/12/18/multimedia/OakArticle-6943dc55-cmbp/OakArticle-6943dc55-cmbp-facebookJumbo.jpg",
    "pubDate": "2025-12-19T01:03:38+00:00"
  },
  {
    "title": "Japan's consumer inflation stays above cenbank's target for 44th month, boosting case for a rate hike",
    "description": "Core inflation, which strips out prices of fresh food, remained unchanged from 3% in October, and came in line with Reuters-polled economists' average estimate.",
    "link": "https://www.cnbc.com/2025/12/19/japan-cpi-consumer-inflation-rate-policy-meeting.html",
    "thumbnail": "https://image.cnbcfm.com/api/v1/image/108243411-1766041547599-gettyimages-2230572480-AFP_72797T3.jpeg?v=1766041568&w=1920&h=1080",
    "pubDate": "2025-12-19T00:50:29+00:00"
  },
  {
    "title": "Preorders For Diablo 4: Lord Of Hatred's Official Prequel Novel Are Now Live",
    "description": "Diablo IV: The Lost Horadrim (Novel) $30 | Releases April 21, 2026 See at Amazon The world of Diablo IV will expand when the upcoming Lord of Hatred expansion launches on April 28. However, a week before the new content drops, fans will get a glimpse into the expansion's story with the prequel novel Diablo IV: The Lost Horadrim. This official novel launches on April and will provide context for the Lord of Hatred's main questline and introduce the Skovos Isles region where the expansion takes place. If that sparks your interest, you can preorder the paperback edition of Diablo IV: The Lost Horadrim for $30 at Amazon. The book will also be available as an eBook and Audible audiobook, priced at $15 and $17.52, respectively. Diablo IV: The Lost Horadrim (Novel) $30 | Releases April 21, 2026 Diablo IV: The Lost Horadrim is set in the wake of the cataclysmic reaping by the Angel of Death, Malthael, which leaves humanity and the world of Sanctuary devastated. In an effort to fight against the rising tides of Hell's forces, the Horadric Order sends Lorath, Donan, and Tyrael to the Skovos Isles to uncover the fate of a long-lost expedition. The book's events will tie into the upcoming Diablo IV expansion, Lord of Hatred. It is written by Matthew J. Kirby, who previously wrote the Diablo character tomes for Lorath and Prava. See at Amazon Diablo has a long history in print, and if you're looking to grab a few books--possibly as a devilish stocking-stuffer--there's plenty to choose from. The Diablo art books and character tomes are fun dives into the game's bleak world, combining high-quality prints with rich illustrations to create eye-catching works of art. The character tomes are designed to be in-universe books written from the perspectives of several key Diablo characters, like Cain and Prava, and they use special paper to give each book a worn, weathered look. The first four of these books are also available as part of the Horadric Vault series for $98.39, but it's actually cheaper to purchase each one and the recently released Book of Prava individually. You can also dive into various novels set within the timeline of the first Diablo game. The Sin War is a three-book series covering the conflict that would forever change the destiny of humanity, while Storm of Light is set during Diablo 3 and follows Tyrael as he enacts his boldest plan yet: rebuilding the Horadric Order and preparing them to steal the black Soulstone from the heart of Heaven. Diablo graphic novels are also available for purchase, with two of them chronicling the adventures of two legendary characters from the game series: the legendary Necromancer Rathma and the progenitor of the Barbarians, Bul-Kathos. Continue Reading at GameSpot",
    "link": "https://www.gamespot.com/articles/diablo-4-expansion-prequel-novel-preorder-guide/1100-6536997/?ftag=CAD-01-10abi2f",
    "thumbnail": "https://www.gamespot.com/a/uploads/square_avatar/1601/16018044/4623877-diablo-4-square.jpg",
    "pubDate": "2025-12-19T00:49:00+00:00"
  },
  {
    "title": "New York City Raises the Cap on Permits for Street Vendors",
    "description": "The legislation, which will make thousands more permits available, is part of a package of City Council bills aimed at helping the city’s vendors get on the right side of the law.",
    "link": "https://www.nytimes.com/2025/12/18/nyregion/nyc-street-vendor-permits-cap-raised.html",
    "thumbnail": "https://static01.nyt.com/images/2025/12/18/multimedia/18met-street-vendors-01-cphv/18met-street-vendors-01-cphv-facebookJumbo.jpg",
    "pubDate": "2025-12-19T00:48:09+00:00"
  },
  {
    "title": "Nintendo Wins Latest Round In Its 15-Year Legal Battle Over The Wii",
    "description": "Nintendo has been known to vigorously defend its interests and intellectual properties in court, and one of its longest-running legal battles may be nearing its conclusion. In 2010, the Japanese video game publisher filed a suit in Germany against BigBen Interactive--the previous incarnation of Nacon--over its third-party Wii Remote controllers. Now, the latest ruling has unequivocally gone in Nintendo's favor. As reported by Games Fray, the Mannheim Regional Court has reaffirmed the ruling that Nintendo is owed damages of over €4 million plus interest. Because Nacon fought the ruling, that interest has increased the total fee to just under €7 million. Nintendo's contention was that Nacon's Wii Remote infringed on its patents for the sensor technology and camera needed to track player movements, as well as an acceleration sensor, and \"the ergonomic features characteristic of Nintendo's Wii Remote.\" The initial verdict came down in 2011, but Nacon has consistently appealed the judgment and come up empty each time. Continue Reading at GameSpot",
    "link": "https://www.gamespot.com/articles/nintendo-wins-latest-round-in-its-15-year-legal-battle-over-the-wii/1100-6537095/?ftag=CAD-01-10abi2f",
    "thumbnail": "https://www.gamespot.com/a/uploads/screen_kubrick/1837/18375603/4625950-nintendowii.jpg",
    "pubDate": "2025-12-19T00:42:00+00:00"
  },
  {
    "title": "XRP’s familiarity helps push ETFs past $1B assets: Exec",
    "description": "XRP has a “number of reasons” that are attracting traditional investor dollars, which has helped to push XRP ETFs over $1 billion in assets, says CF Benchmarks CEO Sui Chung.",
    "link": "https://cointelegraph.com/news/xrp-etf-demand-rises-price-familiarity-crypto-executive?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
    "thumbnail": "https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjUtMTIvMDE5YjMzZWEtODFlNC03ODk0LTllMGMtMmIzMzRkZGE0MWU3LmpwZw==.jpg",
    "pubDate": "2025-12-19T00:08:00+00:00"
  },
  {
    "title": "£100 contactless card limit to be lifted",
    "description": "Card providers can decide whether to offer unlimited payments on contactless cards.",
    "link": "https://www.bbc.com/news/articles/cx2prjr4lpko?at_medium=RSS&at_campaign=rss",
    "thumbnail": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/4328/live/f8bf9b20-d9b5-11f0-b051-c9966e31459d.jpg",
    "pubDate": "2025-12-19T00:04:39+00:00"
  },
  {
    "title": "Friday to be busiest travel day of festive season",
    "description": "Road, rail and air travellers are being advised to allow extra time for travel and check their routes.",
    "link": "https://www.bbc.com/news/articles/c5yjvnr655po?at_medium=RSS&at_campaign=rss",
    "thumbnail": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/d00d/live/3cefd7f0-dc6e-11f0-9a60-67d14305c53c.jpg",
    "pubDate": "2025-12-19T00:04:16+00:00"
  },
  {
    "title": "Stigma of Ukraine's forgotten soldiers who 'died the wrong way'",
    "description": "There are no official statistics surrounding suicide among Ukrainian soldiers, but they are thought to count in the hundreds.",
    "link": "https://www.bbc.com/news/articles/cwypp1jwjz1o?at_medium=RSS&at_campaign=rss",
    "thumbnail": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/ba69/live/ab4a0090-d773-11f0-a8dc-93c15fe68710.png",
    "pubDate": "2025-12-19T00:00:10+00:00"
  },
  {
    "title": "Trump promises 'largest tax refund season of all time.' What you can expect",
    "description": "President Donald Trump is promising bigger tax refunds in 2026 due to changes enacted via the \"big beautiful bill.\" Here's what to expect.",
    "link": "https://www.cnbc.com/2025/12/18/trump-bigger-tax-refunds.html",
    "thumbnail": "https://image.cnbcfm.com/api/v1/image/108243364-1766023895300-108243364-1766023808377-gettyimages-2251825341-AFP_88GV9WN.jpg?v=1766101255&w=1920&h=1080",
    "pubDate": "2025-12-18T23:53:53+00:00"
  },
  {
    "title": "Kennedy Center Board Moves to Rename It the Trump-Kennedy Center",
    "description": "The board for the John F. Kennedy Center for the Performing Arts announced that it would now be named the Trump-Kennedy Center, although a formal change may have to be approved by Congress.",
    "link": "https://www.nytimes.com/2025/12/18/us/politics/trump-kennedy-center-name.html",
    "thumbnail": "https://static01.nyt.com/images/2025/12/18/multimedia/18dc-kennedycenter-topart-qmlj/18dc-kennedycenter-topart-qmlj-facebookJumbo.jpg",
    "pubDate": "2025-12-18T23:38:58+00:00"
  },
  {
    "title": "Congressional stock trading ban bill to get a vote in new year, House Republicans say",
    "description": "Democrats and Republicans remain split on whether a stock trading ban should extend to President Donald Trump",
    "link": "https://www.cnbc.com/2025/12/18/congress-stock-trading-ban-trump.html",
    "thumbnail": "https://image.cnbcfm.com/api/v1/image/108242988-17659857482025-12-17t153338z_1442832550_rc2eiiau0pvc_rtrmadp_0_usa-trump-accounts.jpeg?v=1766099283&w=1920&h=1080",
    "pubDate": "2025-12-18T23:37:07+00:00"
  },
  {
    "title": "These Transformers &amp; Marvel Air Hockey Tables Are A Great Last-Minute Gift Idea",
    "description": "World Tech Toys Licensed Air Hockey Tables $50 See at Amazon If you're sick of having to go all the way to Dave &amp; Buster's to play some air hockey with your little ones, you'll want to check out these officially licensed, portable air hockey tables from World Tech Toys. Each one is just $50, and features characters from popular franchises like Spider-Man, Transformers, Toy Story, and more. World Tech Toys Licensed Air Hockey Tables $50 World Tech Toys' new air hockey tables feature a built-in fan that mimics an authentic air hockey experience, while remaining portable enough to bring with you on the go. The tables are constructed from durable wood, too, which should withstand the usual wear and tear that children's toys endure. There are multiple variations of air hockey tables, each featuring a beloved character (or characters) from big-name franchises like Marvel, Disney, and more. Check out each World Tech Toys Air Hockey Table theme you can get below: Marvel Avengers Air Hockey Table -- $50 Marvel Spider-Man Air Hockey Table -- $50 Marvel Spidey and His Amazing Friends Air Hockey Table -- $50 Mickey Mouse Air Hockey Table -- $50 Minnie Mouse Air Hockey Table -- $50 Toy Story Air Hockey Table -- $50 Transformers Air Hockey Table -- $50 See at Amazon These air hockey tables could make great last-minute gifts for kids--just make sure to confirm Amazon's delivery date is before Christmas, if you need it to arrtive by December 25. If you're looking for some other gift ideas, check out World Tech Toys' lineup, which includes RC cars and helicopters, toy work benches, mini pinball and foosball tables, plus much more. And yes, those come in plenty of fun themes as well, including Frozen, Star Wars, and Subway. Sign up for GameSpot's Weekly Deals Newsletter: Continue Reading at GameSpot",
    "link": "https://www.gamespot.com/articles/official-transformers-spider-man-and-disney-air-hockey-table-deals/1100-6536888/?ftag=CAD-01-10abi2f",
    "thumbnail": "https://www.gamespot.com/a/uploads/square_avatar/1864/18647298/4621265-airhockey.jpg",
    "pubDate": "2025-12-18T23:36:00+00:00"
  },
  {
    "title": "The Junior Congressman Who’s Pushing Republicans on Epstein",
    "description": "The top Democrat on the Oversight Committee, Representative Robert Garcia has brought aggressive tactics and reality-show flair to investigating Jeffrey Epstein’s ties to President Trump.",
    "link": "https://www.nytimes.com/2025/12/18/us/politics/robert-garcia-epstein.html",
    "thumbnail": "https://static01.nyt.com/images/2025/12/18/multimedia/00dc-garcia-phcf/00dc-garcia-phcf-facebookJumbo.jpg",
    "pubDate": "2025-12-18T23:33:53+00:00"
  },
  {
    "title": "Synthetix returns to Ethereum mainnet after 3 years: ‘We can run it back’",
    "description": "Synthetix founder Kain Warwick expects other perpetual decentralized exchanges to follow Synthetix back to Ethereum, which is faster than ever.",
    "link": "https://cointelegraph.com/news/synthetix-ethereum-mainnet-return-kain-warwick-bullish-eth?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
    "thumbnail": "https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjUtMTIvMDE5YjJmMDEtYTVkMy03NmNiLTgxYzMtZmM0ODZhNGI4YWMyLmpwZw==.jpg",
    "pubDate": "2025-12-18T23:30:00+00:00"
  },
  {
    "title": "Tottenham vs Liverpool: Premier League – teams, start time, lineups",
    "description": "Liverpool's recent focus has been on the Mohamed Salah saga but pressure now returns to their Premier League defence.",
    "link": "https://www.aljazeera.com/sports/2025/12/18/tottenham-vs-liverpool-premier-league-teams-start-time-lineups?traffic_source=rss",
    "thumbnail": "https://www.aljazeera.com/wp-content/uploads/2025/12/2025-12-09T200248Z_1440565009_UP1ELC91JOMK0_RTRMADP_3_SOCCER-CHAMPIONS-INT-LIV-1766061803.jpg?resize=1920%2C1440",
    "pubDate": "2025-12-18T23:10:35+00:00"
  },
  {
    "title": "Nike shares fall 10% as China sales plunge, tariffs hit profits",
    "description": "Nike posted fiscal second-quarter earnings and revenue that topped Wall Street's expectations as CEO Elliott Hill tries to turn around the company.",
    "link": "https://www.cnbc.com/2025/12/18/nike-nke-q2-2026-earnings.html",
    "thumbnail": "https://image.cnbcfm.com/api/v1/image/108243314-1766011865525-gettyimages-2251800698-NIKE_EARNS.jpeg?v=1766012027&w=1920&h=1080",
    "pubDate": "2025-12-18T23:05:58+00:00"
  },
  {
    "title": "Trust these numbers? Economists see a lot of flaws in delayed CPI report showing downward inflation",
    "description": "Thursday saw the release of a much lighter-than-expected inflation report for November, and economists are already questioning its significance.",
    "link": "https://www.cnbc.com/2025/12/18/trust-these-numbers-economists-see-a-lot-of-flaws-in-delayed-cpi-report-showing-downward-inflation.html",
    "thumbnail": "https://image.cnbcfm.com/api/v1/image/108243537-1766065069660-108243537-1766065002833-gettyimages-2251633514-anotherday162739125_dhezprv5.jpg?v=1766065078&w=1920&h=1080",
    "pubDate": "2025-12-18T22:46:42+00:00"
  },
  {
    "title": "Retired NASCAR driver among seven killed in North Carolina plane crash",
    "description": "Greg Biffle's plane caught fire after crash-landing at regional airport, according to state authorities.",
    "link": "https://www.aljazeera.com/news/2025/12/18/retired-nascar-driver-among-seven-killed-in-north-carolina-plane-crash?traffic_source=rss",
    "thumbnail": "https://www.aljazeera.com/wp-content/uploads/2025/12/reuters_69447a55-1766095445.jpg?resize=1920%2C1440",
    "pubDate": "2025-12-18T22:43:06+00:00"
  },
  {
    "title": "Crypto CLARITY Act set for Senate markup in January, Sacks says",
    "description": "White House AI and crypto czar David Sacks said the CLARITY Act will reach the Senate next month for debate and amendment before a full vote.",
    "link": "https://cointelegraph.com/news/white-house-david-sacks-crypto-clarity-act-senate-january?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
    "thumbnail": "https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjUtMTIvMDE5YjMzNzYtMzNiMC03YjRjLWI3MDktZDg4MjdhMjEwYzhlLmpwZw==.jpg",
    "pubDate": "2025-12-18T22:32:29+00:00"
  },
  {
    "title": "How to shiny hunt in Pokémon Legends: Z-A",
    "description": "If you want rare shiny Pokémon, Pokémon Legends: Z-A makes shiny hunting pretty easy. We explain how to in our guide.",
    "link": "https://www.polygon.com/pokemon-legends-z-a-plza-shiny-hunting-reset-how-to/",
    "thumbnail": "https://static0.polygonimages.com/wordpress/wp-content/uploads/2025/11/obs64_2025-11-07_12-06-20.jpg?w=1600&h=900&fit=crop",
    "pubDate": "2025-12-18T22:19:29+00:00"
  },
  {
    "title": "8BitDo's Superb Ultimate 2 Wireless Controllers Are Back On Sale All-Time Low Prices",
    "description": "8BitDo Ultimate 2 Bluetooth Controller (Switch 2, Switch, PC, Mac) $56 (was $70) See at Amazon 8BitDo Ultimate 2 Wireless Controller (PC, Apple, SteamOS, Android) $47.59 (was $60) See at Amazon 8BitDo Ultimate 2 Controllers are back on sale for Black Friday-level prices at Amazon. The highly customizable 8BitDo Ultimate 2 Bluetooth Controller for Nintendo Switch 1/2 and PC is discounted to $56 (was $70). You can choose between black or white color schemes with matching charging docks. The Ultimate 2 is arguably the best pro-style controller with offset thumbsticks in its price range; it's better than many controllers that cost two or three times as much. Notable features include TMR sticks, four extra remappable buttons, dual trigger modes, RGB lighting rings, custom profiles, and additional customization options via 8BitDo's free Ultimate Software V2. Continue Reading at GameSpot",
    "link": "https://www.gamespot.com/articles/8bitdo-ultimate-2-switch-2-pc-controller-review-best-deals-at-amazon/1100-6529695/?ftag=CAD-01-10abi2f",
    "thumbnail": "https://www.gamespot.com/a/uploads/square_avatar/1595/15950357/4562284-8bitdoultimate2.png",
    "pubDate": "2025-12-18T22:17:00+00:00"
  },
  {
    "title": "Mamdani Appointee Resigns After Decade-Old Antisemitic Posts Re-emerge",
    "description": "Catherine Almonte Da Costa resigned from her just-announced post as Mayor-elect Zohran Mamdani’s director of appointments after the Anti-Defamation League resurfaced the comments.",
    "link": "https://www.nytimes.com/2025/12/18/nyregion/mamdani-resigns-antisemitic-da-costa.html",
    "thumbnail": "https://static01.nyt.com/images/2025/12/18/multimedia/18met-mamdani-antisemitic-gzbh/18met-mamdani-antisemitic-gzbh-facebookJumbo.jpg",
    "pubDate": "2025-12-18T22:13:51+00:00"
  },
  {
    "title": "Trump signs executive order reclassifying cannabis, opening door to broader weed access",
    "description": "President Donald Trump signed an executive order Thursday reclassifying marijuana as a Schedule III substance with looser restrictions.",
    "link": "https://www.cnbc.com/2025/12/18/trump-pot-reclassification-cannabis-stocks-medicare-cbd.html",
    "thumbnail": "https://image.cnbcfm.com/api/v1/image/108243763-17660841752025-12-18t185041z_661515781_rc26jialkgr4_rtrmadp_0_usa-trump.jpeg?v=1766084220&w=1920&h=1080",
    "pubDate": "2025-12-18T22:11:31+00:00"
  },
  {
    "title": "Miller's Crossing at 35: The Coen Brothers' movie-nerd gangster fantasia",
    "description": "In between Goodfellas and Godfather III, the Coens' own gangster epic flopped with general audiences.",
    "link": "https://www.polygon.com/millers-crossing-35-coen-brothers-gangster-movie/",
    "thumbnail": "https://static0.polygonimages.com/wordpress/wp-content/uploads/2025/10/miller-s-crossing-1.jpg?w=1600&h=900&fit=crop",
    "pubDate": "2025-12-18T22:07:16+00:00"
  },
  {
    "title": "Here’s what happened in crypto today",
    "description": "Need to know what happened in crypto today? Here is the latest news on daily trends and events impacting Bitcoin price, blockchain, DeFi, NFTs, Web3 and crypto regulation.",
    "link": "https://cointelegraph.com/news/what-happened-in-crypto-today?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
    "thumbnail": "https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjUtMDYvMDE5Nzk0MjMtZWY4ZS03YzYwLWI5MzctYjlkZGY3NWZlOGFk.jpg",
    "pubDate": "2025-12-18T22:03:32+00:00"
  },
  {
    "title": "Coinbase appoints former UK minister George Osborne to chair advisory council",
    "description": "Osborne began advising Coinbase in 2024 and has been critical of the UK government's lack of robust digital asset regulations.",
    "link": "https://cointelegraph.com/news/coinbase-george-osborne-uk-minister-advisory-council?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
    "thumbnail": "https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjUtMTIvMDE5YjMzNzUtNGJlNy03Zjc3LWE3NzItZWEzMGFmMGFiYWI4LmpwZw==.jpg",
    "pubDate": "2025-12-18T21:59:06+00:00"
  },
  {
    "title": "Instacart settles Federal Trade Commission’s claim it deceived US shoppers",
    "description": "The FTC had accused the grocery delivery giant of charging fees to consumers after promising 'free delivery'.",
    "link": "https://www.aljazeera.com/news/2025/12/18/instacart-settles-federal-trade-commissions-claim-it-deceived-us-shoppers?traffic_source=rss",
    "thumbnail": "https://www.aljazeera.com/wp-content/uploads/2025/12/2022-03-25T164857Z_2046104371_RC2P9T9MBSHN_RTRMADP_3_INSTACART-FUNDING-1766092493.jpg?resize=1920%2C1440",
    "pubDate": "2025-12-18T21:54:38+00:00"
  },
  {
    "title": "Altcoins plunge as bitcoin's $85,000 test triggers $550 million in liquidations",
    "description": "Solana tumbled below $120 to its weakest price since April, while SUI, DOGE and ADA also fell sharply.",
    "link": "https://www.coindesk.com/markets/2025/12/18/altcoins-plunge-as-bitcoin-s-usd85k-test-triggers-usd550m-in-liquidations",
    "thumbnail": "https://cdn.sanity.io/images/s3y3vcno/production/78cd770b3be0f39de16936d1aa7a7a30bbac7558-1920x1080.jpg?auto=format&w=960&h=540&crop=focalpoint&fit=clip&q=75&fm=jpg",
    "pubDate": "2025-12-18T21:46:55+00:00"
  },
  {
    "title": "Brazilian stock exchange to launch tokenization platform and stablecoin",
    "description": "A representative from Brazil's stock exchange, B3, said the stablecoin would be “a tool to enable trading in tokens,\" which it planned to offer in 2026.",
    "link": "https://cointelegraph.com/news/brazil-stocks-b3-tokenization-stablecoin?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
    "thumbnail": "https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjUtMTIvMDE5YjMzMDMtMDVkYi03M2RiLTliYzItZjU4MjA5NGZlMTExLmpwZw==.jpg",
    "pubDate": "2025-12-18T21:46:52+00:00"
  },
  {
    "title": "Imani Barbarin on disability rights, COVID and the war on Gaza",
    "description": "Why the TikTok star and disability advocate wants the world to rethink what it means to be disabled.",
    "link": "https://www.aljazeera.com/video/the-take-2/2025/12/18/aje-onl-glb_imanibarbarin_av_v2-181225?traffic_source=rss",
    "thumbnail": "https://www.aljazeera.com/wp-content/uploads/2025/12/image-1766091547.jpg?resize=1920%2C1080&quality=80",
    "pubDate": "2025-12-18T21:44:41+00:00"
  },
  {
    "title": "Global debt markets show dollar dominance moves in cycles, US Fed says",
    "description": "A recent study by the US Federal Reserve argues that despite periodic challenges, a lack of credible alternatives has kept the dollar at the center of global bond markets.",
    "link": "https://cointelegraph.com/news/global-debt-markets-dollar-dominance-cycles-fed?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
    "thumbnail": "https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjUtMTIvMDE5YjMzMDktZTE2Yi03ZGQ5LTgzNDgtZmY3MjVlOWE0MTg5LmpwZw==.jpg",
    "pubDate": "2025-12-18T21:35:37+00:00"
  },
  {
    "title": "How to start Act 3 in Hollow Knight: Silksong",
    "description": "Act 3 is a continuation of the story in Hollow Knight: Silksong, but it can be pretty tough to start. Here's how to unlock it.",
    "link": "https://www.polygon.com/hollow-knight-silksong-act-3-requirements-silk-and-soul-how-to-start/",
    "thumbnail": "https://static0.polygonimages.com/wordpress/wp-content/uploads/2025/09/caretaker_hks.jpg?w=1600&h=900&fit=crop",
    "pubDate": "2025-12-18T21:34:31+00:00"
  },
  {
    "title": "SOL price action lags the wider altcoin market: Is Solana’s heyday over?",
    "description": "SOL falls behind multiple altcoin competitors as its onchain activity, fee and DApp revenues slump. Cointelegraph explains why.",
    "link": "https://cointelegraph.com/news/sol-lags-wider-altcoin-market-is-solanas-heyday-over?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
    "thumbnail": "https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjUtMTIvMDE5YjMzMmMtMDFiZi03ZjhkLTgyN2ItOTgzNzQ0ZTU1ODMxLmpwZw==.jpg",
    "pubDate": "2025-12-18T21:33:57+00:00"
  },
  {
    "title": "Cypherpunk values are dying, but they’re 'Not Dead Yet'",
    "description": "The values that are baked into the foundations of crypto — privacy, self-sovereignty, decentralization — are eroding, and we’re running out of time to address the problem.",
    "link": "https://cointelegraph.com/news/cypherpunk-values-dying-but-not-dead-yet-show?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
    "thumbnail": "https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjUtMTIvMDE5YjMyZjktNTgzZC03ZmZlLTgzMzEtOTBhM2I4ODcwYWEwLmpwZw==.jpg",
    "pubDate": "2025-12-18T21:30:46+00:00"
  },
  {
    "title": "WhiteFiber signs 10-year, 40 MW colocation deal with Nscale valued at about $865 million",
    "description": "The firm's Enovum unit will deliver 40 megawatts of critical IT load in two phases at a campus in Madison, North Carolina, under a 10-year agreement.",
    "link": "https://www.coindesk.com/markets/2025/12/18/whitefiber-signs-10-year-40-mw-colocation-deal-with-nscale-valued-at-about-usd865-million",
    "thumbnail": "https://cdn.sanity.io/images/s3y3vcno/production/0e41b18850ed9d8943910b3d5e230bb4e1242ddc-1920x1080.jpg?auto=format&w=960&h=540&crop=focalpoint&fit=clip&q=75&fm=jpg",
    "pubDate": "2025-12-18T21:30:00+00:00"
  },
  {
    "title": "Trump signs order to reclassify marijuana, ease research restrictions",
    "description": "The order calls on the US attorney general to expedite federal reclassification, creating fewer barriers for studies.",
    "link": "https://www.aljazeera.com/news/2025/12/18/trump-signs-order-to-reclassify-marijuana-ease-research-restrictions?traffic_source=rss",
    "thumbnail": "https://www.aljazeera.com/wp-content/uploads/2025/12/afp_69445e2f13fd-1766088239.jpg?resize=1920%2C1440",
    "pubDate": "2025-12-18T21:28:21+00:00"
  },
  {
    "title": "Kennedy Center board votes to rename in honour of Trump, White House says",
    "description": "Relatives of the late President John F Kennedy have expressed outrage at the proposal to rename the arts centre.",
    "link": "https://www.aljazeera.com/news/2025/12/18/white-house-says-kennedy-center-board-has-voted-to-rename-after-trump?traffic_source=rss",
    "thumbnail": "https://www.aljazeera.com/wp-content/uploads/2025/12/AP25343650404976-1766090871.jpg?resize=1920%2C1440",
    "pubDate": "2025-12-18T21:27:41+00:00"
  },
  {
    "title": "After Rob Reiner’s ‘North’ Flopped, He Proved He Could Take Criticism With Humor",
    "description": "Roger Ebert said he “hated, hated, hated, hated, hated” Reiner’s 1994 film “North.” The director took it in stride.",
    "link": "https://www.nytimes.com/2025/12/18/arts/rob-reiner-north-movie.html",
    "thumbnail": "https://static01.nyt.com/images/2025/12/18/world/18xp-reiner-north/18xp-reiner-north-facebookJumbo.jpg",
    "pubDate": "2025-12-18T21:16:35+00:00"
  },
  {
    "title": "Golfer Rory McIlroy wins Sports Personality of the Year",
    "description": "Rory McIlroy is crowned BBC Sports Personality of the Year for 2025 after clinching the career Grand Slam and playing a key role in Europe's Ryder Cup win.",
    "link": "https://www.bbc.com/sport/golf/articles/crrkpwk8vdjo?at_medium=RSS&at_campaign=rss",
    "thumbnail": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/6442/live/b0242e00-dc79-11f0-b67b-690eb873de1b.jpg",
    "pubDate": "2025-12-18T21:08:14+00:00"
  },
  {
    "title": "All simple key locations in Hollow Knight: Silksong",
    "description": "Here's where to find all of the simple keys in Hollow Knight: Silksong and all of the doors that they can unlock.",
    "link": "https://www.polygon.com/hollow-knight-silksong-simple-key-location-uses-door-locks/",
    "thumbnail": "https://static0.polygonimages.com/wordpress/wp-content/uploads/2025/09/simplekeylead_hks.jpg?w=1600&h=900&fit=crop",
    "pubDate": "2025-12-18T21:02:09+00:00"
  },
  {
    "title": "Yooka-Replaylee's Free Demo Is Now Available On Nintendo Switch 2",
    "description": "Yooka-Replayee's physical edition has been released, and a free demo is available now on Nintendo Switch 2.",
    "link": "https://www.polygon.com/yooka-replaylee-free-demo-nintendo-switch-2/",
    "thumbnail": "https://static0.polygonimages.com/wordpress/wp-content/uploads/2025/12/mixcollage-16-dec-2025-04-35-pm-1313.jpg?w=1600&h=900&fit=crop",
    "pubDate": "2025-12-18T21:00:16+00:00"
  },
  {
    "title": "Palestine Action hunger strikers are ‘dying’ in prison, UK doctor warns",
    "description": "Hundreds of doctors, dozens of MPs and thousands of everyday Britons call on the justice secretary to intervene.",
    "link": "https://www.aljazeera.com/news/2025/12/18/palestine-action-hunger-strikers-are-dying-in-prison-uk-doctor-warns?traffic_source=rss",
    "thumbnail": "https://www.aljazeera.com/wp-content/uploads/2025/12/Hunger-strike-prisoners-1766097714.jpg?resize=1200%2C675",
    "pubDate": "2025-12-18T20:59:28+00:00"
  },
  {
    "title": "Backbone Pro Xbox Edition Controller Is Already On Sale For A Steep Discount",
    "description": "Backbone Pro Mobile Controller $135 (was $170) See at Amazon See at Backbone See at Best Buy Backbone Pro Mobile Controller: Xbox Edition $145 (was $180) See at Amazon See at Backbone See at Best Buy Backbone Pro Mobile Controller (Pink): Target Exclusive $140 (was $170) See at Target Just a month after its launch, the Backbone Pro Xbox Edition is on sale for a substantial discount at Amazon, Best Buy, and Backbone's online storefront. Normally $180, the officially licensed transparent green mobile controller is up for grabs for $145. Alternatively, you can get the standard edition black Backbone Pro for $135 (was $170) or the Target-exclusive pink edition for $140 (was $170). Continue Reading at GameSpot",
    "link": "https://www.gamespot.com/articles/backbone-pro-mobile-controller-deals-iphone-android-xbox-edition/1100-6537094/?ftag=CAD-01-10abi2f",
    "thumbnail": "https://www.gamespot.com/a/uploads/square_avatar/1595/15950357/4625885-4488225-backbonepromodule2.png",
    "pubDate": "2025-12-18T20:55:00+00:00"
  },
  {
    "title": "New White House plaques attack Biden, Obama and Bush",
    "description": "Plaques installed in US President Donald Trump’s ‘Presidential Walk of Fame’ at the White House attack his predecessors.",
    "link": "https://www.aljazeera.com/video/newsfeed/2025/12/18/new-white-house-plaques-attack-biden-obama-and-bush?traffic_source=rss",
    "thumbnail": "https://www.aljazeera.com/wp-content/uploads/2025/12/image-1766090710.jpg?resize=1620%2C1080&quality=80",
    "pubDate": "2025-12-18T20:46:29+00:00"
  },
  {
    "title": "UK names Christian Turner as ambassador to US, replacing Peter Mandelson",
    "description": "Turner has spent a nearly 30-year career working across Whitehall and the Foreign Office.",
    "link": "https://www.bbc.com/news/articles/ckgmpnr4ex2o?at_medium=RSS&at_campaign=rss",
    "thumbnail": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/037b/live/2521ad20-dc4a-11f0-b67b-690eb873de1b.jpg",
    "pubDate": "2025-12-18T20:45:35+00:00"
  },
  {
    "title": "Mobile Suit Gundam Hathaway is the perfect entry point for the iconic franchise, and a new movie is coming",
    "description": "After four years, Mobile Suit Gundam: Hathaway - The Sorcery of Nymph Circe, finally has a trailer.",
    "link": "https://www.polygon.com/mobile-suit-gundam-hathaway-the-sorcery-of-nymph-circenew-movie/",
    "thumbnail": "https://static0.polygonimages.com/wordpress/wp-content/uploads/2025/12/gundam-hathaway61.jpg?w=1600&h=900&fit=crop",
    "pubDate": "2025-12-18T20:40:30+00:00"
  },
  {
    "title": "Protesting farmers clash with police as EU debates trade deal",
    "description": "Angry farmers drove their tractors into Brussels and faced tear gas from police as EU leaders debated a trade deal.",
    "link": "https://www.aljazeera.com/video/newsfeed/2025/12/18/protesting-farmers-clash-with-police-as-eu-debates-trade-deal?traffic_source=rss",
    "thumbnail": "https://www.aljazeera.com/wp-content/uploads/2025/12/image-1766089915.jpg?resize=1920%2C1080&quality=80",
    "pubDate": "2025-12-18T20:34:00+00:00"
  },
  {
    "title": "Tomb Raider TV Series Adds Another Big Name To Its Cast",
    "description": "Prime Video's Tomb Raider TV series continues to add to its cast, with a new report saying Jason Isaacs will star in the show. Deadline reported that the Emmy-nominated actor will appear in the show, but his role is unknown at this point, as is the larger story for the series. Isaacs is a veteran actor perhaps best known for his role as Lucius Malfoy in the Harry Potter movie series. He's also had roles in the movies The Patriot, Black Hawk Down, Peter Pan, and Fury. On TV, Isaacs recently had a starring role in the The White Lotus Season 3, a role that earned him his first Emmy nomination. The Tomb Raider TV show stars Game of Thrones alum Sophie Turner as Lara Croft, with Avatar's Sigourney Weaver signed on to play a character named Wallace. British actor Martin Bobb-Semple will appear in the show, too, in an unspecified series regular role. Continue Reading at GameSpot",
    "link": "https://www.gamespot.com/articles/tomb-raider-tv-series-adds-another-big-name-to-its-cast/1100-6537090/?ftag=CAD-01-10abi2f",
    "thumbnail": "https://www.gamespot.com/a/uploads/screen_kubrick/1179/11799911/4625845-screenshot2025-12-18at2.24.54%E2%80%AFpm.png",
    "pubDate": "2025-12-18T20:17:00+00:00"
  },
  {
    "title": "Perfect Dark Star Reacts To The Game's Cancellation",
    "description": "Recently, it was announced that Alix Wilton-Regan will take over for Camila Luddington in the role of Lara Croft for the next two games in the series. In a new interview, she said she is afraid that it may all fall apart after the last game she was set to appear in, the Perfect Dark reboot, was canceled. Wilton-Regan told TheGamer that she was filming her scenes as Joanna Dark for the Perfect Dark game at the same time she was shooting Lara for the new Tomb Raider games. It was \"wonderful and genuinely one of the most creatively exciting times of my life.\" However, she said she was and remains concerned that Tomb Raider could fall apart, given that Perfect Dark was canceled. \"I just felt so relieved that I still had Lara, but I also felt really frightened about losing Lara. I'm still frightened of losing Lara,\" she said. Continue Reading at GameSpot",
    "link": "https://www.gamespot.com/articles/perfect-dark-star-reacts-to-the-games-cancellation/1100-6537089/?ftag=CAD-01-10abi2f",
    "thumbnail": "https://www.gamespot.com/a/uploads/screen_kubrick/1179/11799911/4625837-lara.jpg",
    "pubDate": "2025-12-18T20:14:00+00:00"
  },
  {
    "title": "HR exec in viral Coldplay clip speaks of abuse, threats and trying to find a new job",
    "description": "Kristin Cabot says she was bombarded with abusive and threatening messages after being filmed with her boss on the 'kiss-cam'.",
    "link": "https://www.bbc.com/news/articles/cg7vp937jyxo?at_medium=RSS&at_campaign=rss",
    "thumbnail": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/33c1/live/17311310-dc4d-11f0-a8dc-93c15fe68710.jpg",
    "pubDate": "2025-12-18T20:07:40+00:00"
  },
  {
    "title": "Naughty Dog's Intergalactic Aiming For Mid-2027 Release Amid New Crunch Allegations - Report",
    "description": "A new report claims that Naughty Dog recently mandated that workers return to the office five days per week--up from three--and had been pushing staff to work \"long hours\" to get a demo of Intergalactic: The Heretic Prophet ready to show off to Sony higher-ups. The Bloomberg report said that beginning in late October, Naughty Dog asked staff to work \"a minimum of eight extra hours a week\" and document their overtime in a spreadsheet. \"This overtime period was an attempt to get the production back on track after several missed deadlines,\" the report said. Workers were told to not work more than 60 hours per week, the report said. The return-to-office mandate was disruptive to some workers who reportedly had to find cover for childcare and their pets. The report added that the \"mandated overtime\" period wrapped up this week with the completion of the demo. Continue Reading at GameSpot",
    "link": "https://www.gamespot.com/articles/naughty-dogs-intergalactic-aiming-for-mid-2027-release-amid-new-crunch-allegations-report/1100-6537091/?ftag=CAD-01-10abi2f",
    "thumbnail": "https://www.gamespot.com/a/uploads/screen_kubrick/1179/11799911/4625849-screenshot2025-12-18at2.49.54%E2%80%AFpm.png",
    "pubDate": "2025-12-18T20:06:00+00:00"
  },
  {
    "title": "Tom Cruise reveals Digger trailer, teasing his new Alejandro G. Iñárritu movie",
    "description": "Tom Cruise debuts a new look in Iñárritu’s apocalyptic comedy thriller Digger, hitting theaters October 2, 2026.",
    "link": "https://www.polygon.com/tom-cruise-digger-trailer-apocalyptic-thriller-comedy/",
    "thumbnail": "https://static0.polygonimages.com/wordpress/wp-content/uploads/2025/12/digger-tom-cruise.jpg?w=1200&h=675&fit=crop",
    "pubDate": "2025-12-18T20:00:37+00:00"
  },
  {
    "title": "What if crypto's U.S. market structure effort just never gets there?",
    "description": "Guessing the direction of Congress is akin to long-range weather prediction, with so many variables in play, and the industry's fate depends on a break in the storm.",
    "link": "https://www.coindesk.com/news-analysis/2025/12/18/what-if-crypto-s-u-s-market-structure-effort-just-never-gets-there",
    "thumbnail": "https://cdn.sanity.io/images/s3y3vcno/production/ef178cd092b9deaf21d03a95d94ee15f851278e3-1920x1079.png?auto=format&w=960&h=540&crop=focalpoint&fit=clip&q=75&fm=jpg",
    "pubDate": "2025-12-18T20:00:00+00:00"
  },
  {
    "title": "Fortnite Winterfest 2025: All Quests And Rewards",
    "description": "Fortnite's latest Winterfest celebration kicked off with the usual array of map and gameplay changes in Battle Royale and piles of free stuff in the Winterfest cabin. But that's not all there is to care about in Fortnite's latest update--we've also got a pair of new sets of quests that reward XP, and an additional free cosmetic that must be earned by completing a specific one of those new quests. Let's take a look at what we've got here. Table of Contents [hide] Winterfest 2025 quests Drop 1Collect a Perfect Gift from a chest Winterfest 2025 quests The first of these new quests sets, listed under Winterfest in your quest log, are for Battle Royale. There are four time-gated groups of this set of quests--the first group is available now, and the rest will be added every two days until they're all there. Completing a quest awards 12K XP each, and there may be a reward at the end of the questline--but we don't know for sure yet. These quests expire when Winterfest ends on January 5. Drop 1 Collect a Perfect Gift from a chest Every chest you open during Winterfest has a change to drop an item called Perfect Gift, which triggers a quest to deliver it to any non-hostile NPC on the map within five minutes. But for this quest, you just have to collect the item. Fortunately, the Perfect Gift does not require one of your inventory slots. Continue Reading at GameSpot",
    "link": "https://www.gamespot.com/articles/fortnite-winterfest-2025-all-quests-and-rewards/1100-6537092/?ftag=CAD-01-10abi2f",
    "thumbnail": "https://www.gamespot.com/a/uploads/screen_kubrick/1757/17577455/4625848-crackshotcabin.jpg",
    "pubDate": "2025-12-18T20:00:00+00:00"
  },
  {
    "title": "XRP slumps as bitcoin once again falls back to $85,000 level after surge",
    "description": "Crypto markets swung sharply Thursday following a softer-than-expected U.S. CPI print, which briefly lifted bitcoin above $89,000 during U.S. hours.",
    "link": "https://www.coindesk.com/markets/2025/12/19/xrp-slumps-as-bitcoin-once-again-falls-back-to-usd85-000-level-after-surge",
    "thumbnail": "https://cdn.sanity.io/images/s3y3vcno/production/e5d32a519aa9993b3acdc4266a026b3de86e6c36-1196x736.png?auto=format&w=960&h=540&crop=focalpoint&fit=clip&q=75&fm=jpg",
    "pubDate": "2025-12-18T19:56:25+00:00"
  },
  {
    "title": "Friday could be a wild day of trading on Wall Street. Here's why",
    "description": "December options expirations are typically the biggest of the year, but this one eclipses all prior records, Goldman said.",
    "link": "https://www.cnbc.com/2025/12/18/friday-could-be-a-wild-day-of-trading-on-wall-street-heres-why.html",
    "thumbnail": "https://image.cnbcfm.com/api/v1/image/108243087-17659928772025-12-17t170019z_417787449_rc2diiaxysev_rtrmadp_0_usa-stocks.jpeg?v=1765993003&w=1920&h=1080",
    "pubDate": "2025-12-18T19:51:24+00:00"
  },
  {
    "title": "They Thought They Had ‘Made It.’ Now They Can’t Afford Food.",
    "description": "New Yorkers in the so-called “missing middle,” who may make too much for food benefits, say it’s still hard to find enough money for groceries.",
    "link": "https://www.nytimes.com/2025/12/18/nyregion/nyc-food-budgets.html",
    "thumbnail": "https://static01.nyt.com/images/2025/12/18/multimedia/18met-food-budgets-03-jwvz/18met-food-budgets-03-jwvz-facebookJumbo.jpg",
    "pubDate": "2025-12-18T19:32:58+00:00"
  },
  {
    "title": "Where to find Pansage, Pansear, and Panpour in Pokémon Legends: Z-A",
    "description": "If you're looking for the three monkeys for a Pokémon Legends: Z-A side mission, we can help. We explain an early-game location for them.",
    "link": "https://www.polygon.com/pokemon-legends-z-a-plza-panpour-pansage-pansear-locations/",
    "thumbnail": "https://static0.polygonimages.com/wordpress/wp-content/uploads/2025/10/jlee_251008_1002_lza_dexmonkeys.jpg?w=1600&h=900&fit=crop",
    "pubDate": "2025-12-18T19:19:20+00:00"
  },
  {
    "title": "Polkadot's DOT Slips 2% on above average volume",
    "description": "The decline occurred on volume that was 35% above the token's 30-day average.",
    "link": "https://www.coindesk.com/markets/2025/12/18/polkadot-s-dot-slips-2-on-above-average-volume",
    "thumbnail": "https://cdn.sanity.io/images/s3y3vcno/production/def5af95d2baf3661b0e01b6174112de7eccbf6c-700x430.png?auto=format&w=960&h=540&crop=focalpoint&fit=clip&q=75&fm=jpg",
    "pubDate": "2025-12-18T19:17:24+00:00"
  },
  {
    "title": "Where is Maurice's Black Market Vending Machine in Borderlands 4",
    "description": "Here's where you can find Maurice's Black Market Vending Machine this week in Borderlands 4 and grab some nice legendary gear!",
    "link": "https://www.polygon.com/borderlands-4-maurices-black-market-vending-legendary-machine-location/",
    "thumbnail": "https://static0.polygonimages.com/wordpress/wp-content/uploads/2025/09/maurice-sblackmarketvendingmachine_bl4.jpg?w=1600&h=900&fit=crop",
    "pubDate": "2025-12-18T18:52:25+00:00"
  },
  {
    "title": "Filecoin price falls 1% after earlier strength, underperforms wider crypto markets",
    "description": "The storage token hit an intraday high of $1.26 before selling off sharply to trade down on the day.",
    "link": "https://www.coindesk.com/markets/2025/12/18/filecoin-price-falls-1-after-earlier-strength-underperforms-wider-crypto-markets",
    "thumbnail": "https://cdn.sanity.io/images/s3y3vcno/production/2f857859b799200a2be3e52d9b4f8c2e78d3f88c-700x430.png?auto=format&w=960&h=540&crop=focalpoint&fit=clip&q=75&fm=jpg",
    "pubDate": "2025-12-18T18:43:47+00:00"
  },
  {
    "title": "‘Don’s Best Friend’: How Epstein and Trump Bonded Over the Pursuit of Women",
    "description": "The president has tried to minimize their friendship, but documents and interviews reveal an intense and complicated relationship. Chasing women was a game of ego and dominance. Female bodies were currency.",
    "link": "https://www.nytimes.com/2025/12/18/us/jeffrey-epstein-donald-trump.html",
    "thumbnail": "https://static01.nyt.com/images/2025/12/16/multimedia/00trump-epstein-harley-mlfb/00trump-epstein-harley-mlfb-facebookJumbo.jpg",
    "pubDate": "2025-12-18T18:39:46+00:00"
  },
  {
    "title": "ECB’s Christine Lagarde shifts focus to digital euro rollout after holding rates",
    "description": "With technical and preparatory work complete, the ECB pressed lawmakers to move quickly on Europe’s public digital currency amid global stablecoin concerns.",
    "link": "https://www.coindesk.com/policy/2025/12/18/ecb-s-christine-lagarde-shifts-focus-to-digital-euro-rollout-after-holding-rates",
    "thumbnail": "https://cdn.sanity.io/images/s3y3vcno/production/9e99e945fd865cb668d5d8fa8b2536eb926aa39d-1920x1080.jpg?auto=format&w=960&h=540&crop=focalpoint&fit=clip&q=75&fm=jpg",
    "pubDate": "2025-12-18T18:22:39+00:00"
  },
  {
    "title": "As Disney bows to AI, the Teenage Mutant Ninja Turtles take a stance against slop",
    "description": "The new theatrical short 'Teenage Mutant Ninja Turtles: Chrome Alone 2 – Lost in New Jersey' has an anti-AI message.",
    "link": "https://www.polygon.com/as-mickey-mouse-bows-to-the-ai-takeover-the-teenage-mutant-ninja-turtles-take-a-stand-against-it/",
    "thumbnail": "https://static0.polygonimages.com/wordpress/wp-content/uploads/2025/12/screen-shot-2025-12-18-at-12-44-06-pm.jpg?w=1200&h=675&fit=crop",
    "pubDate": "2025-12-18T18:21:38+00:00"
  },
  {
    "title": "American Airlines starts flying the longest-range narrow-body Airbus plane. Here's what's inside",
    "description": "The first Airbus A321XLR for a U.S. airline took off Thursday from John F. Kennedy International Airport in New York, bound for Los Angeles.",
    "link": "https://www.cnbc.com/2025/12/18/american-airlines-airbus-321xlr.html",
    "thumbnail": "https://image.cnbcfm.com/api/v1/image/108243067-1765991520479-IMG_4129.jpg?v=1765994815&w=1920&h=1080",
    "pubDate": "2025-12-18T18:18:02+00:00"
  },
  {
    "title": "Bitcoin's 'realized cap' holds at record high over $1 trillion, casting doubt on four-year cycle",
    "description": "A very supportive macro backdrop is being ignored for now, said Bitwise's Andre Dragosch.",
    "link": "https://www.coindesk.com/markets/2025/12/18/bitcoin-s-realized-cap-holds-at-record-high-over-usd1-trillion-casting-doubt-on-four-year-cycle",
    "thumbnail": "https://cdn.sanity.io/images/s3y3vcno/production/725d4bdb2dfc24410e1b57c9625c55dbfe2c5ea0-3200x1800.png?auto=format&w=960&h=540&crop=focalpoint&fit=clip&q=75&fm=jpg",
    "pubDate": "2025-12-18T17:53:54+00:00"
  },
  {
    "title": "Bitcoin bulls foiled again as price tumbles back to $86,000, giving up CPI gains and more",
    "description": "Far softer than expected inflation numbers Thursday morning had markets racing early, but some are questioning the data.",
    "link": "https://www.coindesk.com/markets/2025/12/18/bitcoin-bulls-foiled-again-as-price-tumbles-back-to-usd86-000-giving-up-cpi-gains-and-more",
    "thumbnail": "https://cdn.sanity.io/images/s3y3vcno/production/f0ba20f8c0968d308606fd0e21f26ded82b7a46f-2204x1188.png?auto=format&w=960&h=540&crop=focalpoint&fit=clip&q=75&fm=jpg",
    "pubDate": "2025-12-18T17:46:07+00:00"
  },
  {
    "title": "Zelensky gives stark warning as EU leaders decide on Russia's frozen assets",
    "description": "The EU is deciding whether to loan tens of billions of euros of Russian money to fund Ukraine's military and economic needs.",
    "link": "https://www.bbc.com/news/articles/c9vjlj1ezpgo?at_medium=RSS&at_campaign=rss",
    "thumbnail": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/e4f1/live/37ea5f20-dc26-11f0-89ae-89110b9e802d.jpg",
    "pubDate": "2025-12-18T16:46:22+00:00"
  },
  {
    "title": "Rob Reiner Family Tragedy Strikes a Nerve for Families Fighting Addiction",
    "description": "Nick Reiner, charged with murdering his parents, Rob and Michele Singer Reiner, spent much of his life battling drug addiction, an affliction that millions of Americans face.",
    "link": "https://www.nytimes.com/2025/12/18/us/rob-reiner-family-murder-addiction.html",
    "thumbnail": "https://static01.nyt.com/images/2025/12/18/multimedia/18nat-reiner-addiction-01-czqp/18nat-reiner-addiction-01-czqp-facebookJumbo.jpg",
    "pubDate": "2025-12-18T14:56:01+00:00"
  },
  {
    "title": "Nucor, Steel Dynamics Warn of Profit Shortfalls",
    "description": "",
    "link": "https://www.wsj.com/business/earnings/nucor-steel-dynamics-warn-of-profit-shortfalls-520fe623?siteid=yhoof2&yptr=yahoo",
    "thumbnail": "",
    "pubDate": "2025-12-17T14:28:00+00:00"
  },
  {
    "title": "Is Fiserv (FISV) an Undervalued Stock?",
    "description": "",
    "link": "https://finance.yahoo.com/news/fiserv-fisv-undervalued-stock-142259382.html",
    "thumbnail": "https://media.zenfs.com/en/insidermonkey.com/51b17e76e0ed3c67f24aae5762b10083",
    "pubDate": "2025-12-17T14:22:59+00:00"
  },
  {
    "title": "Do You Believe in the Growth Potential of Adobe (ADBE)?",
    "description": "",
    "link": "https://finance.yahoo.com/news/believe-growth-potential-adobe-adbe-141821954.html",
    "thumbnail": "https://media.zenfs.com/en/insidermonkey.com/2b5b7ecf073968982fd33d6ff1961546",
    "pubDate": "2025-12-17T14:18:21+00:00"
  },
  {
    "title": "Warner Bros Discovery board rejects hostile bid from Paramount",
    "description": "",
    "link": "https://finance.yahoo.com/news/warner-bros-discovery-board-rejects-141500067.html",
    "thumbnail": "https://media.zenfs.com/en/reuters.com/4cb28e9cd84b47479c120537cd063a22",
    "pubDate": "2025-12-17T14:15:00+00:00"
  },
  {
    "title": "What Makes General Dynamics (GD) a Good Investment Amid Global Geopolitical Tensions",
    "description": "",
    "link": "https://finance.yahoo.com/news/makes-general-dynamics-gd-good-140841300.html",
    "thumbnail": "https://media.zenfs.com/en/insidermonkey.com/ede8c7f5b6b3a2301b211bf3a2539fa0",
    "pubDate": "2025-12-17T14:08:41+00:00"
  },
  {
    "title": "Prediction: Zcash Will Flip Monero in 2026 and Never Look Back",
    "description": "",
    "link": "https://finance.yahoo.com/news/prediction-zcash-flip-monero-2026-140500962.html",
    "thumbnail": "https://s.yimg.com/ny/api/res/1.2/1a93WnrGg_5T7GazIdoPeA--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyMDA7aD04MDA-/https://media.zenfs.com/en/motleyfool.com/9e27a1c1c8961a79816acd69bc63b111",
    "pubDate": "2025-12-17T14:05:00+00:00"
  },
  {
    "title": "FactSet Research Systems' Quarterly Earnings Preview: What You Need to Know",
    "description": "",
    "link": "https://finance.yahoo.com/news/factset-research-systems-quarterly-earnings-140422214.html",
    "thumbnail": "https://media.zenfs.com/en/barchart_com_477/5e6f3bbf6d4c37fff1932564a594eaf6",
    "pubDate": "2025-12-17T14:04:22+00:00"
  },
  {
    "title": "General Mills earnings flash a warning sign for the economy",
    "description": "",
    "link": "https://finance.yahoo.com/news/general-mills-earnings-flash-warning-140407977.html",
    "thumbnail": "https://s.yimg.com/ny/api/res/1.2/DP7wuKGNH3R1FUO0RfgIyw--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyMDA7aD02NzU-/https://media.zenfs.com/en/quartz_855/3477d09f3bfcae3ef1655213b0d0a326",
    "pubDate": "2025-12-17T14:04:07+00:00"
  },
  {
    "title": "Warner Bros Discovery board rejects rival bid from Paramount",
    "description": "",
    "link": "https://finance.yahoo.com/news/warner-bros-discovery-board-rejects-120335579.html",
    "thumbnail": "https://media.zenfs.com/en/reuters-finance.com/343c67f49000843eadc9cf5815a03209",
    "pubDate": "2025-12-17T12:03:35+00:00"
  }
]