[
  {
    "title": "Donors to Trump’s Transition Revealed a Year Later",
    "description": "A 46-person list includes billionaires and people he went on to appoint to positions of power.",
    "link": "https://www.nytimes.com/2025/11/26/us/politics/trump-transition-donors.html",
    "thumbnail": "https://static01.nyt.com/images/2025/11/25/multimedia/25dc-transition-donors-hjkf/25dc-transition-donors-hjkf-facebookJumbo.jpg",
    "pubDate": "2025-11-26T05:05:26+00:00"
  },
  {
    "title": "Pope Leo to Visit Turkey and Lebanon",
    "description": "Leo XIV will meet political and religious leaders in Turkey and Lebanon, providing an early test of his geopolitical mettle. Here’s what to know.",
    "link": "https://www.nytimes.com/2025/11/26/world/middleeast/pope-leo-trip-turkey-lebanon.html",
    "thumbnail": "https://static01.nyt.com/images/2025/11/26/multimedia/26int-pope-explainer-hjgq/26int-pope-explainer-hjgq-facebookJumbo.jpg",
    "pubDate": "2025-11-26T05:01:03+00:00"
  },
  {
    "title": "Trump says China’s Xi Jinping agreed to accelerate purchases of US goods",
    "description": "China's Foreign Ministry said Trump initiated call with Xi Jinping and communication was crucial for stable relations.",
    "link": "https://www.aljazeera.com/news/2025/11/26/trump-says-chinas-xi-jinping-agreed-to-accelerate-purchases-of-us?traffic_source=rss",
    "thumbnail": "https://www.aljazeera.com/wp-content/uploads/2025/10/AP25303084164035-1761811481.jpg?resize=1920%2C1440",
    "pubDate": "2025-11-26T04:45:39+00:00"
  },
  {
    "title": "Bitcoin final leverage flush below $80K is possible, warns analyst",
    "description": "An analyst has warned that Bitcoin’s recent liquidation event may not be finished, with remaining leverage potentially pushing prices somewhere between the $70,000 to $80,000 zone.",
    "link": "https://cointelegraph.com/news/analyst-warns-more-leverage-liquidations-could-push-btc-below-80k?utm_source=rss_feed&utm_medium=rss%3Fr%3Dtcbr95%26_t%3D1764134136992&utm_campaign=rss_partner_inbound",
    "thumbnail": "https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjUtMTEvMDE5YWJlMTYtNGFkYS03ODg4LThkZTItNzY2ZmU5OTIxZWE3.jpg",
    "pubDate": "2025-11-26T04:29:15+00:00"
  },
  {
    "title": "Australia's consumer inflation accelerates to 3.8% in October, overshooting estimates",
    "description": "The largest contributor to consumer inflation was the housing sector that saw price growth of 5.9%, driven by higher costs in electricity, rents and new dwellings.",
    "link": "https://www.cnbc.com/2025/11/26/australia-inflation-cpi-in-october-estimates-beat.html",
    "thumbnail": "https://image.cnbcfm.com/api/v1/image/108232118-1764112908663-gettyimages-2226072368-AUSTRALIA_RETAIL.jpeg?v=1764112936&w=1920&h=1080",
    "pubDate": "2025-11-26T04:20:51+00:00"
  },
  {
    "title": "Asia-Pacific markets track Wall Street gains on rising Fed rate-cut expectations",
    "description": "Overnight, key U.S. indexes rose on growing hopes for a U.S. Federal Reserve rate cut next month.",
    "link": "https://www.cnbc.com/2025/11/26/asia-pacific-markets-live-nikkei-225-hang-seng-csi300-.html",
    "thumbnail": "https://image.cnbcfm.com/api/v1/image/107171168-1672097408734-gettyimages-1401627252-vcg111386428608.jpeg?v=1764113031&w=1920&h=1080",
    "pubDate": "2025-11-26T04:10:11+00:00"
  },
  {
    "title": "Republicans Fight With Trump’s Team Over Ukraine Talks",
    "description": "Senator Mitch McConnell and several other lawmakers have accused President Trump’s team of appeasing the Kremlin, warning that doing so would not lead to lasting peace.",
    "link": "https://www.nytimes.com/2025/11/25/us/politics/republicans-trump-ukraine.html",
    "thumbnail": "https://static01.nyt.com/images/2025/11/25/multimedia/25trump-news-gop-ukraine-lmqv/25trump-news-gop-ukraine-lmqv-facebookJumbo.jpg",
    "pubDate": "2025-11-26T04:03:59+00:00"
  },
  {
    "title": "Italy adds ‘femicide’ to the criminal code to curb violence against women",
    "description": "Italian Prime Minister Giorgia Meloni has supported a bill to punish 'femicide' with life imprisonment.",
    "link": "https://www.aljazeera.com/news/2025/11/26/italy-adds-femicide-to-the-criminal-code-to-curb-violence-against-women?traffic_source=rss",
    "thumbnail": "https://www.aljazeera.com/wp-content/uploads/2025/11/AP23354583740518-1764125496.jpg?resize=1920%2C1440",
    "pubDate": "2025-11-26T03:59:56+00:00"
  },
  {
    "title": "Ukraine says 'understanding' reached on US peace plan, as Trump envoy to meet Putin",
    "description": "Kyiv and Washington have moved closer to agreeing the shape of a deal to end the fighting, with Putin to be consulted next week.",
    "link": "https://www.bbc.com/news/articles/cy95jvw57v2o?at_medium=RSS&at_campaign=rss",
    "thumbnail": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/e47b/live/23aa8770-ca78-11f0-8afb-6903ddf7a8f3.jpg",
    "pubDate": "2025-11-26T03:59:51+00:00"
  },
  {
    "title": "New Zealand mother jailed for life over ‘suitcase murders’ of her children",
    "description": "Hakyung Lee gets life sentence with a minimum non-parole period of 17 years for murdering her two children.",
    "link": "https://www.aljazeera.com/news/2025/11/26/new-zealand-mother-jailed-for-life-over-suitcase-murders-of-her-children?traffic_source=rss",
    "thumbnail": "https://www.aljazeera.com/wp-content/uploads/2025/11/AP25330056919331-1764124789.jpg?resize=1920%2C1440",
    "pubDate": "2025-11-26T03:59:30+00:00"
  },
  {
    "title": "DeFi is already 30% of the way to mass adoption: Chainlink founder",
    "description": "Chainlink’s Sergey Nazarov has shared a potential roadmap for how DeFi could reach 100% adoption in four years, noting that a big part of this hinges on regulation.",
    "link": "https://cointelegraph.com/news/defi-global-adoption-regulation-institutional-funds-chainlink-founder?utm_source=rss_feed&utm_medium=rss%3Fr%3Dtcbr95%26_t%3D1764134136992&utm_campaign=rss_partner_inbound",
    "thumbnail": "https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjUtMDIvMDE5NTIzM2UtNDA5OC03ODRhLTg2MTktNGMwYTNiZjJkOWJm.jpg",
    "pubDate": "2025-11-26T03:51:13+00:00"
  },
  {
    "title": "Texas buys the Bitcoin dip, acquiring $5M of BlackRock’s IBIT",
    "description": "Texas has also allocated an additional $5 million for direct, self-custodied Bitcoin, signaling growing state-level adoption in the US.",
    "link": "https://cointelegraph.com/news/texas-snaps-5m-blackrock-bitcoin-etf-amid-btc-dip?utm_source=rss_feed&utm_medium=rss%3Fr%3Dtcbr95%26_t%3D1764134136992&utm_campaign=rss_partner_inbound",
    "thumbnail": "https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjUtMTEvMDE5YWJkNjctODBlNi03MTAxLWIzMzUtM2E1NjEyM2FhYzFm.jpg",
    "pubDate": "2025-11-26T03:13:41+00:00"
  },
  {
    "title": "‘Institutions have arrived’ — US Bancorp launches stablecoin pilot on Stellar network",
    "description": "The ability to freeze assets and unwind transactions was a key consideration when selecting the blockchain for the pilot, according to Mike Villano from US Bank.",
    "link": "https://cointelegraph.com/news/us-bancorp-stablecoin-pilot-pwc-stellar-blockchain?utm_source=rss_feed&utm_medium=rss%3Fr%3Dtcbr95%26_t%3D1764134136992&utm_campaign=rss_partner_inbound",
    "thumbnail": "https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjUtMDYvMDE5N2FkMTYtMzU5NC03OTk4LWIxZGUtNWI2ODcwOTUzM2My.jpg",
    "pubDate": "2025-11-26T03:10:44+00:00"
  },
  {
    "title": "Grayscale spot Dogecoin ETF falls under volume expectations on debut",
    "description": "Trading volume on the debut of Grayscale's first US spot Dogecoin ETF came in under an analyst’s expectation, with Bitwise soon to launch its own fund.",
    "link": "https://cointelegraph.com/news/america-s-first-spot-dogecoin-etf-falls-under-volume-expectations-on-debut?utm_source=rss_feed&utm_medium=rss%3Fr%3Dtcbr95%26_t%3D1764134136992&utm_campaign=rss_partner_inbound",
    "thumbnail": "https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjUtMDMvMDE5NTVmNGEtYzE2ZC03NjdhLWFiMmEtNmRmZWRjYmM2NDM1.jpg",
    "pubDate": "2025-11-26T03:06:19+00:00"
  },
  {
    "title": "Amazon faces FAA probe after delivery drone snaps internet cable in Texas",
    "description": "The probe comes as Amazon faces stiffer competition from Walmart, which has also begun drone deliveries.",
    "link": "https://www.cnbc.com/2025/11/25/amazon-faa-probe-delivery-drone-incident-texas.html",
    "thumbnail": "https://image.cnbcfm.com/api/v1/image/108207077-1759421802812-gettyimages-1732229069-AFP_33YJ8RL.jpeg?v=1764114154&w=1920&h=1080",
    "pubDate": "2025-11-26T02:58:03+00:00"
  },
  {
    "title": "Cuba condemns ‘aggressive’ US stance towards Venezuela as tensions rise",
    "description": "Cuba has accused the US of preparing a violent intervention in Venezuela as Washington expands its military presence.",
    "link": "https://www.aljazeera.com/news/2025/11/26/cuba-condemns-aggressive-us-stance-towards-venezuela-as-tensions-rise?traffic_source=rss",
    "thumbnail": "https://www.aljazeera.com/wp-content/uploads/2025/10/2025-10-26T182701Z_622383655_RC2LJHACRXAE_RTRMADP_3_USA-MILITARY-CARIBBEAN-TRINIDAD-1761688757.jpg?resize=1920%2C1440",
    "pubDate": "2025-11-26T02:50:29+00:00"
  },
  {
    "title": "Indonesia’s Jakarta now the world’s largest city, Tokyo falls to third: UN",
    "description": "Nine of the top 10 mega-cities are in Asia, with Bangladesh's Dhaka projected to be the world's largest city by 2050.",
    "link": "https://www.aljazeera.com/news/2025/11/26/indonesias-jakarta-now-the-worlds-largest-city-tokyo-falls-to-third-un?traffic_source=rss",
    "thumbnail": "https://www.aljazeera.com/wp-content/uploads/2025/11/epa_692647502ed9-1764116304.jpg?resize=1920%2C1440",
    "pubDate": "2025-11-26T02:49:57+00:00"
  },
  {
    "title": "FBI seeks to interview Sen. Mark Kelly, other Democrats Trump accused of seditious behavior",
    "description": "The Arizona Democrat Sen. Mark Kelly, a U.S. Navy veteran, faces a Pentagon probe for saying in a video, \"Our laws are clear: you can refuse illegal orders.\"",
    "link": "https://www.cnbc.com/2025/11/25/trump-fbi-mark-kelly-democrats-pentagon-video.html",
    "thumbnail": "https://image.cnbcfm.com/api/v1/image/108231704-1764080581721-Untitled-1.jpg?v=1764080654&w=1920&h=1080",
    "pubDate": "2025-11-26T02:08:10+00:00"
  },
  {
    "title": "Asia Morning Briefing: Asia Wakes Up to an AI BTC-Nvidia Tailwind That’s Already Starting to Sputter",
    "description": "Yesterday’s Amazon-driven risk rally is colliding with a sharp wobble in Nvidia, putting the AI-BTC-beta trade that lifted crypto back under scrutiny.",
    "link": "https://www.coindesk.com/markets/2025/11/26/asia-morning-briefing-asia-wakes-up-to-an-ai-btc-nvidia-tailwind-that-s-already-starting-to-sputter",
    "thumbnail": "",
    "pubDate": "2025-11-26T02:04:21+00:00"
  },
  {
    "title": "Snag An Apple Watch At Walmart For As Low As $129",
    "description": "Apple Watch SE 40mm (Second Generation) $129 Apple Watch SE2 40mm with GPS Apple Watch SE2 40mm with GPS + Cellular Apple Watch SE 44mm (Second Generation) $159 Apple Watch SE2 44mm with GPS Apple Watch SE2 44mm with GPS + Cellular What time is it? It's time to check out these Black Friday deals on Apple Watches at Walmart. While multiple models are seeing discounts, one of the best budget-friendly options on sale right now is the Apple Watch SE second-generation line. You can buy a GPS-enabled 40mm version for $129 (was $279), a 44mm SE2 model for $159 (was $279), or grab the cellular version of both models for the same price. Apple Watch SE 40mm (Second Generation) $129 Not just useful for checking the time at the flick of a wrist, the Apple Watch SE2 is an affordable option for tracking your health and fitness. These are designed to seamlessly connect with your Apple devices, are water-resistant to 50 meters, and can be easily customized with a range of optional watch bands and watch faces sold separately. Anyone looking to track their activity can explore various metrics that the watch tracks, making this a solid option for first-time users. Other features include Fall Detection, Crash Detection, and Emergency SOS. The watch also offers three months of Apple Fitness+ for free with the Workout app. This deal applies to all GPS and GPS + Cellular models in any available color while stock lasts. Apple Watch SE2 40mm with GPS Apple Watch SE2 40mm with GPS + Cellular Apple Watch SE 44mm (Second Generation) $159 If your wrist is on the larger side, you'll want to grab the 44mm Apple Watch as these have wider bands. Like the 40mm version above, this deal applies to all GPS and GPS + Cellular models in any available color. Apple Watch SE2 44mm with GPS Apple Watch SE2 44mm with GPS + Cellular The Apple Watch SE2 earned positive reviews after it launch in 2022, with critics noting that it offered users a sharp Retina display, powerful processor, and versatile health-monitoring tools. Considering that these watches still command a high price tag--and newer models cost even more--we're not expecting Walmart's SE2 stock to last long. Anyone looking for a fashion statement can also check out these deals on watches inspired by classic video games and consoles. The officially licensed Atari 2600, Space Invaders, and Tetris watches aren't just colorful tributes to video game history; they're interactive devices preloaded with video and arcade games that you can play on them. Continue Reading at GameSpot",
    "link": "https://www.gamespot.com/articles/apple-watch-se-2nd-gen-walmart-deal-bf2025/1100-6536491/?ftag=CAD-01-10abi2f",
    "thumbnail": "https://www.gamespot.com/a/uploads/screen_kubrick/1601/16018044/4611861-apple-watch-se2.jpg",
    "pubDate": "2025-11-26T02:00:00+00:00"
  },
  {
    "title": "FBI probes Democrats who urged US troops to defy illegal orders",
    "description": "US lawmakers who warned military against following illegal orders slam 'intimidation, harassment', face FBI interviews.",
    "link": "https://www.aljazeera.com/news/2025/11/26/fbi-probes-democrats-who-urged-us-troops-to-defy-illegal-orders?traffic_source=rss",
    "thumbnail": "https://www.aljazeera.com/wp-content/uploads/2025/11/2025-11-13T055325Z_1634939784_RC2BVHAW7U7H_RTRMADP_3_USA-POLITICS-1764117528.jpg?resize=1920%2C1440",
    "pubDate": "2025-11-26T01:35:26+00:00"
  },
  {
    "title": "Catch Up On HBO's Last Of Us With These 4K Blu-Ray Deals",
    "description": "The Last of Us Seasons 1 and 2 on 4K Blu-ray Watch the hit show in 4K with these discounted Blu-rays See at Amazon HBO's The Last of Us TV series has been hailed as one of the best video game adaptations, and for Black Friday, you can get 4K Blu-rays of the show's two seasons at a new low price. Based on the critically acclaimed games developed by Naughty Dog, The Last of Us Season 1 is on sale for $16.49 (was $20), and Season 2 is available for $27.49 (was $40). A limited-edition steelbook version of this Blu-ray is also on sale for $35 (was $45). Check out both deals below, along with links to even more Last of Us deals available during Black Friday. The Last of Us Season 1 (4K Blu-ray) $16.49 (was $20) Season 1 of The Last of Us adapted the first game in the series for TV. Starring Pedro Pascal and Bella Ramsey, the HBO show follows the pair as they journey across the post-pandemic US, a country devastated by an outbreak of a lethal Cordyceps fungus. The first season ran for nine episodes, and each episode is accompanied by a short documentary detailing its production. Additional bonus materials include featurettes on how the video game was adapted for TV, profiles of the actors, and how the TV show connected to the video game source material. The Last of Us Season 1 Special Features: Inside the Episode (No. 1-9) Controllers Down: Adapting The Last of Us From Levels to Live Action The Last of Us: Stranger than Fiction Ashley Johnson Spotlight Get to Know Me: Actor profiles Is This a The Last of Us Line? The Last Debrief with Troy Baker See at Amazon The Last of Us Season 2 (4K Blu-ray) $27.49 (was $40) Season 2 of The Last of Us adapted the first half of the second game in the series. Set several years later, Season 2 is mostly told from Ellie's perspective, focusing on the consequences of Season 1's climactic ending. All seven episodes from Season 2 are included, along with special features including behind-the-scenes featurettes, deep dives into the characters, and interviews. These bonus materials all originally aired on HBO, but the Blu-ray does include two exclusive special features: Ellie's Ultimate Revenge explores Ellie's motivations throughout Season 2 and Beneath the Surface: The Visual FX of The Last of Us offers a closer look at how the world around the characters was created with props and grisly special effects. The Last of Us Season 2 Bonus Features: Ellie's Ultimate Revenge (New) Beneath the Surface: The Visual FX of The Last of Us (New) Growing the World of The Last of Us Welcome to Jackson set tour Joel's Journey to Season 2 Ellie's Journey to Season 2 Q&amp;A with Pedro Pascal and Bella Ramsey The Battle of Jackson, deconstructed Open Book: Isabela &amp; Young Mazino Mushroom Taste Test Character featurettes: Joel, Ellie, Abby, Dina \"Making of\" featurettes for episodes 1-7 See at Amazon The Last of Us Season 2 Limited Edition Steelbook (4K Blu-ray) $35 (was $45) The steelbook edition contains the exact same special features, but the big draw here is the cover art of Joel and Ellie, flanked by Cordyceps virus iconography. See at Amazon HBO's The Last of Us series is a mostly faithful adaptation of the video games, and if you'd like to experience the source material, the PS5 remastered editions of both games are currently on sale during Black Friday. The Last of Us Part 1 is a remake of the original PS3 game and is now discounted to $30 (was $70). This version features substantially upgraded graphics and quality-of-life updates, as well as the Left Behind prequel chapter, new weapons, upgrades, visual filters, and a Speedrun Mode. The Last of Us Part 2 was already a good-looking game when it first debuted on PS4, but the PS5 version makes it look even better. The remastered version includes the original game and adds visual upgrades and levels featuring behind-the-scenes commentary from Naughty Dog developers. Additionally, you can explore three \"Lost Levels\" that weren't included in the game, test your skills in the roguelike survival mode No Return, and strum a few chords in Guitar Free Play mode. Continue Reading at GameSpot",
    "link": "https://www.gamespot.com/articles/the-last-of-us-seasons-1-2-4k-blu-ray-bf2025/1100-6536499/?ftag=CAD-01-10abi2f",
    "thumbnail": "https://www.gamespot.com/a/uploads/screen_kubrick/1601/16018044/4612035-tlou-main.jpg",
    "pubDate": "2025-11-26T01:30:00+00:00"
  },
  {
    "title": "TMNT TV Series Box Sets And Films Are Seeing Big Black Friday Price Drops",
    "description": "Teenage Mutant Ninja Turtles: The Complete Classic Series (1987-1996) DVD Box Set $22 (was $26.59) See at Amazon Teenage Mutant Ninja Turtles: The Complete Series (2012-2017) DVD Box Set $20.49 (was $34) See at Amazon The Teenage Mutant Ninja Turtles have been a mainstay of pop culture since their debut in the mid-1980s. While the team has seen numerous incarnations and reboots over the years, one of the most iconic is the original Teenage Mutant Ninja Turtles animated series that ran from 1987 to 1996. If you're in the mood to revisit those classic episodes--or introduce the series to a young fan--you can grab the Teenage Mutant Ninja Turtles: The Complete Classic Series (1987-1996) DVD Box Set for just $22 (was $26.59) thanks to an early Black Friday deal at Amazon. And for those who want to enjoy some of the Turtles' later adventures, you can also grab a DVD box set of the 2012 Nickelodeon revival series for $20.49 (was $34). Teenage Mutant Ninja Turtles: The Complete Classic Series (1987-1996) DVD Box Set $22 (was $26.59) The animated series that helped TMNT go mainstream, this box set includes all 193 episodes that aired across 10 seasons from 1987 to 1996. A family-friendly adaptation of the comic books, the series followed the Turtles, Leonardo, Donatello, Michelangelo, and Raphael, as they faced the Shredder, Krang, and other threats in New York City. The DVD collection features more than three hours of bonus content, including Under the Shell featurettes on key characters, a short documentary on the show’s cultural impact, and a retrospective on the creation of the TMNT franchise. See at Amazon Teenage Mutant Ninja Turtles: The Complete Series (2012-2017) DVD Box Set $20.49 (was $34) Following Viacom’s acquisition of the TMNT brand, a new CG animated series debuted in 2012. It kept the core elements of TMNT intact, while adding fresh takes on familiar characters and emphasizing the Turtles’ ninja skills as they battled new threats to Manhattan. This box set includes all 124 episodes from the show’s five seasons, spread across 20 discs. See at Amazon Several other TMNT DVDs and Blu-rays are on sale during Black Friday, including a 4K remaster collection of the original TMNT live-action film trilogy From Arrow Video that's on sale for $59.30 (was $100). The set includes 4K restorations of all three films. The 1990 film was restored from the original 35mm camera negatives, while the second and third films were restored from the original 35mm interpositives. Like other Arrow Video releases, the movies include Dolby Vision, HDR10, lossless stereo audio, and Dolby Atmos soundtracks, along with hours of special features. There's also new director commentary tracks for each film, new cast and crew interviews, and other materials. We've rounded up several more TMNT films and TV series deals into the list below, including the 2007 CGI movie, the 2010s live-action reboots, and 2023's animated film Mutant Mayhem. For other holiday discounts on Blu-rays, video games, graphic novels, and more, check out GameSpot's Black Friday Deals Hub. Continue Reading at GameSpot",
    "link": "https://www.gamespot.com/articles/tmnt-tv-series-box-set-black-friday-deals/1100-6536449/?ftag=CAD-01-10abi2f",
    "thumbnail": "https://www.gamespot.com/a/uploads/screen_kubrick/1601/16018044/4609374-tmnt-main.jpg",
    "pubDate": "2025-11-26T01:07:00+00:00"
  },
  {
    "title": "This Popular Board Games Is Down To Its Lowest-Ever Price For Black Friday",
    "description": "Ticket to Ride $27.49 (was $55) See at Amazon Need a fresh board game to play during your next holiday party or family gathering? The popular Ticket to Ride is 50% off at Amazon during Black Friday, bringing it down to its lowest price ever of $27.49 (was $55). It's sitting at 4.8/5 stars on Amazon with over 27,000 reviews, and most critics agree it's a fantastic strategy game with impressive longevity and replayability. If you're interested in the deal, you'll want to grab it soon--the discount is only available for a limited time, and with how popular the game is, there's a chance it could sell out even before Amazon's Black Friday Sale winds down. Ticket to Ride $27.49 (was $55) Ticket to Ride supports up to five players and is designed for ages eight and up. You'll be tasked with expanding your rail network across America with several different ways to achieve victory (such as collecting color sets of train cards or building the longest routes on the board). The rules are pretty simple for everyone to learn, but there's enough depth to the action that there's always something new to explore or a new strategy to attempt. See at Amazon Ticket to Ride's publisher, Asmodee, has a few other great board games on sale for Black Friday if you're looking to stock up with even more titles for holiday game nights. One of the most popular board games, Carcassonne, is available for $21 (was $42). The classic game sees you building an ever-changing landscape as you attempt to claim various landmarks and score points. This version features eye-catching artwork on the game pieces, and a redesigned rulebook aimed at making it easier to learn the rules. For something totally different, Heat: Pedal to the Metal is $48 (was $75). This is the best price ever for the frantic racing game, which sees up to six players managing a hand of cards and upgrading their vehicles as they seek to be the first across the finish line. The game also includes solo okay rules, allowing you to hone your skills before thrashing your buddies on game night. Check out all the Asmodee board games on sale at Amazon during Black Friday, and be sure to check out GameSpot's Black Friday Deals Hub for discounts on other board games, video games, graphic novels, and more. More Black Friday Board Games And Tabletop Deals At Amazon Board Games Card Games Trading Card Games Handheld Games B1G1 50% Off Board Games Ravensburger games Asmodee games Amazon Black Friday Gaming Deals Check out all of the video game and hardware discounts. See at Amazon Sign up for GameSpot's Weekly Deals Newsletter: Continue Reading at GameSpot",
    "link": "https://www.gamespot.com/articles/ticket-to-ride-board-game-2025-edition-is-50-off-bf2025/1100-6536471/?ftag=CAD-01-10abi2f",
    "thumbnail": "https://www.gamespot.com/a/uploads/screen_kubrick/1701/17013431/4612357-tickettoride.jpg",
    "pubDate": "2025-11-26T00:46:00+00:00"
  },
  {
    "title": "The 2026 Putin Calendar Is Here: ‘ A Man for Every Season’",
    "description": "January shows the Russian leader astride a snowmobile. For February, he flips a judo partner. In August, he offers advice: “My recipe for energy: Sleep little, work a lot and don’t whine.”",
    "link": "https://www.nytimes.com/2025/11/25/world/europe/putin-calendar-russia.html",
    "thumbnail": "https://static01.nyt.com/images/2025/11/25/world/25int-putin-calendar2/25int-putin-calendar2-facebookJumbo.jpg",
    "pubDate": "2025-11-26T00:37:01+00:00"
  },
  {
    "title": "Italian parliament unanimously votes to make femicide a crime",
    "description": "The gender-motivated murder of a woman will now be covered by a distinct clause in Italian law - punishable by a life sentence.",
    "link": "https://www.bbc.com/news/articles/c1dzp050yn2o?at_medium=RSS&at_campaign=rss",
    "thumbnail": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/a3c5/live/fcda0340-ca3c-11f0-86f6-7b854e603852.jpg",
    "pubDate": "2025-11-26T00:36:49+00:00"
  },
  {
    "title": "Russia-Ukraine war: List of key events, day 1,371",
    "description": "Here are the key events from day 1,371 of Russia’s war on Ukraine.",
    "link": "https://www.aljazeera.com/news/2025/11/26/russia-ukraine-war-list-of-key-events-day-1371?traffic_source=rss",
    "thumbnail": "https://www.aljazeera.com/wp-content/uploads/2025/11/2025-11-24T085936Z_1650113536_RC282IAWBEW9_RTRMADP_3_UKRAINE-CRISIS-POKROVSK-1764116182.jpg?resize=1920%2C1440",
    "pubDate": "2025-11-26T00:35:40+00:00"
  },
  {
    "title": "Trump Administration Will Raise Prices for Foreign Tourists at National Parks",
    "description": "The price increases comes as more and more international travelers are choosing to stay away from the United States and amid turmoil at the National Park Service.",
    "link": "https://www.nytimes.com/2025/11/25/us/politics/national-parks-prices-tourists-trump.html",
    "thumbnail": "https://static01.nyt.com/images/2025/11/25/multimedia/25trump-news-parks-fees1-gmqt/25trump-news-parks-fees1-gmqt-facebookJumbo.jpg",
    "pubDate": "2025-11-26T00:22:48+00:00"
  },
  {
    "title": "Tax rises, benefits and minimum wage. What could be in today's Budget?",
    "description": "Chancellor Rachel Reeves is considering both tax rises and spending cuts in the 26 November Budget.",
    "link": "https://www.bbc.com/news/articles/cj4w44w42j5o?at_medium=RSS&at_campaign=rss",
    "thumbnail": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/50ae/live/2e18f840-ca78-11f0-8c06-f5d460985095.jpg",
    "pubDate": "2025-11-26T00:02:09+00:00"
  },
  {
    "title": "The Best PC And PS5 SSD Black Friday Deals",
    "description": "1TB SSDs $70 - $130 See at Amazon 2TB SSDs $135 - $190 See at Amazon 4TB SSDs $240 (was $328) See at Amazon Solid-state drives (SSDs) have come a long way over the years, evolving from expensive storage devices into affordable upgrades for PCs and consoles. For Black Friday, SSDs from various manufacturers are on sale, with a wide range of capacities available. Considering that modern-day video games require more storage space than ever before, a storage capacity is an essential purchase for PC and console players--and grabbing one while they're on sale is a great opportunity to add a terabyte or four to your devices at more affordable price points. To help you find the best deals, we've rounded up a selection of discounted SSDs in the lists below. You'll find models that work on PC and PS5, as well as proprietary storage card expansions for Xbox Series X, and MicroSD cards for Switch, Switch 2, and Steam Deck. We've also thrown in a few SSD heatsinks and external drive options as well. Note that these are all limited-time deals, so pricing and availability may change. Once you've browsed all the SSD drives below, check out GameSpot's Black Friday Deals Hub for the latest discounts on hardware, video games, Blu-rays, and more. 1TB SSDs $70 - $130 1TB NVMe SSDs are some of the cheapest devices on the market, and Amazon is offering several models for under $100 during Black Friday. The BIWIN Black Opal NV7400 is on sale for $70 when you click the coupon on its page, while the Acer Predator GM7 and Crucial P310 2280 are just $80 each. All three SSDs provide comparable read/write speeds. There are also officially licensed PS5 SSDs from Seagate and Western Digital, but these do cost more than the options listed above. For PC gamers, we'd recommend the Crucial P510 with read/write speeds of up to 11,000/9,500 MB/s. While it will work with PS5 consoles as well, the specs are pure overkill for that system. Crucial P310 2280 -- $80 ($109) Crucial P510 -- $100 ($130) Acer Predator GM7 (No heatsink) -- $80 with coupon ($101) Biwin Black Opal NV7400 (No heatsink) -- $70 with coupon ($95) WD Black SN850P -- $130 ($159) Seagate 1TB Game Drive for PS5 -- $120 ($135) See at Amazon 2TB SSDs $135 - $190 While an extra terabyte is great for your system, a 2TB SSD is even better. These don't cost much more than the 1TB SSDs, and you can get one like the Crucial P310 2280 for as low as $135. This has read/write speeds of up to 6,000 MB/s and 7,100 MB/s, making it ideal for PS5 consoles. The more expensive options here include the officially licensed Seagate PS5 SSD for $170 (was $215) and the Crucial T710 for $190 (was $320). The Crucial SSD is once again specced beyond what is required for a PS5 console, so PC power users looking to handle demanding programs and move large files will want to consider grabbing this one. Crucial P310 2280 -- $135 ($178) Seagate 2TB Game Drive For PS5 -- $170 ($215) Crucial T710 -- $190 ($320) See at Amazon 4TB SSDs $240 (was $328) A 4TB SSD is pretty big, but the benefit of installing one is that you'll future-proof your PC or PS5. One of the best deals we've seen so far for these chunky SSDs is the PS5-compatible Crucial P310, which will work just fine in a PC as well. It delivers up to 7,100 MB/s read and 6,000 MB/s write speeds, and it's on sale for $240 (was $328). See at Amazon SSD Heatsinks As mentioned above, some of these SSDs will require a heatsink. PS5 owners can get the Sabrent heatsink for just $10 (was $14), and it's designed to seamlessly fit an M.2 drive and replace the native PS5 cover when placed in the expansion bay. Constructed from high-quality CNC'd aluminum, this has been a popular choice because it efficiently disperses heat. Continue Reading at GameSpot",
    "link": "https://www.gamespot.com/articles/the-best-pc-and-ps5-ssd-black-friday-deals/1100-6536460/?ftag=CAD-01-10abi2f",
    "thumbnail": "https://www.gamespot.com/a/uploads/screen_kubrick/1601/16018044/4611055-black-friday-ssd.jpg",
    "pubDate": "2025-11-26T00:00:00+00:00"
  },
  {
    "title": "Get Batman 4K Movie Sets &amp; Animated Series For All-Time Low Prices At Amazon",
    "description": "Batman: The Complete Animated Series on Blu-ray $28.49 (was $80) See at Amazon See at Walmart See at Amazon (DVD) See at Walmart (DVD) Batman Beyond: The Complete Series (Blu-ray) $19 (was $55) See at Amazon Batman fans can save big on movie box sets and TV series collections during Black Friday week at Amazon. There's a wide selection of 4K Blu-ray and Blu-ray deals across multiple eras of live-action Batman films. Christopher Nolan's The Dark Knight Trilogy 4K Blu-ray is on sale for only $29.49, while Tim Burton's Batman '89 and Batman Returns are collected in the Batman 4-Film 4K Blu-ray Collection for just $28. And if you're feeling nostalgic for the golden age of Batman animation, you can pick up the complete series Blu-ray box sets for Batman: The Animated Series, Batman Beyond, and The Batman for all-time low prices. Best Black Friday Batman Box Set Deals Here's a quick look at our favorite Batman box set deals in the sale: Continue Reading at GameSpot",
    "link": "https://www.gamespot.com/articles/batman-blu-ray-box-set-black-friday-deals/1100-6533035/?ftag=CAD-01-10abi2f",
    "thumbnail": "https://www.gamespot.com/a/uploads/screen_kubrick/1595/15950357/4612300-batmanboxsets.jpg",
    "pubDate": "2025-11-25T23:44:00+00:00"
  },
  {
    "title": "Ex-BBC board member criticised chair's handling of bias crisis in resignation letter",
    "description": "Shumeet Banerji resigned on Friday citing \"governance issues\" but the full reasons were not known until now.",
    "link": "https://www.bbc.com/news/articles/c5y9rz7eggko?at_medium=RSS&at_campaign=rss",
    "thumbnail": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/50a7/live/7000a820-c6ef-11f0-9fb5-5f3a3703a365.jpg",
    "pubDate": "2025-11-25T23:20:09+00:00"
  },
  {
    "title": "Manhattan condo values fell over the past decade. Here's why rents are still rising",
    "description": "More wealthy New Yorkers are choosing to rent as condos lose value in Manhattan.",
    "link": "https://www.cnbc.com/2025/11/25/as-manhattans-condo-market-wavers-rents-are-still-rising-.html",
    "thumbnail": "https://image.cnbcfm.com/api/v1/image/108103664-1739899132375-gettyimages-2199729705-20090101250218-99-958263.jpeg?v=1764020845&w=1920&h=1080",
    "pubDate": "2025-11-25T23:20:03+00:00"
  },
  {
    "title": "Nvidia says its GPUs are a 'generation ahead' of Google's AI chips",
    "description": "It was in response to Wall Street's concern that Google's TPU chips could threaten Nvidia's dominance of the AI infrastructure industry on Tuesday.",
    "link": "https://www.cnbc.com/2025/11/25/nvidia-says-its-gpus-are-a-generation-ahead-of-googles-ai-chips.html",
    "thumbnail": "https://image.cnbcfm.com/api/v1/image/108228210-1763560872768-2025-11-04T124305Z_639437890_RC2MPHA3CMAC_RTRMADP_3_GERMANY-TELEKOM-AI.JPG?v=1763585187&w=1920&h=1080",
    "pubDate": "2025-11-25T23:19:59+00:00"
  },
  {
    "title": "HP Inc shares fall on layoffs, weak guidance due to U.S. trade regulations",
    "description": "\"HP's outlook reflects the added cost driven by the current U.S. trade-related regulations in place, and associated mitigations,\" the company said.",
    "link": "https://www.cnbc.com/2025/11/25/hp-inc-shares-fall-as-company-says-it-will-cut-up-to-6000-employees.html",
    "thumbnail": "https://image.cnbcfm.com/api/v1/image/108228583-17635803682024-06-03t073502z_1717868119_rc2i38anw7tv_rtrmadp_0_taiwan-computex.jpeg?v=1763580425&w=1920&h=1080",
    "pubDate": "2025-11-25T22:56:05+00:00"
  },
  {
    "title": "What are the risks of Afghanistan-Pakistan tensions escalating?",
    "description": "More attacks in both countries despite peace efforts.",
    "link": "https://www.aljazeera.com/video/inside-story/2025/11/25/what-are-the-risks-of-afghanistan-pakistan-tensions-escalating?traffic_source=rss",
    "thumbnail": "https://www.aljazeera.com/wp-content/uploads/2025/11/image-1764108168.jpg?resize=1920%2C1080&quality=80",
    "pubDate": "2025-11-25T22:55:32+00:00"
  },
  {
    "title": "Market Volatility Underscores Epic Buildup of Global Risk",
    "description": "Some experts see a dangerous combination of factors reminiscent of practices that led to previous financial crises.",
    "link": "https://www.nytimes.com/2025/11/25/business/economy/stocks-bitcoin-markets-risk.html",
    "thumbnail": "https://static01.nyt.com/images/2025/11/24/multimedia/00Biz-Global-Risk-01-gzkt/00Biz-Global-Risk-01-gzkt-facebookJumbo.jpg",
    "pubDate": "2025-11-25T22:50:11+00:00"
  },
  {
    "title": "The ‘Wild Card’ in the Comey and James Cases: Will Judges Pick the Next Prosecutor?",
    "description": "The dismissal of indictments that President Trump sought against his perceived foes opens the door for federal judges to pick a new U.S. attorney to replace a Trump loyalist.",
    "link": "https://www.nytimes.com/2025/11/25/us/politics/comey-james-cases-next-steps.html",
    "thumbnail": "https://static01.nyt.com/images/2025/11/25/multimedia/25dc-justice-mkhp/25dc-justice-mkhp-facebookJumbo.jpg",
    "pubDate": "2025-11-25T22:45:53+00:00"
  },
  {
    "title": "Signs of Fatigue: Trump Faces Realities of Aging in Office",
    "description": "President Trump has always used his stamina and energy as a political strength. But that image is getting harder for him to sustain.",
    "link": "https://www.nytimes.com/2025/11/25/us/politics/trump-age-health.html",
    "thumbnail": "https://static01.nyt.com/images/2025/11/25/multimedia/00dc-trump-health-TOP-mpfh/00dc-trump-health-TOP-mpfh-facebookJumbo.jpg",
    "pubDate": "2025-11-25T22:45:26+00:00"
  },
  {
    "title": "Chelsea thump Barcelona in Champions League as Man City also lose",
    "description": "FIFA Club World Cup champions Chelsea of the English Premier League beat Spain's Barcelona 3-0 in the Champions League.",
    "link": "https://www.aljazeera.com/sports/2025/11/25/chelsea-thump-barcelona-in-champions-league-as-man-city-also-lose?traffic_source=rss",
    "thumbnail": "https://www.aljazeera.com/wp-content/uploads/2025/11/2025-11-25T220214Z_1154010923_UP1ELBP1P7O1L_RTRMADP_3_SOCCER-CHAMPIONS-CHE-BAR-1764108316.jpg?resize=1920%2C1440",
    "pubDate": "2025-11-25T22:33:48+00:00"
  },
  {
    "title": "Here’s what happened in crypto today",
    "description": "Need to know what happened in crypto today? Here is the latest news on daily trends and events impacting Bitcoin price, blockchain, DeFi, NFTs, Web3 and crypto regulation.",
    "link": "https://cointelegraph.com/news/what-happened-in-crypto-today?utm_source=rss_feed&utm_medium=rss%3Fr%3Dtcbr95%26_t%3D1764134136992&utm_campaign=rss_partner_inbound",
    "thumbnail": "https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjUtMDYvMDE5Nzk0MjMtZWY4ZS03YzYwLWI5MzctYjlkZGY3NWZlOGFk.jpg",
    "pubDate": "2025-11-25T22:32:03+00:00"
  },
  {
    "title": "Trump to send top envoy to Russia in push to finalise Ukraine plan",
    "description": "US president sends Steve Witkoff to meet Vladimir Putin to iron out 'a few' differences over plan to end Ukraine war.",
    "link": "https://www.aljazeera.com/news/2025/11/25/trump-says-close-to-ukraine-deal-kyivs-allies-urge-pressure-on-moscow?traffic_source=rss",
    "thumbnail": "https://www.aljazeera.com/wp-content/uploads/2025/11/AP25329059123160-1-1764098395.jpg?resize=1200%2C675",
    "pubDate": "2025-11-25T22:29:44+00:00"
  },
  {
    "title": "Bolsonaro ordered to start serving 27-year prison sentence for Brazil coup plot",
    "description": "The Supreme Court says the former leader has exhausted his appeals and will start his prison term at a police station in Brasilia.",
    "link": "https://www.bbc.com/news/articles/cr4dl19npv5o?at_medium=RSS&at_campaign=rss",
    "thumbnail": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/0fc1/live/e5525120-ca35-11f0-8799-efcbfb167d39.png",
    "pubDate": "2025-11-25T22:29:15+00:00"
  },
  {
    "title": "MegaETH scraps $1B plan after technical failures derail sale",
    "description": "Multiple technical failures during MegaETH’s pre-deposit phase pushed the raise beyond its limit and forced the team to halt the sale.",
    "link": "https://cointelegraph.com/news/megaeth-scraps-plan-technical-failures-derail-sale?utm_source=rss_feed&utm_medium=rss%3Fr%3Dtcbr95%26_t%3D1764134136992&utm_campaign=rss_partner_inbound",
    "thumbnail": "https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjUtMTEvMDE5YWJjYmMtMGQ4MS03OWMyLWJhMGYtOTNmOWQzNjU3NDQ0.jpg",
    "pubDate": "2025-11-25T22:25:30+00:00"
  },
  {
    "title": "Trump’s Retribution Push Has Expanded Even as It Hits Legal Barriers",
    "description": "A judge dismissed indictments against two of the president’s foes, but a new Pentagon investigation of a prominent Democrat shows how he is using a whole-of-government approach to punish those who cross him.",
    "link": "https://www.nytimes.com/2025/11/25/us/politics/trumps-retribution-legal-barriers.html",
    "thumbnail": "https://static01.nyt.com/images/2025/11/25/multimedia/25dc-retribution-mctj/25dc-retribution-mctj-facebookJumbo.jpg",
    "pubDate": "2025-11-25T22:17:31+00:00"
  },
  {
    "title": "Sir Richard Branson 'heartbroken' as wife, Joan, dies aged 80",
    "description": "Sir Richard said she was \"the most wonderful mum and grandmum our kids and grandkids could have ever wished for\".",
    "link": "https://www.bbc.com/news/articles/ce3z1gp2574o?at_medium=RSS&at_campaign=rss",
    "thumbnail": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/293f/live/e3dfcbd0-ca29-11f0-8509-37d18cd138a9.jpg",
    "pubDate": "2025-11-25T21:52:48+00:00"
  },
  {
    "title": "How To Get A Free Kill Bill Fortnite Skin",
    "description": "After giving everyone a free Juice WRLD skin a year ago, Fortnite is once again offering a free licensed skin to mark the start of a new chapter. Anyone who logs into Fortnite between November 27 at 6 AM PT and December 1 at 6 AM PT will receive a skin based on Yuki Yubari, a character from Quentin Tarantino's Kill Bill who didn't make the final cut of the movie when it was originally released. This Yuki Yubari skin is free to anyone who logs into Fortnite between November 27 and December 1.Back when Tarantino wrote his massive two-part epic Kill Bill, it included an additional sequence that was cut before filming, in which Yuki seeks revenge for the death of her sister Gogo, whom The Bride had killed during the battle at the House of Blue Leaves. Yuki finally sees the light of day in Fortnite Chapter 7, apparently. The Yuki Yubari skin is not actually in the Fortnite game files yet, so you won't be granted the skin until after Chapter 7 begins on November 29. Yuki is one of at least three Kill Bill-related skins coming to Fortnite in Chapter 7. The Bride herself will be included in the Chapter 7 Season 1 battle pass, and a skin based on Gogo Yubari will be sold in the item shop--and you can also earn it by purchasing a ticket in advance for a showing of Kill Bill: The Whole Bloody Affair during its opening weekend. Continue Reading at GameSpot",
    "link": "https://www.gamespot.com/articles/how-to-get-a-free-kill-bill-fortnite-skin/1100-6536515/?ftag=CAD-01-10abi2f",
    "thumbnail": "https://www.gamespot.com/a/uploads/screen_kubrick/1757/17577455/4612294-fortniteyuki.jpg",
    "pubDate": "2025-11-25T21:51:00+00:00"
  },
  {
    "title": "Trump pardons Thanksgiving turkeys, blasts Biden and says Ukraine peace deal is ‘very close’",
    "description": "Thanksgiving turkey prices have climbed this year, the first of President Donald Trump's second term in the White House.",
    "link": "https://www.cnbc.com/2025/11/25/trump-turkey-pardon-biden-ukraine-2025.html",
    "thumbnail": "https://image.cnbcfm.com/api/v1/image/108231861-17640921532025-11-25t173253z_89963273_rc2s3iaukfyf_rtrmadp_0_usa-thanksgiving-trump.jpeg?v=1764092166&w=1920&h=1080",
    "pubDate": "2025-11-25T21:33:45+00:00"
  },
  {
    "title": "Bitcoin wavers under $88K as traders brace for $14B BTC options expiry",
    "description": "Bitcoin price stalled as traders consider the impact of Friday’s $14 billion options expiry, but data does show some bullish traders positioning for higher prices.",
    "link": "https://cointelegraph.com/news/bitcoin-wavers-under-dollar88k-as-dollar14b-btc-options-expiry-draws-near?utm_source=rss_feed&utm_medium=rss%3Fr%3Dtcbr95%26_t%3D1764134136992&utm_campaign=rss_partner_inbound",
    "thumbnail": "https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjUtMTEvMDE5YWJjODktY2E2YS03NTRiLWI0NjItZGI4ZTlmZTVjODZm.jpg",
    "pubDate": "2025-11-25T21:24:07+00:00"
  },
  {
    "title": "Acting CFTC chair seeks CEOs for ‘innovation council,’ citing crypto",
    "description": "The US CFTC opened nominations for a CEO-led advisory group that will help shape policy on crypto, prediction markets and other emerging products.",
    "link": "https://cointelegraph.com/news/cftc-ceos-crypto-adviser-council?utm_source=rss_feed&utm_medium=rss%3Fr%3Dtcbr95%26_t%3D1764134136992&utm_campaign=rss_partner_inbound",
    "thumbnail": "https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjUtMDUvMDE5NmNmNDgtOThiZS03YmE0LThjOTYtMGI3NjYwM2JlNWRj.jpg",
    "pubDate": "2025-11-25T21:23:40+00:00"
  },
  {
    "title": "Magic: The Gathering's rarest Iroh evokes a heartbreaking Avatar moment",
    "description": "The exclusive BoxLunch Iroh, Grand Lotus card from Magic: The Gathering's Avatar set recalls a touching scene from the animated series",
    "link": "https://www.polygon.com/avatar-magic-the-gathering-iroh-grand-lotus-promo/",
    "thumbnail": "https://static0.polygonimages.com/wordpress/wp-content/uploads/2025/11/iroh-teah-party.jpg?w=1200&h=675&fit=crop",
    "pubDate": "2025-11-25T21:11:41+00:00"
  },
  {
    "title": "Farage's racism denials are dishonest, says ex-classmate",
    "description": "Peter Ettedgui tells the BBC Nigel Farage targeted antisemitic abuse at him when they were teenagers.",
    "link": "https://www.bbc.com/news/articles/cx2dny3r3vyo?at_medium=RSS&at_campaign=rss",
    "thumbnail": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/cbd3/live/ad11de10-ca27-11f0-a892-01d657345866.jpg",
    "pubDate": "2025-11-25T21:11:34+00:00"
  },
  {
    "title": "Texas Buys $5M in BTC ETF as States Edge Toward First Government Crypto Reserves",
    "description": "The effort is starting small, but Texas made an opening foray into a state-based crypto reserve — getting closer to the first government stockpile in the U.S.",
    "link": "https://www.coindesk.com/policy/2025/11/25/texas-buys-usd5m-in-btc-etf-as-states-edge-toward-first-government-crypto-reserves",
    "thumbnail": "",
    "pubDate": "2025-11-25T21:05:59+00:00"
  },
  {
    "title": "Black Ops 7 Conspiracies Tackled By Call Of Duty SBMM Creator",
    "description": "This may be the winter of discontent for some Call of Duty: Black Ops 7 players. Activision has been notably quiet about the game's sales, and has yet to share metrics or statistics. There's also been an uptick in anger from fans over conspiracy issues related to the game's Skill-Based Matchmaking mode. That's led Charlie Olson--the creator of CoD's SBMM--to directly address some of those concerns himself. OIson--who spent a decade at Raven Software under Activision--shared a lengthy video on his YouTube channel that dives into how his SBMM is supposed to work. He also took the time to explain why Activision's announcement about bringing \"open matchmaking\" to Black Ops 7 didn't mean the game was dropping SBMM. If fans were expecting the chance to cut down inexperienced or casual players, they've been disappointed. Olson argues that it means the game has been dominated by \"sweats,\" or experienced players, rather than rookie players. \"Some players are leaving because they thought this tweet meant SBMM had been completely removed from the game, and then they felt betrayed by the inclusion of one standard matchmaking playlist, and then blamed it for stealing 'fodder' from the open playlist,\" explained Olson. \"What's really going on here is there aren't enough casual players at launch to make open matchmaking the pubstomp that was expected or promise. If open lobbies are sweaty, it's because it's mostly sweats playing.\" Continue Reading at GameSpot",
    "link": "https://www.gamespot.com/articles/black-ops-7-conspiracies-tackled-by-call-of-duty-sbmm-creator/1100-6536514/?ftag=CAD-01-10abi2f",
    "thumbnail": "https://www.gamespot.com/a/uploads/screen_kubrick/1837/18375603/4612186-callofdutyblackops7duo.jpg",
    "pubDate": "2025-11-25T21:01:00+00:00"
  },
  {
    "title": "Official Lego Board Games Get Black Friday Lightning Deals at Amazon",
    "description": "Brick Like This! A Lego Party Game $13.49 (was $20) | Black Friday Lightning Deal See at Amazon Monkey Palace: A Lego Board Game $32 (was $42) | Black Friday Lightning Deal See at Amazon Amazon's Black Friday sale is filled with great deals on board and card games, but if you love Lego, there are two deals you'll want to check before they expire: Brick Like This and Monkey Palace. Brick Like This is an officially licensed Lego party game that launched in August for $20 and is on sale for only $13.49. Monkey Palace, meanwhile, turns building Lego structures into a dynamic and replayable strategy board game. Normally $42, Monkey Palace is on sale for $32 for a limited time. Brick Like This and Monkey Palace were designed by Dotted Games, one of the many studios under the Asmodee umbrella, and was formed specifically to collaborate with Lego on board/card games. Amazon's discounts are Lightning Deals with limited quantities. At the time of writing, Brick Like This is over 40% claimed, while Monkey Palace is over 20% claimed. Check out both official Lego board games below. We also included deals on the new Lego Recreate Activity Cards, which are up for grabs for only $8 each during Amazon's sale. Continue Reading at GameSpot",
    "link": "https://www.gamespot.com/articles/lego-board-game-brick-like-this-monkey-palace-deals/1100-6535752/?ftag=CAD-01-10abi2f",
    "thumbnail": "https://www.gamespot.com/a/uploads/screen_kubrick/1595/15950357/4612241-legoboardgames.jpg",
    "pubDate": "2025-11-25T20:59:00+00:00"
  },
  {
    "title": "Best Buy Black Friday Sale - Save Big On Switch Games",
    "description": "Whether you recently picked up the new Nintendo Switch 2 or are looking for something to play on the original Switch, you'll want to check out Best Buy's Black Friday sale, as numerous games for both systems are on sale during the event. The deals include price cuts on physical Switch and Switch 2 games, as well as discounts on digital edition Switch games. The Switch 2 deals are focused on third-party releases like Daemon X Machina: Titanic Scion for $50 (was $70) or EA Sports FC 26 for $30 (was $70), while the list of discounted Switch titles covers a mix of first- and third-party games, including up to 50% off on select Nintendo-published games like Super Mario Odyssey and Splatoon 3, both of which are $30 (normally $60). Considering Nintendo first-party releases rarely go on sale--and when they do, it's not by much--this is a great chance to stock up on Switch games for the holidays. And since Switch games are backwards compatible with the Switch 2--and in some cases have Switch 2 upgrades available--they could make great gifts for players of either console. Best Buy Black Friday Switch &amp; Switch 2 Deals at a Glance See Switch 2 game deals at Best Buy See Switch physical game deals at Best Buy See Switch digital download deals at Best Buy See Nintendo Amiibo deals at Best Buy There are dozens of Switch and Siwtch 2 games in Best Buy's sale--however, like many of Best Buy's Black Friday deals, these are limited-time offers and won't be around forever. So to help ensure you don't miss out on the savings, we've rounded up the best Nintendo Switch and Switch 2 game deals from Best Buy's sale into handy lists below. You can also check out the full lineup of discounts at Best Buy's online store, and can find even more holiday price cuts at GameSpot's Black Friday Deals Hub. Black Friday Switch 2 Games Deals at Best Buy While you won't find deals on first-party Nintendo games in Best Buy's sale (because, let's be honest--there aren't many Nintendo-published Switch 2 exclusive just yet), there is a solid selection of third-party titles on discount. Some noteworthy considerations are the acclaimed sandbox stealth-action game Hitman: World of Assassination - Signature Edition and Ubisoft's open-world Star Wars adventure Star Wars Outlaws: Gold Edition. You can also dive into the long-running Like A Dragon series while Yakuza 0 Switch 2 Edition. There are several more Switch 2 game deals in Best Buy's sale, and we've listed some of our favorites below. Continue Reading at GameSpot",
    "link": "https://www.gamespot.com/articles/nintendo-switch-game-deals-at-best-buy-bf2025/1100-6536454/?ftag=CAD-01-10abi2f",
    "thumbnail": "https://www.gamespot.com/a/uploads/screen_kubrick/1701/17013431/4612257-bestbf25switchgamedeals.jpg",
    "pubDate": "2025-11-25T20:55:00+00:00"
  },
  {
    "title": "Ewoks: The Battle for Endor proves Star Wars always had a junky TV side",
    "description": "George Lucas conceived the story for this 40-year-old made-for-TV movie, which had a small lasting impact, most recently on The Mandalorian.",
    "link": "https://www.polygon.com/the-ewoks-battle-for-endor-at-40-star-wars/",
    "thumbnail": "https://static0.polygonimages.com/wordpress/wp-content/uploads/2025/11/ewoks-and-blurrgs.jpg?w=1200&h=675&fit=crop",
    "pubDate": "2025-11-25T20:43:19+00:00"
  },
  {
    "title": "South Africa’s central bank flags crypto, stablecoins as financial risk",
    "description": "The bank cited increasing trading volume and the number of users among large exchanges, as well as gaps in South Africa’s regulatory framework on crypto.",
    "link": "https://cointelegraph.com/news/south-africa-central-bank-crypto-stablecoins-financial-risk?utm_source=rss_feed&utm_medium=rss%3Fr%3Dtcbr95%26_t%3D1764134136992&utm_campaign=rss_partner_inbound",
    "thumbnail": "https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjUtMTEvMDE5YWJjMjAtYzI4Yy03MGFiLWIyMWYtMjAzNmU5YzQyYTUx.jpg",
    "pubDate": "2025-11-25T20:15:00+00:00"
  },
  {
    "title": "100 Notable Books of 2025",
    "description": "Here is the standout fiction and nonfiction of the year, selected by the staff of The New York Times Book Review.",
    "link": "https://www.nytimes.com/2025/11/24/books/notable-books.html",
    "thumbnail": "https://static01.nyt.com/images/2025/12/07/books/review/25TBR-NOTABLES/25TBR-NOTABLES-facebookJumbo.jpg",
    "pubDate": "2025-11-25T20:14:13+00:00"
  },
  {
    "title": "Elden Ring Nightreign's DLC Scholar class is cooler than it sounds",
    "description": "The Forsaken Hollows DLC will throw Arcane and Faith fans a bone with its upcoming Nightfarer classes, which include a Scholar and Undertaker",
    "link": "https://www.polygon.com/elden-ring-nightreign-forsaken-hollows-dlc-scholar-nightfarer-gameplay/",
    "thumbnail": "https://static0.polygonimages.com/wordpress/wp-content/uploads/2025/11/ss_27dc0cd20dbac75330d9535cc535f28d267a1739-1920x1080.jpg?w=1600&h=900&fit=crop",
    "pubDate": "2025-11-25T19:45:40+00:00"
  },
  {
    "title": "Lorwyn: First Light review: a dazzling but baffling D&amp;D Magic crossover",
    "description": "A digital-only D&amp;D supplement bundled with the latest Forgotten Realms material, Lorwyn: First Light feels a tad muddles and incomplete",
    "link": "https://www.polygon.com/lorwyn-first-light-dnd-review/",
    "thumbnail": "https://static0.polygonimages.com/wordpress/wp-content/uploads/2025/11/01-005-shadowmoor-elf-1.png?w=1200&h=675&fit=crop",
    "pubDate": "2025-11-25T19:36:51+00:00"
  },
  {
    "title": "Stellar Rallies 2.3% Breaking Key Resistance on Volume Surge",
    "description": "Stellar breaks through critical $0.2460 level as institutional flows drive measured accumulation above seven-day averages.",
    "link": "https://www.coindesk.com/markets/2025/11/25/stellar-rallies-2-3-breaking-key-resistance-on-volume-surge",
    "thumbnail": "",
    "pubDate": "2025-11-25T19:00:48+00:00"
  },
  {
    "title": "U.S. Crypto Regulator, CFTC, Seeking Names for New 'CEO Innovation Council'",
    "description": "Acting Chairman Caroline Pham said the group will help usher in a new era of market structure, including a focus on digital assets.",
    "link": "https://www.coindesk.com/policy/2025/11/25/u-s-crypto-regulator-cftc-seeking-names-for-new-ceo-innovation-council",
    "thumbnail": "",
    "pubDate": "2025-11-25T18:51:06+00:00"
  },
  {
    "title": "Why rural Wisconsin is blocking the AI data center boom: 'Horses are skittish'",
    "description": "Tech giants are increasingly facing community backlash as they select places to build mammoth AI data centers.",
    "link": "https://www.cnbc.com/2025/11/25/microsoft-ai-data-center-rejection-vs-support.html",
    "thumbnail": "https://image.cnbcfm.com/api/v1/image/108225275-1763024938083-CNBC_Data_center_sign.jpg?v=1763024994&w=1920&h=1080",
    "pubDate": "2025-11-25T18:33:31+00:00"
  },
  {
    "title": "Filecoin Spikes 9% as Downtrend Breaks",
    "description": "The strong price action occurred on below-average volume.",
    "link": "https://www.coindesk.com/markets/2025/11/25/filecoin-spikes-9-as-downtrend-breaks",
    "thumbnail": "",
    "pubDate": "2025-11-25T18:32:50+00:00"
  },
  {
    "title": "Knives Out 3 director Rian Johnson keeps raising his difficulty level",
    "description": "Wake Up Dead Man is his most complicated and personal movie yet. He says it would be 'much harder' to keep his films simple and stay interested.",
    "link": "https://www.polygon.com/wake-up-dead-man-knives-out-director-rian-johnson-interview/",
    "thumbnail": "https://static0.polygonimages.com/wordpress/wp-content/uploads/2025/11/wudm_20240816_40431_r2.jpg?w=1600&h=900&fit=crop",
    "pubDate": "2025-11-25T18:30:14+00:00"
  },
  {
    "title": "U.S Bank Tests Custom Stablecoin Issuance on Stellar Network",
    "description": "The nation's fifth-largest commercial bank explores how a bank can issue stablecoins on a public blockchain.",
    "link": "https://www.coindesk.com/business/2025/11/25/u-s-bank-tests-custom-stablecoin-issuance-on-stellar-network",
    "thumbnail": "",
    "pubDate": "2025-11-25T18:29:53+00:00"
  },
  {
    "title": "Chris Mason: Reeves will be hoping the Budget buys her some time",
    "description": "Deep unpopularity in the country and jittery Labour MPs is the prism through which both the countdown to this Budget and its aftermath should be seen.",
    "link": "https://www.bbc.com/news/articles/cz68jedylvxo?at_medium=RSS&at_campaign=rss",
    "thumbnail": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/7112/live/9b5ede70-ca22-11f0-97da-d5d25c7170a0.jpg",
    "pubDate": "2025-11-25T17:58:16+00:00"
  },
  {
    "title": "TON Pulls Back After Ecosystem-Driven Rally as Traders Eye Key Support Near $1.50",
    "description": "The token's price action points to fading buyer interest, with initial strong trading activity giving way to a sharp decline in participation.",
    "link": "https://www.coindesk.com/markets/2025/11/25/ton-pulls-back-after-ecosystem-driven-rally-as-traders-eye-key-support-near-usd1-50",
    "thumbnail": "",
    "pubDate": "2025-11-25T17:56:06+00:00"
  },
  {
    "title": "Justice secretary wants to scrap jury trials except for most serious cases",
    "description": "Only cases of alleged murder, rape or manslaughter will be decided by a jury under new proposals to cut court backlogs.",
    "link": "https://www.bbc.com/news/articles/cy7vdvrnnvzo?at_medium=RSS&at_campaign=rss",
    "thumbnail": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/e204/live/2ad11750-ca17-11f0-a841-3bc77778e0c0.jpg",
    "pubDate": "2025-11-25T17:51:33+00:00"
  },
  {
    "title": "Ex-wife of Dubai royal says she fears arrest as custody battle escalates",
    "description": "Zeynab Javadli's ex-husband has lodged a criminal complaint with Dubai police, accusing her of kidnapping their three daughters.",
    "link": "https://www.bbc.com/news/articles/cj01j710rmmo?at_medium=RSS&at_campaign=rss",
    "thumbnail": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/8004/live/74cbb160-c9e7-11f0-9fb5-5f3a3703a365.jpg",
    "pubDate": "2025-11-25T17:40:57+00:00"
  },
  {
    "title": "Pluribus episode 5 preview: Watch an exclusive clip from 'Got Milk'",
    "description": "Rhea Seehorn's Carol isn't done demanding that her fellow survivors help her save humanity. Find out more in this exclusive Pluribus clip from Apple.",
    "link": "https://www.polygon.com/pluribus-episode-5-got-milk-exclusive-clip-carol/",
    "thumbnail": "https://static0.polygonimages.com/wordpress/wp-content/uploads/2025/11/message.jpg?w=1600&h=900&fit=crop",
    "pubDate": "2025-11-25T17:30:14+00:00"
  },
  {
    "title": "Oct. 7 Hamas Attack Victims Sue Binance for Damages",
    "description": "Binance allegedly facilitated the transfer of over $1 billion to sanctioned entities including Hamas and Iran's Revolutionary Guard Corps, a lawsuit said.",
    "link": "https://www.coindesk.com/business/2025/11/25/oct-7-hamas-attack-victims-sue-binance-for-damages",
    "thumbnail": "",
    "pubDate": "2025-11-25T17:24:12+00:00"
  },
  {
    "title": "Skate season 2 tweaks season pass, adds new co-op mode and challenges",
    "description": "EA's new Skate game heads into season 2 in December, with changes to the game's skate.Pass, new seasonal challenges, and impossible tricks.",
    "link": "https://www.polygon.com/skate-season-2-release-date-new-features-skatepass/",
    "thumbnail": "https://static0.polygonimages.com/wordpress/wp-content/uploads/2025/11/season-2-impossibles.jpg?w=1600&h=900&fit=crop",
    "pubDate": "2025-11-25T17:20:48+00:00"
  },
  {
    "title": "Pokémon Go shiny Keldeo 'Pony Tales' Masterwork Research quest steps",
    "description": "Should you buy the Pokémon Go shiny Keldeo research? We explain and list the steps in our guide.",
    "link": "https://www.polygon.com/pokemon-go-shiny-keldeo-pony-tales-masterwork-research-quest-steps/",
    "thumbnail": "https://static0.polygonimages.com/wordpress/wp-content/uploads/2025/11/jlee_251125_1001_pogo_shiny_keldeo.jpg?w=1600&h=900&fit=crop",
    "pubDate": "2025-11-25T17:14:52+00:00"
  },
  {
    "title": "Sellers are taking their homes off the market at the fastest pace in nearly a decade",
    "description": "Home sellers are taking their homes off the market at a fast clip, because they are sitting for more than 60 days and prices are weakening.",
    "link": "https://www.cnbc.com/2025/11/25/home-sellers-delisting-redfin.html",
    "thumbnail": "https://image.cnbcfm.com/api/v1/image/108200319-1758141740155-gettyimages-2235983392-dji_20250917121755_0386_d_rzemy12u.jpeg?v=1758141958&w=1920&h=1080",
    "pubDate": "2025-11-25T17:03:37+00:00"
  },
  {
    "title": "Disney's Zootopia 2 tackles tough issues with humor and heart",
    "description": "The sequel, starring Ginnifer Goodwin and Jason Bateman, maintains the same mix of visual gags, pop-culture references, and political messaging.",
    "link": "https://www.polygon.com/zootopia-2-review-disney/",
    "thumbnail": "https://static0.polygonimages.com/wordpress/wp-content/uploads/2025/11/zootopia2-online-use_129-0_047-50_0171.jpg?w=1200&h=675&fit=crop",
    "pubDate": "2025-11-25T17:01:13+00:00"
  },
  {
    "title": "ICP Clears Key Technical Barrier as Breakout Volume Confirms Upward Momentum",
    "description": "Internet Computer climbed through the crucial $4.20 resistance level on elevated volume before late-session consolidation narrowed gains.",
    "link": "https://www.coindesk.com/markets/2025/11/25/icp-clears-key-technical-barrier-as-breakout-volume-confirms-upward-momentum",
    "thumbnail": "",
    "pubDate": "2025-11-25T16:51:24+00:00"
  },
  {
    "title": "Steam games are increasingly getting cheaper, data shows",
    "description": "The most successful PC games on Steam that bring in the most money cost less than half of what AAA games on console tend to",
    "link": "https://www.polygon.com/steam-game-price-median-sales-console-aaa-data-trends-cheap/",
    "thumbnail": "https://static0.polygonimages.com/wordpress/wp-content/uploads/2025/11/peak.jpg?w=1600&h=900&fit=crop",
    "pubDate": "2025-11-25T16:47:41+00:00"
  },
  {
    "title": "BONK Breaks Through Overhead Resistance as Volume Jumps 85% Above Average",
    "description": "Increased trading volume carried BONK through a major resistance threshold before late pullbacks shaped a new support band.",
    "link": "https://www.coindesk.com/markets/2025/11/25/bonk-breaks-through-overhead-resistance-as-volume-jumps-85-above-average",
    "thumbnail": "",
    "pubDate": "2025-11-25T16:46:45+00:00"
  },
  {
    "title": "Palo Alto Networks' Stock Has Tanked But Its FCF is Strong - Price Target is 15% Higher",
    "description": "",
    "link": "https://finance.yahoo.com/news/palo-alto-networks-stock-tanked-165111301.html",
    "thumbnail": "https://media.zenfs.com/en/barchart_com_477/eb802ff5dbfe451f4a0e9eecd4b43612",
    "pubDate": "2025-11-24T16:51:11+00:00"
  },
  {
    "title": "Where Will Palantir Stock Be in 1 Year?",
    "description": "",
    "link": "https://finance.yahoo.com/news/where-palantir-stock-1-165000126.html",
    "thumbnail": "https://s.yimg.com/ny/api/res/1.2/Hd3l_gubr_QpMvl.9FXFdA--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyMDA7aD02NzU-/https://media.zenfs.com/en/motleyfool.com/c2218f5237259bdc9bdd0c8c5fcc0dae",
    "pubDate": "2025-11-24T16:50:00+00:00"
  },
  {
    "title": "Alphabet Stock Is a Berkshire Win. The Gain So Far May Be 40%.",
    "description": "",
    "link": "https://www.barrons.com/articles/alphabet-stock-berkshire-buffett-gain-bd16481e?siteid=yhoof2&yptr=yahoo",
    "thumbnail": "",
    "pubDate": "2025-11-24T16:49:00+00:00"
  },
  {
    "title": "How Diversity and Direct Brand Relationships Are Driving Growth for Copen United",
    "description": "",
    "link": "https://finance.yahoo.com/news/diversity-direct-brand-relationships-driving-164717418.html",
    "thumbnail": "https://media.zenfs.com/en/sourcing_journal_735/13842ba386c1d698caa3068258b9d095",
    "pubDate": "2025-11-24T16:47:17+00:00"
  },
  {
    "title": "Consumer Staples Stocks Take the Spotlight. What the Charts of Walmart, Target, Coca-Cola Say.",
    "description": "",
    "link": "https://www.barrons.com/articles/consumer-staples-stocks-charts-of-walmart-target-coca-cola-def9a0da?siteid=yhoof2&yptr=yahoo",
    "thumbnail": "",
    "pubDate": "2025-11-24T16:47:00+00:00"
  },
  {
    "title": "First Spot Dogecoin ETF Launches Amid Market Volatility",
    "description": "",
    "link": "https://www.wsj.com/livecoverage/stock-market-today-dow-sp-500-nasdaq-11-24-2025/card/first-spot-dogecoin-etf-launches-amid-market-volatility-Hy7Y4lG2Wbfzok4JWCAz?siteid=yhoof2&yptr=yahoo",
    "thumbnail": "https://images.wsj.net/im-89704721/social",
    "pubDate": "2025-11-24T16:45:02+00:00"
  },
  {
    "title": "Alibaba Stock Jumps. Why Its AI Chatbot Is a Big Deal.",
    "description": "",
    "link": "https://www.barrons.com/articles/alibaba-baba-stock-price-hk-qwen-2baa4eee?siteid=yhoof2&yptr=yahoo",
    "thumbnail": "",
    "pubDate": "2025-11-24T16:45:00+00:00"
  },
  {
    "title": "Should You Buy the 17% Pullback in Alibaba Stock Before November 25?",
    "description": "",
    "link": "https://finance.yahoo.com/news/buy-17-pullback-alibaba-stock-164146504.html",
    "thumbnail": "https://s.yimg.com/ny/api/res/1.2/xfCthZGJQdfw_KXBPmTRyg--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyMDA7aD03MTA-/https://media.zenfs.com/en/barchart_com_477/5682aa19d3bf8055dcbddc6e0016ed4c",
    "pubDate": "2025-11-24T16:41:46+00:00"
  },
  {
    "title": "Crude Prices Gain on Energy Demand Optimism",
    "description": "",
    "link": "https://finance.yahoo.com/news/crude-prices-gain-energy-demand-163657050.html",
    "thumbnail": "https://s.yimg.com/ny/api/res/1.2/ilV6uOTQynviIw8YH8PO1Q--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyMDA7aD04MDA-/https://media.zenfs.com/en/barchart_com_477/e4e2cd8bdeef35b93b36ae75ca316f8a",
    "pubDate": "2025-11-24T16:36:57+00:00"
  },
  {
    "title": "Kohl's promotes interim CEO and 30-year retail veteran Michael J. Bender to be its permanent chief",
    "description": "",
    "link": "https://finance.yahoo.com/news/kohls-promotes-interim-ceo-30-152815096.html",
    "thumbnail": "https://s.yimg.com/ny/api/res/1.2/c50uWzack6l8stkOpGjjVA--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyMDA7aD04MDA-/https://media.zenfs.com/en/ap_finance_articles_694/0507db28fd020dcc510405e3bde01081",
    "pubDate": "2025-11-24T15:28:15+00:00"
  }
]