[
  {
    "title": "U.S. Strikes Islamic State Targets in Syria",
    "description": "American forces struck dozens of suspected ISIS sites, making good on President Trump’s vow to avenge two American soldiers and a civilian U.S. interpreter killed by the group last week.",
    "link": "https://www.nytimes.com/2025/12/19/us/politics/us-islamic-state-strikes-syria.html",
    "thumbnail": "https://static01.nyt.com/images/2025/12/19/multimedia/19dc-military-jbfm/19dc-military-jbfm-facebookJumbo.jpg",
    "pubDate": "2025-12-20T04:34:53+00:00"
  },
  {
    "title": "US sanctions more relatives, associates of Venezuelan President Maduro",
    "description": "New sanctions come days after the Trump administration imposed a blockade on Venezuela's oil tankers.",
    "link": "https://www.aljazeera.com/news/2025/12/20/us-sanctions-more-relatives-associates-of-venezuelan-president-maduro?traffic_source=rss",
    "thumbnail": "https://www.aljazeera.com/wp-content/uploads/2025/12/getty_6945fa131b-1766193683.jpg?resize=1920%2C1440",
    "pubDate": "2025-12-20T04:20:12+00:00"
  },
  {
    "title": "6 Takeaways From the First Batch of the Epstein Files",
    "description": "Many of the Justice Department documents were heavily redacted, and President Trump’s name was rarely mentioned. The White House also sought to make political hay of the release of photos of Bill Clinton.",
    "link": "https://www.nytimes.com/2025/12/19/us/politics/epstein-files-takeaways.html",
    "thumbnail": "https://static01.nyt.com/images/2025/12/19/reader-center/19epstein-files-takeaways/19epstein-files-takeaways-facebookJumbo.jpg",
    "pubDate": "2025-12-20T04:01:16+00:00"
  },
  {
    "title": "Trump’s name added to Kennedy Center exterior, one day after vote to rename",
    "description": "Relatives of the late President John F Kennedy slammed the centre's board, saying the name cannot be changed under law.",
    "link": "https://www.aljazeera.com/news/2025/12/20/trumps-name-added-to-kennedy-center-exterior-one-day-after-vote-to-rename?traffic_source=rss",
    "thumbnail": "https://www.aljazeera.com/wp-content/uploads/2025/12/2025-12-19T193151Z_295961518_RC2VJIAQFZX2_RTRMADP_3_USA-TRUMP-KENNEDY-CENTER-1766200537.jpg?resize=1920%2C1440",
    "pubDate": "2025-12-20T03:49:39+00:00"
  },
  {
    "title": "Epstein Files Include 1996 Child Porn Complaint That F.B.I. Ignored",
    "description": "Newly released files show how Maria Farmer, who worked for Mr. Epstein in the 1990s, had urged the F.B.I. to investigate him. The case went nowhere for years.",
    "link": "https://www.nytimes.com/2025/12/19/us/epstein-fbi-complaint-1996-maria-farmer.html",
    "thumbnail": "https://static01.nyt.com/images/2025/12/19/multimedia/19epstein-files-live-1996-complaint-mhtl/19epstein-files-live-1996-complaint-mhtl-facebookJumbo.jpg",
    "pubDate": "2025-12-20T03:33:53+00:00"
  },
  {
    "title": "Epstein Victims Upset About Lack of Transparency in Newly Released Files",
    "description": "Several victims said they were frustrated by the heavy redactions of photos and documents that the Justice Department released on Friday.",
    "link": "https://www.nytimes.com/2025/12/19/us/epstein-files-victims-reaction.html",
    "thumbnail": "https://static01.nyt.com/images/2025/12/19/multimedia/19epstein-files-live-victim-reaction-tjzl/19epstein-files-live-victim-reaction-tjzl-facebookJumbo.jpg",
    "pubDate": "2025-12-20T02:44:29+00:00"
  },
  {
    "title": "Bitcoin rallies thwarted by fading Fed rate cut odds, softening US macro",
    "description": "Bitcoin continued to sell near $90,000 as investors reacted to weak US jobs data and slowing economic growth by shifting into safer assets.",
    "link": "https://cointelegraph.com/news/bitcoin-rallies-thwarted-by-fading-fed-rate-cut-odds-softening-us-macro?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
    "thumbnail": "https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=1200/https://s3.cointelegraph.com/uploads/2025-12/019b384f-4d8a-7fdf-bec5-b57e85533536.jpg",
    "pubDate": "2025-12-20T02:42:00+00:00"
  },
  {
    "title": "Altcoin season never ended, traders just missed the winners: Hayes",
    "description": "As market participants continue to speculate on when altcoin season will arrive, BitMEX co-founder Arthur Hayes argued there is “always an altcoin season happening.”",
    "link": "https://cointelegraph.com/news/altcoin-season-never-ended-traders-just-missed-the-winners-hayes?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
    "thumbnail": "https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=1200/https://s3.cointelegraph.com/uploads/2025-12/019b38c5-5d64-7f29-af3e-7639bb242fad.jpg",
    "pubDate": "2025-12-20T02:14:30+00:00"
  },
  {
    "title": "Suspect in Brown and M.I.T. Killings Died 2 Days Before He Was Found, Autopsy Shows",
    "description": "The examination confirmed that the suspect had died from a self-inflicted gunshot wound. His body was found late Thursday in a storage unit in New Hampshire.",
    "link": "https://www.nytimes.com/2025/12/19/us/suspect-brown-mit-autopsy.html",
    "thumbnail": "https://static01.nyt.com/images/2025/12/19/multimedia/19brown-shooting-autopsy-tjck/19brown-shooting-autopsy-tjck-facebookJumbo.jpg",
    "pubDate": "2025-12-20T02:11:25+00:00"
  },
  {
    "title": "Nex Playground Boss Says The Console Solves The Wii \"Problem\"",
    "description": "While Sony and Nintendo have expanded their lead over Xbox, a dark horse console had a very strong showing in third place in November. The Nex Playground has emerged as a breakout hit, and CEO David Lee believes that one of the reasons why its been so successful is because the console has solved the Wii \"problem.\" Nearly two decades ago, the Wii powered Nintendo's post-GameCube comeback with its motion controls and unique games. Lee argues that the scope of Wii's success made it difficult to sustain in the long term. Instead of trying to sell games like Wii, Nex Playground is offering its titles as part of a subscription service. \"One of the most important things we should do is learn from history and try not to commit the same limitations, and that's why we have a subscription model,\" Lee told The Game Business. \"Nintendo expanded the audience with Wii. When you expand the audience, and they want different things, and they only buy Wii Fit, Wii Sports and not many others … that's a bit of a problem.\" Continue Reading at GameSpot",
    "link": "https://www.gamespot.com/articles/nex-playground-boss-says-the-console-solves-the-wii-problem/1100-6537124/?ftag=CAD-01-10abi2f",
    "thumbnail": "https://www.gamespot.com/a/uploads/screen_kubrick/1837/18375603/4626328-nex.jpg",
    "pubDate": "2025-12-20T02:05:00+00:00"
  },
  {
    "title": "Elise Stefanik Tried Everything to Please Trump. He Still Jilted Her.",
    "description": "The G.O.P. congresswoman who ran as a moderate but became an “ultra MAGA” Trump acolyte ultimately found herself undermined by the president and politically adrift.",
    "link": "https://www.nytimes.com/2025/12/19/us/politics/elise-stefanik-trump-governor-congress.html",
    "thumbnail": "https://static01.nyt.com/images/2025/12/19/multimedia/19dc-Stefanik-zphm/19dc-Stefanik-zphm-facebookJumbo.jpg",
    "pubDate": "2025-12-20T01:59:07+00:00"
  },
  {
    "title": "Elise Stefanik Drops Out of N.Y. Governor’s Race and Will Leave Congress",
    "description": "Ms. Stefanik, a Republican congresswoman and staunch ally of President Trump, abruptly ended her bid to unseat Gov. Kathy Hochul and said she would not seek another House term.",
    "link": "https://www.nytimes.com/2025/12/19/nyregion/elise-stefanik-drops-out-governor.html",
    "thumbnail": "https://static01.nyt.com/images/2025/12/19/multimedia/00met-stefanik-qmvf/00met-stefanik-qmvf-facebookJumbo-v2.jpg",
    "pubDate": "2025-12-20T01:46:49+00:00"
  },
  {
    "title": "Villareal vs Barcelona: La Liga – teams, start, lineups, kickoff",
    "description": "Villareal seek their first Spanish title, which would be a major shake-up of Barcelona and Real Madrid's La Liga grip.",
    "link": "https://www.aljazeera.com/sports/2025/12/20/villareal-vs-barcelona-la-liga-teams-start-lineups-kickoff?traffic_source=rss",
    "thumbnail": "https://www.aljazeera.com/wp-content/uploads/2025/12/2025-12-13T184506Z_572313806_UP1ELCD1G341Q_RTRMADP_3_SOCCER-SPAIN-BAR-OSA-1766061886.jpg?resize=1920%2C1440",
    "pubDate": "2025-12-20T01:26:04+00:00"
  },
  {
    "title": "Russia-Ukraine war: List of key events, day 1,395",
    "description": "These are the key developments from day 1,395 of Russia’s war on Ukraine.",
    "link": "https://www.aljazeera.com/news/2025/12/20/russia-ukraine-war-list-of-key-events-day-1395?traffic_source=rss",
    "thumbnail": "https://www.aljazeera.com/wp-content/uploads/2025/12/image-1766192648.jpg?resize=1498%2C1080&quality=80",
    "pubDate": "2025-12-20T01:26:03+00:00"
  },
  {
    "title": "Save Up To 25% On The Akira Manga Hardcover Edition",
    "description": "Akira Hardcover Collection Save Up To 25% See all volumes at Amazon Any list gathering up the best that anime has to offer will inevitably include Akira, and for good reason. The 1988 movie raised the bar for film animation and is widely credited with introducing mainstream audiences outside Japan to the medium. However, the anime adaptation is only part of the tale. Like innumerable other anime projects, Akira is adapted from a much longer--though lesser-known--manga series. While the Akira manga has been available in print for decades, a new Akira Hardcover Edition kicked off earlier in 2025, offering the most authentic presentation of Katsuhiro Otomo's groundbreaking sci-fi saga. If you've ever wanted to experience the full Akira saga, this is one of the best ways to do so--and as luck would have it, you can save a few dollars on these premium hardcover releases. Four volumes in the six-volume series are available to purchase at Amazon, and while these normally cost between $30 and $40, you can get them for up 25% off. Volumes 5 and 6 are also launching in the coming weeks, and preorders are live. Akira Hardcover Collection Save Up To 25% The Akira Hardcover books published by Kodansha use the updated translation and lettering of the 35th Anniversary Edition box set, and each book is presented as a large-sized 7\" x 10\" collectible. Like traditional manga, they are read from right to left, and the original Japanese-language hand-drawn sound effects from the manga have been restored. Each hardcover book has cover artwork based on the original manga tankabon volume artwork. As mentioned above, four volumes have launched so far, and are currently discounted to roughly $26 - $27 at Amazon (normally $30 - $35 each). The next release, Akira Hardcover Collection 5, releases on December 23. Preorders are discounted to $34 (down from $36). This will be followed by Akira Hardcover Collection 6, a month later on January 27, 2026. Preorders for volume six are available for $40. Check out all the Akira Hardcover Collection releases below. Akira Hardcover Collection 1 -- $26.61 ($35) Akira Hardcover Collection 2 -- $26.61 ($35) Akira Hardcover Collection 3 -- $25.70 ($30) Akira Hardcover Collection 4 -- $27.61 ($35) Akira Hardcover Collection 5 -- $34 ($36) | Releases December 23 Akira Hardcover Collection 6 -- $40 | Releases January 27, 2026 See all volumes at Amazon While the hardcover editions above are fresh reprints, you can also pick up all six of them as part of the Akira 35th Anniversary Manga Box Set. All six volumes come bundled together with the hardcover Akira Club art book and an exclusive pill patch. It's currently sold out, but it gets restocked periodically at Amazon, so it's worth checking back to see if it's available. Set in a dark future timeline, Akira first began publication in 1982 and ran for 120 chapters. Taking place in the post-apocalyptic city of Neo-Tokyo, the series examines the after-effects of a mysterious explosion that almost destroyed the city. Thirty years later, teenage biker gang leader Shotaro Kaneda finds himself in the middle of a plot that involves militant revolutionaries, psychically gifted individuals, military forces, and his childhood friend, Tetsuo Shima, who has begun to develop dangerously destructive psychic powers of his own. Akira manga was critically acclaimed for its mature themes, well-developed characters, intriguing storylines, and Otomo's artwork. In the years since its publication, it's become regarded as one of the pioneering works in the then-burgeoning Cyberpunk sci-fi subgenre. Continue Reading at GameSpot",
    "link": "https://www.gamespot.com/articles/akira-hardcover-manga-deals/1100-6537101/?ftag=CAD-01-10abi2f",
    "thumbnail": "https://www.gamespot.com/a/uploads/screen_kubrick/1701/17013431/4626327-akira.jpg",
    "pubDate": "2025-12-20T01:20:00+00:00"
  },
  {
    "title": "Suspected Killer of M.I.T. Professor Studied With Victim, Graduating Top of Their Class",
    "description": "The parents of the suspect in the Brown and M.I.T. killings had not seen or heard from him since he left Portugal to enroll at a graduate program at Brown more than two decades ago.",
    "link": "https://www.nytimes.com/2025/12/19/us/mit-professor-shooting-suspect-portugal-lisbon-physics.html",
    "thumbnail": "https://static01.nyt.com/images/2025/12/19/us/19brown-shooting-mit-professor-topart/19brown-shooting-mit-professor-topart-facebookJumbo.jpg",
    "pubDate": "2025-12-20T01:10:38+00:00"
  },
  {
    "title": "US carries out 'massive' strike against IS in Syria",
    "description": "The US says it struck dozens of targets across Syria in response to last week's deadly Islamic State attack on US forces there.",
    "link": "https://www.bbc.com/news/articles/c5yq7zzw618o?at_medium=RSS&at_campaign=rss",
    "thumbnail": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/8838/live/42c9f050-dd2e-11f0-b67b-690eb873de1b.jpg",
    "pubDate": "2025-12-20T01:07:44+00:00"
  },
  {
    "title": "How a Reddit Post Helped the Police Identify a Suspect in the Brown University Shooting",
    "description": "A Reddit user provided information that helped identify Claudio Manuel Neves Valente as the suspect not only in the campus shooting but also in the murder of an M.I.T. professor.",
    "link": "https://www.nytimes.com/2025/12/19/us/brown-mit-shooting-investigation-reddit.html",
    "thumbnail": "https://static01.nyt.com/images/2025/01/18/multimedia/18brown-shooting-capture-cjbp/18brown-shooting-capture-cjbp-facebookJumbo.jpg",
    "pubDate": "2025-12-20T01:00:08+00:00"
  },
  {
    "title": "Trump government suspends visa lottery linked to Brown University suspect",
    "description": "The US president has repeatedly taken actions to limit immigration after violent attacks, blaming foreigners for crime.",
    "link": "https://www.aljazeera.com/news/2025/12/20/trump-government-suspends-visa-lottery-linked-to-brown-university-suspect?traffic_source=rss",
    "thumbnail": "https://www.aljazeera.com/wp-content/uploads/2025/12/AP25352776974265-1766189714.jpg?resize=1920%2C1440",
    "pubDate": "2025-12-20T00:20:19+00:00"
  },
  {
    "title": "What's really going on with flu this winter?",
    "description": "We've been told we're facing an unprecedented superflu. Is it?",
    "link": "https://www.bbc.com/news/articles/cr7lpmkl9r1o?at_medium=RSS&at_campaign=rss",
    "thumbnail": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/024b/live/6ea62260-dd02-11f0-b67b-690eb873de1b.jpg",
    "pubDate": "2025-12-20T00:06:36+00:00"
  },
  {
    "title": "Epstein files released by DOJ",
    "description": "President Donald Trump signed the Epstein Files Transparency Act in November.",
    "link": "https://www.cnbc.com/2025/12/19/jeffrey-epstein-files-doj-release-order-maxwell.html",
    "thumbnail": "https://image.cnbcfm.com/api/v1/image/106012127-1562782068149rts2lp7i.jpg?v=1689367248&w=1920&h=1080",
    "pubDate": "2025-12-20T00:05:20+00:00"
  },
  {
    "title": "Trump says US launched large-scale attacks on ISIL in Syria",
    "description": "The attacks come a week after three Americans, including two US soldiers, were killed in Syria's Palmyra.",
    "link": "https://www.aljazeera.com/news/2025/12/20/trump-says-us-launched-large-scale-attacks-on-isil-in-syria?traffic_source=rss",
    "thumbnail": "https://www.aljazeera.com/wp-content/uploads/2025/12/afp_6945db7931e2-1766185849.jpg?resize=1920%2C1440",
    "pubDate": "2025-12-20T00:04:47+00:00"
  },
  {
    "title": "Trump Picks New Leader for Southern Command as Venezuela Pressure Grows",
    "description": "Lt. Gen. Francis L. Donovan, a Marine general with expansive experience in special operations and the Middle East, would take over after the abrupt departure of the previous commander.",
    "link": "https://www.nytimes.com/2025/12/19/us/politics/frank-donovan-southern-command-trump.html",
    "thumbnail": "https://static01.nyt.com/images/2025/12/19/multimedia/19dc-southcom-phkc/19dc-southcom-phkc-facebookJumbo.jpg",
    "pubDate": "2025-12-20T00:04:16+00:00"
  },
  {
    "title": "Become A Pokemon Professor With The Upcoming Pokecology Guidebook",
    "description": "Pokecology: An Illustrated Guide to Pokemon Ecology $15 | Releases April 21, 2026 Preorder at Amazon Have you ever dreamed of being a Pokemon researcher? If so, you'll need to do some studying to become a bonafide expert in the field of pocket monsters, and that's where this informative book comes into play. Pokecology: An Illustrated Guide to Pokemon Ecology is an official book that explores the habitats of the famous monsters, and you can add it to your list of study materials for just $15 ahead of its release on April 21, 2026. Pokecology: An Illustrated Guide to Pokemon Ecology $15 | Releases April 21, 2026 The Pokecology explores the ecologies of Pokemon based on data from the Pokedex. The 208-page book is full of visuals that examine the similarities, differences, generalities, and relationships between Pokemon ecologies, and Chihiro Kinoshita, a real-life expert in animal behavior and ecosystems, has illustrated it. The book is also officially licensed by The Pokemon Company, as it's produced through its publishing imprint, Pikachu Press. Preorder at Amazon Gallery For more Pokemon academia, you can also check out Pokemon: The Complete Pocket Guide Volume 1 and Volume 2. The first 560-page volume covers Pokedex entries No. 1 through 442, and the 552-page Volume 2 covers Pokémon 443 through 898 on the National Pokedex. This is a fairly comprehensive list, but you won't find Pokemon from the Paldean region of Pokemon Scarlet and Violet listed here. The nice thing about these books is that they're designed to be pocket-friendly and they're also available as part of a two-book box set. Each Pokemon is accompanied by details on its stats, abilities, moves, and evolutions. Pokemon Pocket Guides Volumes 1 and 2 Pokemon Pocket Guide: Volume 1 -- $9.76 ($15) Pokemon Pocket Guide: Volume 2 -- $12.60 ($15) Pokemon Complete Pocket Guide Box Set (Vol. 1 and 2) -- $20.29 ($29) Speaking of Pokemon habitats and ecology, you can also look forward to Pokemon Pokopia next year. Preorders are now live for the Minecraft-inspired Pokemon game, which sees players work to restore a desolate land into a paradise for Pokemon. Priced at $70, it'll be released for Switch 2 consoles on March 5, 2026. Continue Reading at GameSpot",
    "link": "https://www.gamespot.com/articles/pokecology-an-illustrated-guide-to-pokemon-ecology-preorder-guide/1100-6537051/?ftag=CAD-01-10abi2f",
    "thumbnail": "https://www.gamespot.com/a/uploads/screen_kubrick/1701/17013431/4626323-pokecology.jpg",
    "pubDate": "2025-12-20T00:02:00+00:00"
  },
  {
    "title": "Rosenberg: Was Putin's response to my question about war in Europe an olive branch?",
    "description": "Russia's leader told our Russia editor that claims an attack on Europe was planned were \"rubbish\".",
    "link": "https://www.bbc.com/news/articles/c5y9ed5d1r4o?at_medium=RSS&at_campaign=rss",
    "thumbnail": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/fe11/live/e6b9dd60-dd2e-11f0-aae2-2191c0e48a3b.jpg",
    "pubDate": "2025-12-20T00:00:19+00:00"
  },
  {
    "title": "Avatar: Fire and Ash's ending has a Death Star problem",
    "description": "The end of Avatar: Fire and Ash looks a lot like the end of Avatar: Way of Water. Here's why that's a problem.",
    "link": "https://www.polygon.com/avatar-fire-and-ash-ending-way-of-water/",
    "thumbnail": "https://static0.polygonimages.com/wordpress/wp-content/uploads/2025/12/death-star-explosion.jpg?w=1600&h=900&fit=crop",
    "pubDate": "2025-12-20T00:00:15+00:00"
  },
  {
    "title": "This Magnetic Puzzle Is A Perfect Last-Minute Stocking Stuffer",
    "description": "TOSY Magnet Pyramid Stone $22.76 (was $30) See at Amazon It's down to the wire, and if you're looking to do some last-minute holiday shopping, we've got a great option for you. For a limited time, TOSY's wildly popular Magnet Pyramid Stone is on sale for just $22.76 (was $30) on Amazon, and is a perfect stocking stuffer to pick up if you're cutting it close with your gift-getting this year. You can create a seemingly endless number of shapes with it (the brand claims \"one billion\" of them), making it an effective and creative fidget toy for both kids and adults. But if you plan to pick one up, do it soon--these are popular on Amazon even at full price, and we expect this limited-time discount will only make them more in-demand. TOSY Magnet Pyramid Stone $22.76 (was $30) The TOSY Magnet Pyramid Stone is a unique STEM and fidget toy that allows you to let your creativity run wild. With it, you can create a vast number of shapes, all while stimulating your brain and calming your anxieties. The Pyramid Stone even comes with a spinning base so you can show off your favorite creations. The toy is extremely popular on Amazon, and it's currently sitting at a limited-time discount of just $22.76 (down from $30). It's the perfect size (and price) for a stocking stuffer gift, so get one on sale while you still can. See at Amazon TOSY also makes a bunch of other great stocking-stuffer-type gifts, from fidget spinners to magnetic puzzle cubes. If the pyramid isn't doing it for you (or you just want more than one gift), maybe one of these other options will. Don't worry, they're also on sale--but only for a limited time: TOSY Magnet Fidget Spinner Glow -- $19 ($24) TOSY Magnet Cube (2x2) -- $8.49 ($10) TOSY Magnet Cube (3x3) -- $29 ($37) TOSY Magnet Cube (4x4) -- $58 ($73) And if you're looking for even more ideas, you should check out Shashibo, another popular brand on Amazon that sells puzzles and fidget toys. The brand's Shape Shifting Box is on a limited-time sale for just $18.19 (was $28), and comes in a bunch of fun themes like SpongeBob, Hello Kitty, Avatar, and more. We have even more in-depth coverage of those Shashibo puzzle boxes here. Continue Reading at GameSpot",
    "link": "https://www.gamespot.com/articles/tosy-magnetic-pyramid-toy-stocking-stuffer-on-sale-for-a-limited-time/1100-6537057/?ftag=CAD-01-10abi2f",
    "thumbnail": "https://www.gamespot.com/a/uploads/screen_kubrick/1864/18647298/4624936-screenshot2025-12-17132740.png",
    "pubDate": "2025-12-19T23:47:00+00:00"
  },
  {
    "title": "Musk's $56 billion Tesla pay package must be restored as court rules cancellation was too extreme",
    "description": "Shareholder Richard J. Tornetta brought the suit, accusing Musk and the Tesla board of a breach of fiduciary duties.",
    "link": "https://www.cnbc.com/2025/12/19/musk-tesla-pay-delaware-supreme-court.html",
    "thumbnail": "https://image.cnbcfm.com/api/v1/image/108168278-17518962972025-06-13t010710z_885255829_rc2gk1a9xltd_rtrmadp_0_space-warfare.jpeg?v=1753301789&w=1920&h=1080",
    "pubDate": "2025-12-19T23:44:32+00:00"
  },
  {
    "title": "The Stray Kids Are Coming To Roblox",
    "description": "The South Korean band Stray Kids is coming to Roblox today, and they'll be unleashing the SKZOO from now and through the weekend while promoting their new album, Do It. As seen in the clips below, Stray Kids' anthropomorphic avatars will be performing their songs in-game as virtual concerts. @robloxkr 스테이 소리 질러! 🗣️ SKZOO가 The Block을 찢으러 옴 🔥 12월 19일~21일 딱 3일만 진행되는 SKZOO쇼 &amp; UGC드롭! 이거 안 보면 진짜 손해임.. 🥺 우리 스테이들은 어떤 스키주 응원하러 갈 거야? 댓글로 알려줘! (내 픽은.. 🤫) #로블록스 #Roblox #Theblock #스트레이키즈 #Straykids ♬ 오리지널 사운드 - Roblox Korea Stray Kids-related items are also hidden in four different Roblox experiences, with two items per game. Players can collect all eight items and bring them to the Block to watch Stray Kids perform and receive additional free items from the band. However, this event will only run until 10 AM PT/1 PM ET on Monday, December 22. In other Roblox-related news, the platform has been banned in Russia and accused of negatively impacting children, and apparently considers the dissemination of LGBTQIA+ content to be a crime. But Russia isn't alone with its accusations that Roblox hasn't done enough to protect kids from child exploitation and grooming. A June 2024 Bloomberg investigation reported that the platform is rampant with predators. More recently, Florida and Texas have sued Roblox over that issue. Continue Reading at GameSpot",
    "link": "https://www.gamespot.com/articles/the-stray-kids-are-coming-to-roblox/1100-6537123/?ftag=CAD-01-10abi2f",
    "thumbnail": "https://www.gamespot.com/a/uploads/screen_kubrick/1837/18375603/4626298-robloxstraykids.jpg",
    "pubDate": "2025-12-19T23:39:00+00:00"
  },
  {
    "title": "Amazon Just Dropped An Exclusive '80s Film 4K Blu-Ray Bundle",
    "description": "Totally Awesome 80s Box Set (4K) $55 See at Amazon It's the most festive time of the year, and if you're looking to do some last-minute gift-shopping, what's better than a bundle of classic '80s action movies? Available exclusively on Amazon, cinephiles--or shoppers looking to get something for their dad--can grab the Totally Awesome 80s 4K Blu-ray bundle. The collection, which launched just a few days ago on December 16, includes 4K Blu-ray editions of five acclaimed 1980s films, plus bonus materials and digital streaming copies of each movie. The Totally Awesome 80s bundle in stock and available for $55 at Amazon. Totally Awesome 80s Box Set (4K) $55 The Totally Awesome 80s Box Set compiles 4K Blu-ray editions of five classic movies released by Paramount Pictures throughout the 1980s: Beverly Hills Cop Ferris Bueller's Day Off Top Gun Trading Places The Untouchables That's a nice selection of some of the decade's most notable action, comedy, and drama flicks. The 4K Blu-ray releases for each film support Dolby Vision, HDR10, and Dolby Atmos audio, and offer their own selection of bonus materials, including new behind-the-scenes documentaries, deleted scenes, music videos, audio commentary tracks, and more. See at Amazon If you've never seen these films, then you've missed out on some of the most influential movies of all time. Top Gun was a blockbuster hit that cemented Tom Cruise's stardom, combining incredible aerial photography and action set against some of the era's chart-topping pop and rock songs. Ferris Bueller's Day Off, one of John Hughes' best films, follows Bueller (Mathew Broderick), his girlfriend Sloane (Mia Sara), and his best bud Cameron (Alan Ruck) as they take an unscheduled break from school. The Untouchables is a ruthless turn-of-the-century gangster movie with an all-star cast, while Trading Places saw John Landis put his own spin on Wall Street, and Beverly Hills Cop is a breakout action-comedy hit that made Eddie Murphy a household name. Lots more vintage movie Blu-rays are currently on sale, if you're hunting for easy stocking-stuffers. James Bond fans can pick up various bundles dedicated to different 007 eras, or for a license to thrill, there's The James Bond Collection of 24-film Blu-rays for only $55 (was $120). Continue Reading at GameSpot",
    "link": "https://www.gamespot.com/articles/amazon-exclusive-totally-awesome-80s-4k-box-set/1100-6536956/?ftag=CAD-01-10abi2f",
    "thumbnail": "https://www.gamespot.com/a/uploads/screen_kubrick/1601/16018044/4622839-awesome-80s-main.jpg",
    "pubDate": "2025-12-19T23:30:00+00:00"
  },
  {
    "title": "Al-Majd Europe: The shell company involved in forced evacuations from Gaza",
    "description": "Al Jazeera investigators uncover a trail of covert flights and shady figures associated with front group Al-Majd Europe.",
    "link": "https://www.aljazeera.com/news/2025/12/19/al-jazeera-investigation-exposes-secret-firm-smuggling-people-out-of-gaza?traffic_source=rss",
    "thumbnail": "https://www.aljazeera.com/wp-content/uploads/2025/11/palestinians_gaza_flight_south_africa-1763150153.jpg?resize=1920%2C1080&quality=80",
    "pubDate": "2025-12-19T23:23:46+00:00"
  },
  {
    "title": "Tenet released 5 years ago, and it's only gotten better with age",
    "description": "Tenet shows that even a Christopher Nolan slight misfire is still a gripping watch, and it's even better the second time around.",
    "link": "https://www.polygon.com/tenet-christopher-nolan-year-anniversary-review/",
    "thumbnail": "https://static0.polygonimages.com/wordpress/wp-content/uploads/chorus/uploads/chorus_asset/file/22238488/tenet_plane_explosion.jpg?w=1600&h=900&fit=crop",
    "pubDate": "2025-12-19T23:22:16+00:00"
  },
  {
    "title": "Avatar: The Last Airbender MTG Beginner Box Is Only $27 At Amazon",
    "description": "MTG Avatar: The Last Airbender Beginner Box $27 (was $35) See at Amazon MTG Avatar: The Last Airbender Play Booster Box $135 (was $209.70) See at Amazon MTG Avatar: The Last Airbender Collector Booster Box $375 (was $455.88) See at Amazon Avatar: The Last Airbender fans and Magic: The Gathering collectors can save big on several products from the franchise's recently released Universes Beyond MTG set. All three booster boxes are steeply discounted. The Play Booster Box, which has 30 packs with 14 cards each, is down to $135 (was $209.70). The Collector Booster Box has received an $80 discount, dropping the price to $375. You'll get 12 Collector Booster Packs with 15 cards each. Individual Collector Boosters are selling for $49, but buying in bulk lowers the cost of each pack to $31.25. The Jumpstart Booster Box, which has 24 packs with 20 cards each, is available for $120 (was $167.76). The other notable Avatar: The Last Airbender MTG deal is the Beginner Box for $27 (was $35). The Beginner Box comes with 200 cards split into 10 decks for Jumpstart mode and everything you need to play. Continue Reading at GameSpot",
    "link": "https://www.gamespot.com/articles/magic-the-gathering-avatar-the-last-airbender-collector-restock-release-day-guide/1100-6533927/?ftag=CAD-01-10abi2f",
    "thumbnail": "https://www.gamespot.com/a/uploads/screen_kubrick/1595/15950357/4610873-avatarmtg2copy.jpg",
    "pubDate": "2025-12-19T23:22:00+00:00"
  },
  {
    "title": "Five key takeaways from US State Secretary Rubio’s year-end briefing",
    "description": "Top US diplomat Marco Rubio reiterates hard line against Venezuela's Maduro, says Ukraine conflict is 'not our war'.",
    "link": "https://www.aljazeera.com/news/2025/12/19/five-key-takeaways-from-us-secretary-of-state-rubios-year-end-briefing?traffic_source=rss",
    "thumbnail": "https://www.aljazeera.com/wp-content/uploads/2025/12/2025-12-19T164045Z_1383729569_RC2SJIAA3018_RTRMADP_3_USA-DIPLOMACY-RUBIO-1766176808.jpg?resize=1920%2C1440",
    "pubDate": "2025-12-19T23:17:59+00:00"
  },
  {
    "title": "Three Days of the Condor at 50: Robert Redford's definitive spy thriller",
    "description": "Robert Redford made a number of thrillers, but this '70s classic is a major part of the '70s paranoia boom",
    "link": "https://www.polygon.com/three-days-of-the-condor-50-robert-redford/",
    "thumbnail": "https://static0.polygonimages.com/wordpress/wp-content/uploads/2025/09/condor-4.jpg?w=1600&h=900&fit=crop",
    "pubDate": "2025-12-19T23:13:15+00:00"
  },
  {
    "title": "Former Trump advisor Dina Powell McCormick leaves Meta board after eight-month stint",
    "description": "Dina Powell McCormick, who was a member of President Donald Trump's first administration, has resigned from Meta's board of directors.",
    "link": "https://www.cnbc.com/2025/12/19/former-trump-advisor-dina-powell-mccormick-leaves-meta-board.html",
    "thumbnail": "https://image.cnbcfm.com/api/v1/image/108197774-17576213652025-09-11t200415z_955202248_rc2vpgaeanxv_rtrmadp_0_meta-results.jpeg?v=1757621403&w=1920&h=1080",
    "pubDate": "2025-12-19T23:09:46+00:00"
  },
  {
    "title": "Timothée Chalamet teams up with EsDeeKid to quash alter-ego rumours",
    "description": "Speculation has run riot that the US actor had been leading a double life as the masked rapper.",
    "link": "https://www.bbc.com/news/articles/c79x4yqx0ngo?at_medium=RSS&at_campaign=rss",
    "thumbnail": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/5042/live/516821c0-dd26-11f0-81f3-8f8de1148c42.jpg",
    "pubDate": "2025-12-19T23:09:34+00:00"
  },
  {
    "title": "The Running Man, One Battle After Another, and the best movies on streaming this week",
    "description": "Queens of the Dead shambles onto Shudder, Him is playing on Peacock, and Now You See Me: Now You Don’t is available to rent",
    "link": "https://www.polygon.com/new-movies-on-streaming-the-running-man-now-you-see-me-now-you-dont/",
    "thumbnail": "https://static0.polygonimages.com/wordpress/wp-content/uploads/2025/12/mcdonba_wb031.jpg?w=1600&h=900&fit=crop",
    "pubDate": "2025-12-19T23:00:16+00:00"
  },
  {
    "title": "Google's boomerang year: 20% of AI software engineers hired in 2025 were ex-employees",
    "description": "As competition heats up for AI talent, Google turned to hiring more so-called boomerang employees in 2025.",
    "link": "https://www.cnbc.com/2025/12/19/google-boomerang-year-20percent-ai-software-devs-hired-2025-ex-employees.html",
    "thumbnail": "https://image.cnbcfm.com/api/v1/image/108198795-1757946595578-gettyimages-2218001070-BLOOMBERG_TECH.jpeg?v=1765922244&w=1920&h=1080",
    "pubDate": "2025-12-19T22:52:52+00:00"
  },
  {
    "title": "US Clarity Act unlikely to be ‘world-shaking’ for Bitcoin’s price: Brandt",
    "description": "Veteran trader Peter Brandt said that the US Clarity Act will be a positive for the industry, but probably won’t “redefine” Bitcoin’s price.",
    "link": "https://cointelegraph.com/news/us-clarity-act-bitcoin-price-action-peter-brandt-crypto-trader?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
    "thumbnail": "https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=1200/https://s3.cointelegraph.com/uploads/2025-12/019b387d-4c34-7bf5-9e9d-ee83783d3d12.jpg",
    "pubDate": "2025-12-19T22:36:05+00:00"
  },
  {
    "title": "Inside the dealmaking that pushed Trump to reclassify pot, expand access",
    "description": "Trump’s pot executive order follows a yearlong industry push blending lobbying, donations and insider access, opening the door to a Medicare CBD pilot.",
    "link": "https://www.cnbc.com/2025/12/19/trump-pot-executive-order-medicare-cbd-lobbying-donors.html",
    "thumbnail": "https://image.cnbcfm.com/api/v1/image/108243799-17660865912025-12-18t193245z_923114099_rc27jiai4chj_rtrmadp_0_usa-trump.jpeg?v=1766086613&w=1920&h=1080",
    "pubDate": "2025-12-19T22:29:34+00:00"
  },
  {
    "title": "Appalachia interactive map in Fallout 76",
    "description": "Our Fallout 76 interactive map shows you where to find collectibles, crafting resources, and more across Appalachia",
    "link": "https://www.polygon.com/map/fallout-76-interactive-map-appalachia/",
    "thumbnail": "https://static0.polygonimages.com/wordpress/wp-content/uploads/2025/12/untitled-design.jpg?w=1600&h=900&fit=crop",
    "pubDate": "2025-12-19T22:22:58+00:00"
  },
  {
    "title": "Musk wins US appeal to restore 2018 Tesla pay package",
    "description": "The Delaware Supreme Court rules in favour of Musk and his $56bn compensation.",
    "link": "https://www.aljazeera.com/economy/2025/12/19/musk-wins-us-appeal-to-restore-2018-tesla-pay-package?traffic_source=rss",
    "thumbnail": "https://www.aljazeera.com/wp-content/uploads/2025/12/2025-11-19T184326Z_113400314_RC2SZHAFZ1AP_RTRMADP_3_USA-SAUDI-FORUM-1766181404.jpg?resize=1633%2C1080",
    "pubDate": "2025-12-19T22:18:37+00:00"
  },
  {
    "title": "Nine of the largest pharma companies ink deals with Trump to lower drug prices",
    "description": "President Donald Trump has pushed to lower drug prices for Americans, which are on average nearly three times higher than overseas.",
    "link": "https://www.cnbc.com/2025/12/19/nine-pharma-companies-ink-deals-with-trump-to-lower-drug-prices.html",
    "thumbnail": "https://image.cnbcfm.com/api/v1/image/108244349-1766174021472-gettyimages-2252755410-aw1a5713_g3etktlm.jpeg?v=1766174050&w=1920&h=1080",
    "pubDate": "2025-12-19T22:14:26+00:00"
  },
  {
    "title": "Pokemon TCG Mega Charizard Ultra-Premium Collection Drops To $140 At Amazon",
    "description": "Pokemon TCG: Mega Charizard X ex Ultra-Premium Collection $140 (was $250) See at Amazon Mega Venusaur ex Premium Collection $74.89 See at Amazon Amazon has dropped the price of the Pokemon Trading Card Game's latest Ultra-Premium Collection. After initially restocking the Mega Charizard X ex Ultra-Premium Collection with a $165 asking price, Amazon is now selling the large collection of boosters and promo cards for $140. The Mega Charizard X ex Ultra-Premium Collection had sold for as high as $250 before launch and was $211 on launch day (November 14). It launched alongside Pokemon TCG's latest expansion set, Mega Evolution - Phantasmal Flames. Pokemon TCG collectors can also pick up the newly released Mega Venusaur ex Premium Collection for $74.89 at Amazon. Released earlier this month, the latest Mega Pokemon Premium Collection has been difficult to find in stock, so we wouldn't be surprised if it sold out again soon. Speaking of Premium Collections, the Lugia ex &amp; Latias ex Premium Collection is back in stock for $100. Amazon also has a brand-new Pokemon TCG listing that has yet to be noticed by resellers. The Holiday 2025 Poke Ball Tins are available to order for $30 each. Continue Reading at GameSpot",
    "link": "https://www.gamespot.com/articles/pokemon-tcg-mega-venusaur-premium-collection-charizard-x-ultra-premium-collection-amazon-restock/1100-6536074/?ftag=CAD-01-10abi2f",
    "thumbnail": "https://www.gamespot.com/a/uploads/screen_kubrick/1595/15950357/4625283-pokemoncards.jpg",
    "pubDate": "2025-12-19T22:05:00+00:00"
  },
  {
    "title": "Here’s what happened in crypto today",
    "description": "Need to know what happened in crypto today? Here is the latest news on daily trends and events impacting Bitcoin price, blockchain, DeFi, NFTs, Web3 and crypto regulation.",
    "link": "https://cointelegraph.com/news/what-happened-in-crypto-today?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
    "thumbnail": "https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=1200/https://s3.cointelegraph.com/uploads/2025-06/01979423-ef8e-7c60-b937-b9ddf75fe8ad",
    "pubDate": "2025-12-19T22:03:44+00:00"
  },
  {
    "title": "LIVE: Jake Paul vs Anthony Joshua – heavyweight boxing fight",
    "description": "Follow our live buildup and coverage ahead of our text commentary stream of the Paul-Joshua heavyweight fight in Miami.",
    "link": "https://www.aljazeera.com/sports/liveblog/2025/12/19/live-jake-paul-vs-anthony-joshua-heavyweight-boxing-fight?traffic_source=rss",
    "thumbnail": "https://www.aljazeera.com/wp-content/uploads/2025/12/2025-12-20T044343Z_656311256_UP1ELCK0D4T0O_RTRMADP_3_BOXING-HEAVYWEIGHT-PAUL-JOSHUA-1766205904.jpg?resize=1920%2C1440",
    "pubDate": "2025-12-19T22:01:39+00:00"
  },
  {
    "title": "Palestinians tell BBC they were sexually abused in Israeli prisons",
    "description": "Two men say they experienced the kind of abuse highlighted in recent reports on Israel's treatment of prisoners, which Israel denies.",
    "link": "https://www.bbc.com/news/articles/c8dy8r7lq0go?at_medium=RSS&at_campaign=rss",
    "thumbnail": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/8db5/live/070d9300-dcca-11f0-bb5b-8b829d936cf4.jpg",
    "pubDate": "2025-12-19T22:01:20+00:00"
  },
  {
    "title": "Amazon Lightning Deal: Donkey Kong Bananza Amiibo Gets Big Price Cut",
    "description": "Donkey Kong and Pauline Amiibo $20 (was $30) Get deal at Amazon Donkey Kong fans can grab the Donkey Kong Bananza Amiibo for $20 (was $30) at Amazon right now. This is a Lightning Deal with limited quantities. At the time of writing, over 20% of the available Donkey Kong and Pauline Amiibo figures have been claimed. Amazon also has deals on two Amiibo figures that launched alongside the Nintendo Switch 2: Yunobo from The Legend of Zelda and Jamie from Street Fighter 6 are available for $8 each. Meanwhile, GameStop has all seven Switch 2 Amiibo launch figures for $6 each. The Legend of Zelda: Yunobo Amiibo -- $8 ($30) Street Fighter 6: Jamie Amiibo -- $8 ($40) Donkey Kong Bananza: Donkey Kong and Pauline -- $20 ($30) Donkey Kong and Pauline Amiibo $20 (was $30) Based on DK's wide smile, we imagine he's punching his way to a Banandium Gem. He's also moving fast because Pauline's legs are dangling in the air. The uneven ground beneath DK's feet aligns with rocky terrain found in Ingot Isle, Lagoon Layer, and other locales from the game. As for its functionality in the game, scanning the Donkey Kong and Pauline Amiibo grants two main perks. You can unlock Pauline's Diva Dress a lot earlier in your adventure with the Amiibo. The Diva Dress doubles the likelihood of enemies dropping music discs. To unlock the Diva Dress, you need to talk to the NPC shaped like the Amiibo in the Resort Layer. The NPC will ask you to show them the Amiibo to claim your reward. Without the Amiibo, this particular outfit is locked behind post-game challenges. Scanning the Bananza Amiibo also spawns gold KONG letters that can be smashed to refill Bananergy. KONG tiles can also be spawned by scanning older Donkey Kong Amiibo figures. Get deal at Amazon Nintendo Switch 2 Amiibo Deals at GameStop As mentioned, GameStop is selling all four The Legend of Zelda Switch 2 Amiibo, the three Street Fighter 6 Amiibo, and the Street Fighter 6 Amiibo Card Starter Set for only $6 each as part of its last-minute holiday sale. The Legend of Zelda: Tears of the Kingdom Amiibo Tulin -- $6 ($30) Sidon -- $6 ($30) Yunobo -- $6 ($30) Riju -- $6 ($30) Street Fighter 6 Amiibo Jamie -- $6 ($40) Luke -- $6 ($40) Kimberly -- $6 ($40) Street Fighter 6 Amiibo Card Starter Set -- $6 ($40) All Donkey Kong Amiibo Figures King K. Rool Amiibo (Donkey Kong) $18 (was $20) Preorder at Best Buy Most Amiibo figures featuring Donkey Kong characters are out of print, but King K. Rool received a Best Buy-exclusive reprint in September. Normally $20, Best Buy is selling the figure for $18. King K. Rool is the priciest preowned Amiibo in the series sold at GameStop, so fans who are interested in adding King K. Rool to their collection should snag one from Best Buy sooner rather than later. GameStop has two older Donkey Kong Amiibo for $18 each and two Diddy Kong Amiibo for $20 each. Amazon also has the Smash Bros. Series Donkey Kong Amiibo for $20, which would be its MSRP if reprinted today. Continue Reading at GameSpot",
    "link": "https://www.gamespot.com/articles/donkey-kong-bananza-amiibo-nintendo-switch-2-donkey-kong-and-pauline-deal/1100-6537121/?ftag=CAD-01-10abi2f",
    "thumbnail": "https://www.gamespot.com/a/uploads/screen_kubrick/1595/15950357/4626297-dkbamiibo.jpg",
    "pubDate": "2025-12-19T21:43:00+00:00"
  },
  {
    "title": "The best Xbox Game Pass games to play this weekend (Dec. 19-21 2025)",
    "description": "We have a variety of Xbox Game Pass recommendations to save you from endlessly searching for something new to play.",
    "link": "https://www.polygon.com/game-pass-games-rec-weekend-dec-19-2025/",
    "thumbnail": "https://static0.polygonimages.com/wordpress/wp-content/uploads/2025/02/Avowed_GT_KAI_2.png?w=1600&h=900&fit=crop",
    "pubDate": "2025-12-19T21:30:16+00:00"
  },
  {
    "title": "SEC confirms years-long director bans for former Alameda, FTX executives",
    "description": "In the latest update on the FTX saga, the SEC confirmed Caroline Ellison had consented to a officer-and-director bar, preventing her from leading any companies for 10 years.",
    "link": "https://cointelegraph.com/news/sec-confirms-years-long-director-bans-for-former-alameda-ftx-executives?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
    "thumbnail": "https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=1200/https://s3.cointelegraph.com/uploads/2025-12/019b3822-2572-75c7-81d5-e06402190b3a.jpg",
    "pubDate": "2025-12-19T21:30:00+00:00"
  },
  {
    "title": "Crypto's closest ally in Congress, Sen. Lummis, is retiring next year",
    "description": "The most tireless advocate of digital assets issues in the U.S. Senate said she's grown too tired to keep at it, leaving her Republican seat in play next year.",
    "link": "https://www.coindesk.com/policy/2025/12/19/crypto-s-closest-ally-in-congress-sen-lummis-is-retiring-next-year",
    "thumbnail": "https://cdn.sanity.io/images/s3y3vcno/production/1d2c6421ee40e335ccbb28a41fd6179a6d7dc9f8-1920x1080.jpg?auto=format",
    "pubDate": "2025-12-19T21:25:31+00:00"
  },
  {
    "title": "Pro-crypto US Senator Lummis won’t seek reelection in 2026",
    "description": "Cynthia Lummis is one of the key Republicans responsible for pushing members of Congress to pass a crypto market structure bill under consideration in the Senate.",
    "link": "https://cointelegraph.com/news/cynthia-lummis-not-seeking-reelection-senate?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
    "thumbnail": "https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=1200/https://s3.cointelegraph.com/uploads/2025-12/019b3863-f480-74ce-b7ca-b43f53957369.jpg",
    "pubDate": "2025-12-19T21:17:38+00:00"
  },
  {
    "title": "How to evolve Galarian Farfetch'd in Pokémon Legends: Z-A",
    "description": "To evolve Galarian Farfetch'd into Sirfetch'd, it'll need to land some heavy blows first. Our guide explains how to evolve it in Pokémon Legends: Z-A.",
    "link": "https://www.polygon.com/pokemon-legends-za-plza-evolve-galarian-farfetchd-sirfetchd-requirements/",
    "thumbnail": "https://static0.polygonimages.com/wordpress/wp-content/uploads/2025/12/jlee_251219_1001_lza_sirfetchd1.jpg?w=1600&h=900&fit=crop",
    "pubDate": "2025-12-19T21:16:27+00:00"
  },
  {
    "title": "Blockchain Association says no to expanding stablecoin yield prohibition",
    "description": "Expanding the stablecoin yield prohibition to include the application layer is an anti-competitive practice, industry advocacy groups say.",
    "link": "https://cointelegraph.com/news/blockchain-association-no-expanding-stablecoin-yield-prohibition?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
    "thumbnail": "https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=1200/https://s3.cointelegraph.com/uploads/2025-12/019b3824-bd88-7ad6-9b6a-5326363b372a.jpg",
    "pubDate": "2025-12-19T21:04:01+00:00"
  },
  {
    "title": "Oracle stock jumps 7% as cloud provider joins investor group to run TikTok's U.S. business",
    "description": "The new joint venture will prevent TikTok from shutting down in the U.S. due to national security concerns.",
    "link": "https://www.cnbc.com/2025/12/19/oracle-stock-tiktok-us-trump-china.html",
    "thumbnail": "https://image.cnbcfm.com/api/v1/image/108079907-1735227329229-108079907-1735218144667-gettyimages-1052778952-ORACLE_OPENWORLD_2018.jpg?v=1765825724&w=1920&h=1080",
    "pubDate": "2025-12-19T21:00:27+00:00"
  },
  {
    "title": "Crypto Biz: Bank stablecoins get a rulebook; Bitcoin gets a land grab",
    "description": "FDIC reveals a path for bank-issued stablecoins under the GENIUS Act as corporate BTC treasuries expand, Anchorage buys Securitize’s RIA arm and Bhutan taps reserves.",
    "link": "https://cointelegraph.com/news/fdic-genius-act-bank-stablecoins-crypto-biz-corporate-bitcoin-anchorage-securitize-bhutan?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
    "thumbnail": "https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=1200/https://s3.cointelegraph.com/uploads/2025-12/019b3789-7009-7b8a-9981-7e27505768cb.jpg",
    "pubDate": "2025-12-19T21:00:00+00:00"
  },
  {
    "title": "Galaxy predicts stablecoins will overtake ACH transaction volume in 2026",
    "description": "In its annual predictions report, Galaxy’s analysts said onchain dollar transfers could process more volume next year than the US bank system that handles payroll and bill payments.",
    "link": "https://cointelegraph.com/news/galaxy-stablecoins-ach-transaction-volume-2026?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
    "thumbnail": "https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=1200/https://s3.cointelegraph.com/uploads/2025-12/019b3802-7dc2-771a-8f24-0a98e59134ff.jpg",
    "pubDate": "2025-12-19T20:46:46+00:00"
  },
  {
    "title": "Nintendo Might Change The Switch 2 Feature Players Complain About Most",
    "description": "A sizeable portion of Nintendo Switch 2 players have been very vocal about their opposition to Game-Key Cards that allow players to digitally download a game rather than including it on a cartridge. But there's at least one publisher that's taken this criticism to heart by switching gears from This may be a welcome development for Nintendo Switch 2 players who hate Game-Key Cards back to cartridges, thanks to the new size options offered by Nintendo. Inin Games shared the news that its upcoming US and European run of R-Type Dimensions III is going to be released on a physical cartridge instead of a Game-Key Cards. The company also cited a recalculation of the production prices as a reason for the change. Apparently it's cheaper to release a game on Game-Key Cards, but the rumored measures taken by Nintendo apparently lowered the price for cartridges as well. Game-Key Cards have been in physical Nintendo Switch 2 game boxes, but those cards don't actually include any game data. Instead, the Game-Key Cards allow the console to download the game from the internet. Continue Reading at GameSpot",
    "link": "https://www.gamespot.com/articles/nintendo-might-change-the-switch-2-feature-players-complain-about-most/1100-6537120/?ftag=CAD-01-10abi2f",
    "thumbnail": "https://www.gamespot.com/a/uploads/screen_kubrick/1837/18375603/4626286-nintendoswitch2logo.jpg",
    "pubDate": "2025-12-19T20:40:00+00:00"
  },
  {
    "title": "DraftKings eyes crypto offerings as it expands into prediction markets",
    "description": "DraftKings launches a prediction markets app in 38 states, setting the stage for future crypto-linked contracts under a regulated US derivatives framework.",
    "link": "https://cointelegraph.com/news/draftkings-prediction-markets-app-crypto-contracts-us?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
    "thumbnail": "https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=1200/https://s3.cointelegraph.com/uploads/2025-12/019b37a7-58b5-7a27-b850-a99c7509bd1b.jpg",
    "pubDate": "2025-12-19T20:27:59+00:00"
  },
  {
    "title": "That Time I Got Reincarnated as a Slime season 4 gets a huge update",
    "description": "Season 4 of That Time I Got Reincarnated as a Slime begins in April 2026 and will air with breaks over the course of 15 months",
    "link": "https://www.polygon.com/that-time-i-got-reincarnated-as-a-slime-season-4-release-date-update/",
    "thumbnail": "https://static0.polygonimages.com/wordpress/wp-content/uploads/2025/12/aaaabdvujipsybjot6u4pfg4ldxo4h2sbth_bhgttkalj7rgzo2wqjndjg1iebccfkr2qq4kpxeulcz1qq2k-ijc-n_5t_fnn4rf7pnb-1.jpg?w=1600&h=900&fit=crop",
    "pubDate": "2025-12-19T20:22:34+00:00"
  },
  {
    "title": "David Walliams denies inappropriate behaviour after publisher drops him",
    "description": "Walliams is one of the UK's most successful children's authors, having sold more than 60 million books.",
    "link": "https://www.bbc.com/news/articles/cev8p7d0gmgo?at_medium=RSS&at_campaign=rss",
    "thumbnail": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/4e45/live/069ead50-dd06-11f0-aae2-2191c0e48a3b.jpg",
    "pubDate": "2025-12-19T20:19:00+00:00"
  },
  {
    "title": "Avatar has eclipsed Star Wars as a family saga",
    "description": "With the Avatar trilogy's examination of Jake Sully and his kids, James Cameron has one-upped George Lucas' Skywalker Saga.",
    "link": "https://www.polygon.com/avatar-vs-star-wars-family-themes-luke-darth-vader-jake-sully/",
    "thumbnail": "https://static0.polygonimages.com/wordpress/wp-content/uploads/2025/12/avatar-family.jpg?w=1600&h=900&fit=crop",
    "pubDate": "2025-12-19T19:33:39+00:00"
  },
  {
    "title": "Juced Review: I Tried Preworkout Gummies to See If They'd Help My Energy",
    "description": "Can a gummy bear help my fitness? I asked a sports' nutrition expert and ate them for a month.",
    "link": "https://www.bonappetit.com/story/juced-review-preworkout-gummies",
    "thumbnail": "https://assets.bonappetit.com/photos/6945a11a61211aef0992b57c/master/pass/12.18_BA_Lede%20Image%20Ju%CC%88ced%20Review_v2.jpg",
    "pubDate": "2025-12-19T19:16:18+00:00"
  },
  {
    "title": "Australia was seen as a world leader in gun control - Bondi has exposed a more complicated reality",
    "description": "It introduced stricter gun laws after the 1996 Port Arthur massacre, but some say they now need to be tightened further.",
    "link": "https://www.bbc.com/news/articles/cqxql12317qo?at_medium=RSS&at_campaign=rss",
    "thumbnail": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/5b67/live/0972be10-dcc8-11f0-aae2-2191c0e48a3b.jpg",
    "pubDate": "2025-12-19T19:04:13+00:00"
  },
  {
    "title": "Trump suspends U.S. green card lottery after Brown University shooting",
    "description": "USCIS is pausing the Diversity Immigrant Visa Program after the fatal Brown University shooting last week, Homeland Security Secretary Kristi Noem said.",
    "link": "https://www.cnbc.com/2025/12/19/us-green-card-lottery-suspended-after-brown-shooting-officials-say.html",
    "thumbnail": "https://image.cnbcfm.com/api/v1/image/108240689-17654720522025-12-11t163917z_391446468_rc2geiawcjv6_rtrmadp_0_usa-congress-threats.jpeg?v=1765472080&w=1920&h=1080",
    "pubDate": "2025-12-19T18:54:13+00:00"
  },
  {
    "title": "SBF's cohorts at FTX take last SEC hit, Ellison banned from company roles for decade",
    "description": "Three of Sam Bankman-Fried's top lieutenants atop the former FTX empire — Caroline Ellison, Gary Wang and Nishad Singh — agreed to consent judgments.",
    "link": "https://www.coindesk.com/policy/2025/12/19/sbf-s-cohorts-at-ftx-take-last-sec-hit-ellison-banned-from-company-roles-for-decade",
    "thumbnail": "https://cdn.sanity.io/images/s3y3vcno/production/81d7fc8b2ff9c46df1d2f6c675eb8025b295bb35-1920x1080.jpg?auto=format",
    "pubDate": "2025-12-19T18:09:08+00:00"
  },
  {
    "title": "Pluribus episode 8 answered the series' biggest question. Vince Gilligan explains.",
    "description": "What does the hivemind want? That's been the big question of Vince Gilligan's Pluribus. Episode 8, \"Charm Offensive,\" undersells the answer.",
    "link": "https://www.polygon.com/pluribus-episode-8-recap-reveal-vince-gilligan-interview/",
    "thumbnail": "https://static0.polygonimages.com/wordpress/wp-content/uploads/2025/12/main.jpg?w=1600&h=900&fit=crop",
    "pubDate": "2025-12-19T18:00:29+00:00"
  },
  {
    "title": "Homemade Udon Noodles",
    "description": "The secret to success? Kneading with your feet.",
    "link": "https://www.bonappetit.com/recipe/homemade-udon-noodles",
    "thumbnail": "https://assets.bonappetit.com/photos/644002939ccf557ba729da7e/master/pass/Noodle_Type_Udon_Finished_Select_COMP_RET.jpg",
    "pubDate": "2025-12-19T17:15:49+00:00"
  },
  {
    "title": "Family of stabbed girl say 'our hearts are broken'",
    "description": "The nine-year-old's family say she was \"the most beautiful little soul\" who was \"full of light\".",
    "link": "https://www.bbc.com/news/articles/c33m2j4nnkro?at_medium=RSS&at_campaign=rss",
    "thumbnail": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/ae48/live/e86a66c0-db71-11f0-9817-e5239190d76e.jpg",
    "pubDate": "2025-12-19T17:07:22+00:00"
  },
  {
    "title": "Harry and Meghan embrace their children in Christmas message",
    "description": "The Duke and Duchess of Sussex have also released their official Christmas card and renamed their charity.",
    "link": "https://www.bbc.com/news/articles/c865dvn2l92o?at_medium=RSS&at_campaign=rss",
    "thumbnail": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/ebf3/live/35c620b0-dd04-11f0-b67b-690eb873de1b.jpg",
    "pubDate": "2025-12-19T16:54:45+00:00"
  },
  {
    "title": "Bitcoin gets 'base case' price target of $143,000 at Citigroup",
    "description": "The Wall Street bank said its bitcoin forecast relies on further crypto ETF inflows and a continued rally in traditional equity markets.",
    "link": "https://www.coindesk.com/markets/2025/12/19/bitcoin-earns-base-case-target-of-usd143-000-at-citigroup",
    "thumbnail": "https://cdn.sanity.io/images/s3y3vcno/production/ce6e5878a3bba05bcb92f58c5d32dad187180ea3-1920x1080.jpg?auto=format",
    "pubDate": "2025-12-19T16:53:50+00:00"
  },
  {
    "title": "Bitcoin battles $89,000 price ceiling as bulls try to break U.S. sell pattern",
    "description": "Bitcoin bulls are putting up a fight on Friday to break this week's choppy action that has capped all advances at around $90,000.",
    "link": "https://www.coindesk.com/markets/2025/12/19/can-bitcoin-break-the-curse-u-s-trading-hours-selloffs",
    "thumbnail": "https://cdn.sanity.io/images/s3y3vcno/production/80e953caf636e7b410fd884d553b63c932aa9a74-1994x1182.png?auto=format&w=960&h=540&crop=focalpoint&fit=clip&q=75&fm=jpg",
    "pubDate": "2025-12-19T16:52:11+00:00"
  },
  {
    "title": "Foundation behind restaking protocol EigenLayer plans bigger rewards for active users",
    "description": "An Incentives Committee would direct programmatic token emissions, focusing allocations on participants that secure AVSs and contribute to the EigenCloud ecosystem.",
    "link": "https://www.coindesk.com/business/2025/12/19/foundation-behind-restaking-protocol-eigenlayer-plans-bigger-rewards-for-active-users",
    "thumbnail": "https://cdn.sanity.io/images/s3y3vcno/production/19afae7920acbb7df56e9f9ed2e8c0b4a88fb663-1920x1080.jpg?auto=format&w=960&h=540&crop=focalpoint&fit=clip&q=75&fm=jpg",
    "pubDate": "2025-12-19T16:43:00+00:00"
  },
  {
    "title": "Polkadot's DOT holds steady with token unchanged over 24 hours",
    "description": "DOT has support in the $1.72-$1.74 zone.",
    "link": "https://www.coindesk.com/markets/2025/12/19/polkadot-s-dot-holds-steady-with-token-unchanged-over-24-hours",
    "thumbnail": "https://cdn.sanity.io/images/s3y3vcno/production/b9a671f507eb3448144e271b513fa65e116c4085-700x430.png?auto=format&w=960&h=540&crop=focalpoint&fit=clip&q=75&fm=jpg",
    "pubDate": "2025-12-19T16:40:19+00:00"
  },
  {
    "title": "Federal Reserve moves toward narrower, crypto-driven take on master accounts",
    "description": "The U.S. central bank has been mulling the idea of a \"skinny\" version of master accounts for firms that want payments access without the deeper Fed demands.",
    "link": "https://www.coindesk.com/policy/2025/12/19/federal-reserve-moves-toward-narrower-crypto-driven-take-on-master-accounts",
    "thumbnail": "https://cdn.sanity.io/images/s3y3vcno/production/8be12e331b4bfcb137d46b957c71d318d84e8c18-1920x1080.jpg?auto=format",
    "pubDate": "2025-12-19T16:31:37+00:00"
  },
  {
    "title": "Citi is still a believer in crypto stocks despite bitcoin being rocked to end the year",
    "description": "Circle remains the bank's top pick in the sector, with Bullish and Coinbase following.",
    "link": "https://www.coindesk.com/markets/2025/12/19/citi-trims-crypto-stock-price-targets-after-bitcoin-s-disappointing-q4",
    "thumbnail": "https://cdn.sanity.io/images/s3y3vcno/production/462aa44fc614504ef506e076687060227de07a47-1919x1080.jpg?auto=format&w=960&h=540&crop=focalpoint&fit=clip&q=75&fm=jpg",
    "pubDate": "2025-12-19T16:14:39+00:00"
  },
  {
    "title": "NY Fed President Williams says some 'technical factors' distorted November's CPI reading downward",
    "description": "Williams said \"technical factors\" likely distorted November's inflation data, pushing the headline reading lower than it otherwise would have been.",
    "link": "https://www.cnbc.com/2025/12/19/ny-fed-president-williams-says-some-technical-factors-distorted-novembers-cpi-reading-downward.html",
    "thumbnail": "https://image.cnbcfm.com/api/v1/image/108229871-1763730470574-gettyimages-2233025865-WILLIAMS_ECNY.jpeg?v=1766151272&w=1920&h=1080",
    "pubDate": "2025-12-19T15:48:35+00:00"
  },
  {
    "title": "The world of boxing gives predictions for Paul v Joshua fight",
    "description": "Natasha Jonas and more are backing Anthony Joshua to deliver against Jake Paul at Kaseya Center in Miami.",
    "link": "https://www.bbc.com/sport/boxing/articles/cvgrejem99zo?at_medium=RSS&at_campaign=rss",
    "thumbnail": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/b6d9/live/afaa2bb0-dd2c-11f0-aae2-2191c0e48a3b.jpg",
    "pubDate": "2025-12-19T15:38:25+00:00"
  },
  {
    "title": "Most Influential 2025's Honorable Mentions",
    "description": "The crypto industry is ever-growing and ever-changing. It would be difficult to summarize it in 50 names. Here are a few final individuals and entities we wanted to make note of this year.",
    "link": "https://www.coindesk.com/business/2025/12/19/most-influential-2025-s-honorable-mentions",
    "thumbnail": "https://cdn.sanity.io/images/s3y3vcno/production/4c67b12461fc5fbb1aa45c6b08856ef6d9a8fd00-1920x1080.jpg?auto=format&w=960&h=540&crop=focalpoint&fit=clip&q=75&fm=jpg",
    "pubDate": "2025-12-19T15:11:03+00:00"
  },
  {
    "title": "Most Influential: Hsiao-Wei Wang and Tomasz K. Stańczak",
    "description": "The Ethereum Foundation’s new leaders hope to bring in a new era for the second-largest cryptocurrency.",
    "link": "https://www.coindesk.com/tech/2025/12/19/most-influential-hsiao-wei-wang-and-tomasz-k-stanczak",
    "thumbnail": "https://cdn.sanity.io/images/s3y3vcno/production/2c4d60ec828a139fe53d6406573b644499f0c413-1920x1080.png?auto=format&w=960&h=540&crop=focalpoint&fit=clip&q=75&fm=jpg",
    "pubDate": "2025-12-19T15:00:00+00:00"
  },
  {
    "title": "Could a High-Protein Meal Delivery Service Fuel My Gym Rat Lifestyle?",
    "description": "I tried a prepared meal delivery service, Factor, to find out.",
    "link": "https://www.bonappetit.com/story/factor-high-protein-meal-delivery-service-review",
    "thumbnail": "https://assets.bonappetit.com/photos/694492b18c460e7a1ee42282/master/pass/12.17_BA_Factor%20high%20protein%20meals%20review%20lede_v3%20(1).jpg",
    "pubDate": "2025-12-19T13:00:00+00:00"
  },
  {
    "title": "CNBC's Official College Sports Valuations 2025: Top 75 athletic programs",
    "description": "The programs are worth a combined $51.22 billion, 13% more than the top 75 in last year's rankings.",
    "link": "https://www.cnbc.com/2025/12/19/cnbc-official-college-sports-valuations-2025-top-75-athletic-programs.html",
    "thumbnail": "https://image.cnbcfm.com/api/v1/image/108242577-1765913519178-gettyimages-2248959681-as3_3187_kjhzessd.jpeg?v=1765913614&w=1920&h=1080",
    "pubDate": "2025-12-19T12:07:08+00:00"
  },
  {
    "title": "Crispy Quesadillas and More Recipes We Made This Week",
    "description": "Like a festive red cabbage salad and mini frittatas.",
    "link": "https://www.bonappetit.com/story/recipes-bon-appetit-editors-cooked-december-2025",
    "thumbnail": "https://assets.bonappetit.com/photos/67b794fd973c7ba8366dd18d/master/pass/chicken-quesadilla_RECIPE_V2_021125_0821_VOG_final.jpg",
    "pubDate": "2025-12-19T11:00:00+00:00"
  },
  {
    "title": "Is EveryPlate Worth It? How the Meal Kit's Cost Compares to Grocery Shopping",
    "description": "As a new mom, the math only tells part of the story.",
    "link": "https://www.bonappetit.com/story/everyplate-worth-it-cost",
    "thumbnail": "https://assets.bonappetit.com/photos/694478035a9e3a81be7c3da4/master/pass/12.16_BA_Is%20It%20Worth%20It_%20Comparing%20EveryPlate%20to%20the%20Cost%20of%20Grocery%20Shopping%20lede_v3.jpg",
    "pubDate": "2025-12-18T21:55:54+00:00"
  },
  {
    "title": "Stock Market Today: Indexes Keep Gains; Western Digital On A Streak As Carvana, Nuke Play Set Up (Live Coverage)",
    "description": "",
    "link": "https://www.investors.com/market-trend/stock-market-today/dow-jones-sp500-nasdaq-cpi-inflation-data-micron-mu-stock/?src=A00220&yptr=yahoo",
    "thumbnail": "",
    "pubDate": "2025-12-18T21:22:13+00:00"
  },
  {
    "title": "DJT Pivots to Nuclear Fusion, With a Bitcoin-Powered Balance Sheet",
    "description": "",
    "link": "https://www.barrons.com/articles/djt-stock-price-tae-technologies-merger-b050697f?siteid=yhoof2&yptr=yahoo",
    "thumbnail": "",
    "pubDate": "2025-12-18T21:19:00+00:00"
  },
  {
    "title": "Tesla Stock Rebounds After AI Selloff. Why the Fears Didn’t Make Sense.",
    "description": "",
    "link": "https://www.barrons.com/articles/tesla-stock-price-ai-selloff-9f942acb?siteid=yhoof2&yptr=yahoo",
    "thumbnail": "",
    "pubDate": "2025-12-18T21:16:00+00:00"
  },
  {
    "title": "GE Vernova Stock Recovers as the AI Trade Rebounds",
    "description": "",
    "link": "https://www.barrons.com/articles/ge-vernova-stock-nvidia-ai-cf471330?siteid=yhoof2&yptr=yahoo",
    "thumbnail": "",
    "pubDate": "2025-12-18T21:16:00+00:00"
  },
  {
    "title": "The 'Worst-Case Scenario' — Why Insmed Just Reversed After A 181% Six-Month Sprint",
    "description": "",
    "link": "https://www.investors.com/news/technology/insmed-stock-brensocatib-failure-rhinosinusitis/?src=A00220&yptr=yahoo",
    "thumbnail": "https://www.investors.com/wp-content/uploads/2023/09/Stock-Insmed-01-shutt.jpg",
    "pubDate": "2025-12-18T21:15:59+00:00"
  },
  {
    "title": "BTC price update: Bitcoin, crypto market could plummet again on ‘Witching Friday.’ Here’s why",
    "description": "",
    "link": "https://finance.yahoo.com/news/btc-price-bitcoin-crypto-market-211500641.html",
    "thumbnail": "https://s.yimg.com/ny/api/res/1.2/RPXLNwxuHHOBgzZ99Zw67w--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyMDA7aD02NzU-/https://media.zenfs.com/en/fastcompany_735/48a34b6cf4e809c61acdf39d16026ebb",
    "pubDate": "2025-12-18T21:15:00+00:00"
  },
  {
    "title": "My Top Vanguard ETFs To Buy In 2026",
    "description": "",
    "link": "https://finance.yahoo.com/news/top-vanguard-etfs-buy-2026-211311739.html",
    "thumbnail": "https://s.yimg.com/ny/api/res/1.2/OuAaP19lIEokWHYYwAVXIA--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyMDA7aD02NzQ-/https://media.zenfs.com/en/24_7_wall_st__718/5675d93d5665df35cd7bbc73e52f44ee",
    "pubDate": "2025-12-18T21:13:11+00:00"
  },
  {
    "title": "These Stocks Moved the Most Today: Micron, DJT, Accenture, Tilray, Lululemon, Medline, Rivian, and More",
    "description": "",
    "link": "https://www.barrons.com/articles/stock-movers-1aad3070?siteid=yhoof2&yptr=yahoo",
    "thumbnail": "",
    "pubDate": "2025-12-18T21:13:00+00:00"
  },
  {
    "title": "Micron Stock Jumps On 'Stunning' Quarterly Results, Guidance",
    "description": "",
    "link": "https://www.investors.com/news/technology/micron-stock-mu-jumps-stunning-fiscal-q1-2026-report/?src=A00220&yptr=yahoo",
    "thumbnail": "https://www.investors.com/wp-content/uploads/2025/12/Stock-Micron-SOCAMM2-company.jpg",
    "pubDate": "2025-12-18T21:12:07+00:00"
  },
  {
    "title": "Pasta Carbonara With Pancetta",
    "description": "This classic carbonara traps crispy pancetta and all that silky sauce in big tubes of rigatoni.",
    "link": "https://www.bonappetit.com/recipe/classic-pasta-carbonara",
    "thumbnail": "https://assets.bonappetit.com/photos/693b3fdb2eca0bc88446ebf3/master/pass/pasta-carbonara_RECIPE_V4_121025_3646_VOG_final.jpg",
    "pubDate": "2025-12-18T17:13:03+00:00"
  },
  {
    "title": "Micron stock soars on earnings beat amid 'unprecedented' AI-fueled demand for memory chips",
    "description": "",
    "link": "https://finance.yahoo.com/news/micron-stock-soars-on-earnings-beat-amid-unprecedented-ai-fueled-demand-for-memory-chips-164848986.html",
    "thumbnail": "https://s.yimg.com/ny/api/res/1.2/cdgd21cdq5P9JRtDXS.s8A--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyMDA7aD04MDA-/https://s.yimg.com/os/creatr-uploaded-images/2025-09/48d41b80-9583-11f0-85f5-51d7abc2a309",
    "pubDate": "2025-12-18T16:48:48+00:00"
  },
  {
    "title": "How to Throw a Retro Fondue Party at Home",
    "description": "The throwback dish is the perfect, cozy dish for stress-free winter entertaining.",
    "link": "https://www.bonappetit.com/story/how-to-throw-fondue-party-at-home",
    "thumbnail": "https://assets.bonappetit.com/photos/69441e9e35f2e0b709f93686/master/pass/12.10_BA_Party%20Like%20It%E2%80%99s%201969%20%E2%80%93%20How%20to%20Throw%20a%20Fondue%20Party%20at%20Home_v3.jpg",
    "pubDate": "2025-12-18T16:30:52+00:00"
  },
  {
    "title": "How Much Should You Spend on a Good Pan",
    "description": "And what makes some pans so much more expensive than others.",
    "link": "https://www.bonappetit.com/story/how-much-should-you-spend-on-a-good-pan",
    "thumbnail": "https://assets.bonappetit.com/photos/5c3e499ad716ea67c88032d0/master/pass/epi-stainless-steel-skillet.jpg",
    "pubDate": "2025-12-18T13:54:00+00:00"
  },
  {
    "title": "I Ate HelloFresh Meal Kits Every Day for a Week—Here's What I Learned",
    "description": "I expected cooking every night would be daunting or that I’d get bored, but I actually loved it.",
    "link": "https://www.bonappetit.com/story/hello-fresh-meal-kit-one-week-review",
    "thumbnail": "https://assets.bonappetit.com/photos/6942df7c18c310b8a38672e5/master/pass/12.15_BA_Week%20with%20HelloFresh%20review%20lede_v2%20(1).jpg",
    "pubDate": "2025-12-17T21:20:22+00:00"
  },
  {
    "title": "Blue Apron Holiday Meal Kits Save Me When Hosting Large Events",
    "description": "They’re also perfect if you need to bring a dish to a party or potluck.",
    "link": "https://www.bonappetit.com/story/blue-apron-holiday-meal-kits-save-me-when-hosting-large-events",
    "thumbnail": "https://assets.bonappetit.com/photos/694301e318c310b8a38672e7/master/pass/12.15_BA_Lede%20Image%20Blue%20Apron%20for%20the%20Holidays_v2.jpg",
    "pubDate": "2025-12-17T18:18:19+00:00"
  }
]